HomuraVehicle/homuraLib_v2/machine/device/p32mz2048efg100_forVC.c
/*-------------------------------------------------------------------------
 * PIC32MZ2048EFG100 processor header
 * Build date : May 01 2015
 *
 * This software is developed by Microchip Technology Inc. and its
 * subsidiaries ("Microchip").
 * 
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are 
 * met:
 * 
 * 1.      Redistributions of source code must retain the above copyright
 *         notice, this list of conditions and the following disclaimer.
 * 2.      Redistributions in binary form must reproduce the above 
 *         copyright notice, this list of conditions and the following 
 *         disclaimer in the documentation and/or other materials provided 
 *         with the distribution.
 * 3.      Microchip's name may not be used to endorse or promote products
 *         derived from this software without specific prior written 
 *         permission.
 * 
 * THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED
 * WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF
 * MERCHANTABILITY AND FITNESS FOR PURPOSE ARE DISCLAIMED. IN NO EVENT 
 * SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
 * EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS;
 * OR BUSINESS INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 * WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR 
 * OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF
 * ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 * 
 */
#include"p32mz2048efg100_forVC.h"

//#define HMR_P32MZ2048EFG100FORVC_INC
//#define HMR_PICDEFINES

//#define __LANGUAGE_C__ 0

//#define ;//__attribute__(macro)
//#define ;//__asm__(macro)
//#define __asm(macro)


#if defined (__LANGUAGE_C__) || defined (__LANGUAGE_C_PLUS_PLUS)

#ifdef __cplusplus
"C" {
#endif

volatile unsigned int        CFGCON ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned TDOEN:1;
  unsigned :1;
  unsigned TROEN:1;
  unsigned JTAGEN:1;
  unsigned ECCCON:2;
  unsigned :1;
  unsigned IOANCPN:1;
  unsigned USBSSEN:1;
  unsigned :2;
  unsigned PGLOCK:1;
  unsigned PMDLOCK:1;
  unsigned IOLOCK:1;
  unsigned :2;
  unsigned OCACLK:1;
  unsigned ICACLK:1;
  unsigned :6;
  unsigned CPUPRI:1;
  unsigned DMAPRI:1;
} __CFGCONbits_t;*/
volatile __CFGCONbits_t CFGCONbits ;//__asm__ ("CFGCON") ;//__attribute__((section("sfrs")));
volatile unsigned int        DEVID ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned DEVID:28;
  unsigned VER:4;
} __DEVIDbits_t;*/
volatile __DEVIDbits_t DEVIDbits ;//__asm__ ("DEVID") ;//__attribute__((section("sfrs")));
volatile unsigned int        SYSKEY ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned SYSKEY:32;
} __SYSKEYbits_t;*/
volatile __SYSKEYbits_t SYSKEYbits ;//__asm__ ("SYSKEY") ;//__attribute__((section("sfrs")));
volatile unsigned int        PMD1 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned ADCMD:1;
  unsigned :11;
  unsigned CVRMD:1;
} __PMD1bits_t;*/
volatile __PMD1bits_t PMD1bits ;//__asm__ ("PMD1") ;//__attribute__((section("sfrs")));
volatile unsigned int        PMD1CLR ;//__attribute__((section("sfrs")));
volatile unsigned int        PMD1SET ;//__attribute__((section("sfrs")));
volatile unsigned int        PMD1INV ;//__attribute__((section("sfrs")));
volatile unsigned int        PMD2 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned CMP1MD:1;
  unsigned CMP2MD:1;
} __PMD2bits_t;*/
volatile __PMD2bits_t PMD2bits ;//__asm__ ("PMD2") ;//__attribute__((section("sfrs")));
volatile unsigned int        PMD2CLR ;//__attribute__((section("sfrs")));
volatile unsigned int        PMD2SET ;//__attribute__((section("sfrs")));
volatile unsigned int        PMD2INV ;//__attribute__((section("sfrs")));
volatile unsigned int        PMD3 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned IC1MD:1;
  unsigned IC2MD:1;
  unsigned IC3MD:1;
  unsigned IC4MD:1;
  unsigned IC5MD:1;
  unsigned IC6MD:1;
  unsigned IC7MD:1;
  unsigned IC8MD:1;
  unsigned IC9MD:1;
  unsigned :7;
  unsigned OC1MD:1;
  unsigned OC2MD:1;
  unsigned OC3MD:1;
  unsigned OC4MD:1;
  unsigned OC5MD:1;
  unsigned OC6MD:1;
  unsigned OC7MD:1;
  unsigned OC8MD:1;
  unsigned OC9MD:1;
} __PMD3bits_t;*/
volatile __PMD3bits_t PMD3bits ;//__asm__ ("PMD3") ;//__attribute__((section("sfrs")));
volatile unsigned int        PMD3CLR ;//__attribute__((section("sfrs")));
volatile unsigned int        PMD3SET ;//__attribute__((section("sfrs")));
volatile unsigned int        PMD3INV ;//__attribute__((section("sfrs")));
volatile unsigned int        PMD4 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned T1MD:1;
  unsigned T2MD:1;
  unsigned T3MD:1;
  unsigned T4MD:1;
  unsigned T5MD:1;
  unsigned T6MD:1;
  unsigned T7MD:1;
  unsigned T8MD:1;
  unsigned T9MD:1;
} __PMD4bits_t;*/
volatile __PMD4bits_t PMD4bits ;//__asm__ ("PMD4") ;//__attribute__((section("sfrs")));
volatile unsigned int        PMD4CLR ;//__attribute__((section("sfrs")));
volatile unsigned int        PMD4SET ;//__attribute__((section("sfrs")));
volatile unsigned int        PMD4INV ;//__attribute__((section("sfrs")));
volatile unsigned int        PMD5 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned U1MD:1;
  unsigned U2MD:1;
  unsigned U3MD:1;
  unsigned U4MD:1;
  unsigned U5MD:1;
  unsigned U6MD:1;
  unsigned :2;
  unsigned SPI1MD:1;
  unsigned SPI2MD:1;
  unsigned SPI3MD:1;
  unsigned SPI4MD:1;
  unsigned SPI5MD:1;
  unsigned SPI6MD:1;
  unsigned :2;
  unsigned I2C1MD:1;
  unsigned I2C2MD:1;
  unsigned I2C3MD:1;
  unsigned I2C4MD:1;
  unsigned I2C5MD:1;
  unsigned :3;
  unsigned USBMD:1;
} __PMD5bits_t;*/
volatile __PMD5bits_t PMD5bits ;//__asm__ ("PMD5") ;//__attribute__((section("sfrs")));
volatile unsigned int        PMD5CLR ;//__attribute__((section("sfrs")));
volatile unsigned int        PMD5SET ;//__attribute__((section("sfrs")));
volatile unsigned int        PMD5INV ;//__attribute__((section("sfrs")));
volatile unsigned int        PMD6 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned RTCCMD:1;
  unsigned :7;
  unsigned REFO1MD:1;
  unsigned REFO2MD:1;
  unsigned REFO3MD:1;
  unsigned REFO4MD:1;
  unsigned :4;
  unsigned PMPMD:1;
  unsigned EBIMD:1;
  unsigned :5;
  unsigned SQI1MD:1;
  unsigned :4;
  unsigned ETHMD:1;
} __PMD6bits_t;*/
volatile __PMD6bits_t PMD6bits ;//__asm__ ("PMD6") ;//__attribute__((section("sfrs")));
volatile unsigned int        PMD6CLR ;//__attribute__((section("sfrs")));
volatile unsigned int        PMD6SET ;//__attribute__((section("sfrs")));
volatile unsigned int        PMD6INV ;//__attribute__((section("sfrs")));
volatile unsigned int        PMD7 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned :4;
  unsigned DMAMD:1;
  unsigned :15;
  unsigned RNGMD:1;
} __PMD7bits_t;*/
