HomuraVehicle/homuraLib_v2/machine/device/p32mz2048efg100_forVC.c
volatile __PMD7bits_t PMD7bits ;//__asm__ ("PMD7") ;//__attribute__((section("sfrs")));
volatile unsigned int        PMD7CLR ;//__attribute__((section("sfrs")));
volatile unsigned int        PMD7SET ;//__attribute__((section("sfrs")));
volatile unsigned int        PMD7INV ;//__attribute__((section("sfrs")));
volatile unsigned int        CFGEBIA ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned EBIA0EN:1;
  unsigned EBIA1EN:1;
  unsigned EBIA2EN:1;
  unsigned EBIA3EN:1;
  unsigned EBIA4EN:1;
  unsigned EBIA5EN:1;
  unsigned EBIA6EN:1;
  unsigned EBIA7EN:1;
  unsigned EBIA8EN:1;
  unsigned EBIA9EN:1;
  unsigned EBIA10EN:1;
  unsigned EBIA11EN:1;
  unsigned EBIA12EN:1;
  unsigned EBIA13EN:1;
  unsigned EBIA14EN:1;
  unsigned EBIA15EN:1;
  unsigned EBIA16EN:1;
  unsigned EBIA17EN:1;
  unsigned EBIA18EN:1;
  unsigned EBIA19EN:1;
  unsigned EBIA20EN:1;
  unsigned EBIA21EN:1;
  unsigned EBIA22EN:1;
  unsigned EBIA23EN:1;
  unsigned :7;
  unsigned EBIPINEN:1;
} __CFGEBIAbits_t;*/
volatile __CFGEBIAbits_t CFGEBIAbits ;//__asm__ ("CFGEBIA") ;//__attribute__((section("sfrs")));
volatile unsigned int        CFGEBIACLR ;//__attribute__((section("sfrs")));
volatile unsigned int        CFGEBIASET ;//__attribute__((section("sfrs")));
volatile unsigned int        CFGEBIAINV ;//__attribute__((section("sfrs")));
volatile unsigned int        CFGEBIC ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned EBIDEN0:1;
  unsigned EBIDEN1:1;
  unsigned :2;
  unsigned EBICSEN0:1;
  unsigned EBICSEN1:1;
  unsigned EBICSEN2:1;
  unsigned EBICSEN3:1;
  unsigned EBIBSEN0:1;
  unsigned EBIBSEN1:1;
  unsigned :2;
  unsigned EBIOEEN:1;
  unsigned EBIWEEN:1;
  unsigned :2;
  unsigned EBIRPEN:1;
  unsigned EBIRDYLVL:1;
  unsigned :7;
  unsigned EBIRDYEN1:1;
  unsigned EBIRDYEN2:1;
  unsigned EBIRDYEN3:1;
  unsigned :1;
  unsigned EBIRDYINV1:1;
  unsigned EBIRDYINV2:1;
  unsigned EBIRDYINV3:1;
} __CFGEBICbits_t;*/
volatile __CFGEBICbits_t CFGEBICbits ;//__asm__ ("CFGEBIC") ;//__attribute__((section("sfrs")));
volatile unsigned int        CFGEBICCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        CFGEBICSET ;//__attribute__((section("sfrs")));
volatile unsigned int        CFGEBICINV ;//__attribute__((section("sfrs")));
volatile unsigned int        CFGPG ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned CPUPG:2;
  unsigned :2;
  unsigned DMAPG:2;
  unsigned :2;
  unsigned USBPG:2;
  unsigned :6;
  unsigned ETHPG:2;
  unsigned :2;
  unsigned SQI1PG:2;
  unsigned FCPG:2;
  unsigned :6;
  unsigned ICD1PG:2;
} __CFGPGbits_t;*/
volatile __CFGPGbits_t CFGPGbits ;//__asm__ ("CFGPG") ;//__attribute__((section("sfrs")));
volatile unsigned int        CFGPGCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        CFGPGSET ;//__attribute__((section("sfrs")));
volatile unsigned int        CFGPGINV ;//__attribute__((section("sfrs")));
volatile unsigned int        NVMCON ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned NVMOP:4;
    unsigned :2;
    unsigned BFSWAP:1;
    unsigned PFSWAP:1;
    unsigned :4;
    unsigned LVDERR:1;
    unsigned WRERR:1;
    unsigned WREN:1;
    unsigned WR:1;
  };
  struct {
    unsigned NVMOP0:1;
    unsigned NVMOP1:1;
    unsigned NVMOP2:1;
    unsigned NVMOP3:1;
    unsigned :3;
    unsigned SWAP:1;
  };
  struct {
    unsigned PROGOP:4;
  };
  struct {
    unsigned PROGOP0:1;
    unsigned PROGOP1:1;
    unsigned PROGOP2:1;
    unsigned PROGOP3:1;
  };
  struct {
    unsigned w:32;
  };
} __NVMCONbits_t;*/
volatile __NVMCONbits_t NVMCONbits ;//__asm__ ("NVMCON") ;//__attribute__((section("sfrs")));
volatile unsigned int        NVMCONCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        NVMCONSET ;//__attribute__((section("sfrs")));
volatile unsigned int        NVMCONINV ;//__attribute__((section("sfrs")));
volatile unsigned int        NVMKEY ;//__attribute__((section("sfrs")));
volatile unsigned int        NVMADDR ;//__attribute__((section("sfrs")));
volatile unsigned int        NVMADDRCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        NVMADDRSET ;//__attribute__((section("sfrs")));
volatile unsigned int        NVMADDRINV ;//__attribute__((section("sfrs")));
volatile unsigned int        NVMDATA0 ;//__attribute__((section("sfrs")));
volatile unsigned int        NVMDATA1 ;//__attribute__((section("sfrs")));
volatile unsigned int        NVMDATA2 ;//__attribute__((section("sfrs")));
volatile unsigned int        NVMDATA3 ;//__attribute__((section("sfrs")));
volatile unsigned int        NVMSRCADDR ;//__attribute__((section("sfrs")));
volatile unsigned int        NVMPWP ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned PWP:24;
  unsigned :7;
  unsigned PWPULOCK:1;
} __NVMPWPbits_t;*/
volatile __NVMPWPbits_t NVMPWPbits ;//__asm__ ("NVMPWP") ;//__attribute__((section("sfrs")));
volatile unsigned int        NVMBWP ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned UBWP0:1;
  unsigned UBWP1:1;
  unsigned UBWP2:1;
  unsigned UBWP3:1;
  unsigned UBWP4:1;
  unsigned :2;
  unsigned UBWPULOCK:1;
  unsigned LBWP0:1;
  unsigned LBWP1:1;
  unsigned LBWP2:1;
  unsigned LBWP3:1;
  unsigned LBWP4:1;
  unsigned :2;
  unsigned LBWPULOCK:1;
} __NVMBWPbits_t;*/
volatile __NVMBWPbits_t NVMBWPbits ;//__asm__ ("NVMBWP") ;//__attribute__((section("sfrs")));
volatile unsigned int        NVMBWPCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        NVMBWPSET ;//__attribute__((section("sfrs")));
volatile unsigned int        NVMBWPINV ;//__attribute__((section("sfrs")));
volatile unsigned int        NVMCON2 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned :6;
  unsigned SWAPLOCK:2;
} __NVMCON2bits_t;*/
volatile __NVMCON2bits_t NVMCON2bits ;//__asm__ ("NVMCON2") ;//__attribute__((section("sfrs")));
volatile unsigned int        WDTCON ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned WDTWINEN:1;
  unsigned :7;
  unsigned RUNDIV:5;
  unsigned :2;
  unsigned ON:1;
  unsigned WDTCLRKEY:16;
} __WDTCONbits_t;*/
