HomuraVehicle/homuraLib_v2/machine/device/p32mz2048efg100_forVC.c
volatile __WDTCONbits_t WDTCONbits ;//__asm__ ("WDTCON") ;//__attribute__((section("sfrs")));
volatile unsigned int        WDTCONCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        WDTCONSET ;//__attribute__((section("sfrs")));
volatile unsigned int        WDTCONINV ;//__attribute__((section("sfrs")));
volatile unsigned int        DMTCON ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned :15;
  unsigned ON:1;
} __DMTCONbits_t;*/
volatile __DMTCONbits_t DMTCONbits ;//__asm__ ("DMTCON") ;//__attribute__((section("sfrs")));
volatile unsigned int        DMTPRECLR ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned :8;
  unsigned STEP1:8;
} __DMTPRECLRbits_t;*/
volatile __DMTPRECLRbits_t DMTPRECLRbits ;//__asm__ ("DMTPRECLR") ;//__attribute__((section("sfrs")));
volatile unsigned int        DMTCLR ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned STEP2:8;
} __DMTCLRbits_t;*/
volatile __DMTCLRbits_t DMTCLRbits ;//__asm__ ("DMTCLR") ;//__attribute__((section("sfrs")));
volatile unsigned int        DMTSTAT ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned WINOPN:1;
    unsigned :4;
    unsigned DMTEVENT:1;
    unsigned BAD:2;
  };
  struct {
    unsigned :6;
    unsigned BAD2:1;
    unsigned BAD1:1;
  };
  struct {
    unsigned w:32;
  };
} __DMTSTATbits_t;*/
volatile __DMTSTATbits_t DMTSTATbits ;//__asm__ ("DMTSTAT") ;//__attribute__((section("sfrs")));
volatile unsigned int        DMTCNT ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned COUNTER:32;
} __DMTCNTbits_t;*/
volatile __DMTCNTbits_t DMTCNTbits ;//__asm__ ("DMTCNT") ;//__attribute__((section("sfrs")));
volatile unsigned int        DMTPSCNT ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned PSCNT:32;
} __DMTPSCNTbits_t;*/
volatile __DMTPSCNTbits_t DMTPSCNTbits ;//__asm__ ("DMTPSCNT") ;//__attribute__((section("sfrs")));
volatile unsigned int        DMTPSINTV ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned PSINTV:32;
} __DMTPSINTVbits_t;*/
volatile __DMTPSINTVbits_t DMTPSINTVbits ;//__asm__ ("DMTPSINTV") ;//__attribute__((section("sfrs")));
volatile unsigned int        RTCCON ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned RTCOE:1;
    unsigned HALFSEC:1;
    unsigned RTCSYNC:1;
    unsigned RTCWREN:1;
    unsigned :2;
    unsigned RTCCLKON:1;
    unsigned RTCOUTSEL:2;
    unsigned RTCCLKSEL:2;
    unsigned :2;
    unsigned SIDL:1;
    unsigned :1;
    unsigned ON:1;
    unsigned CAL:10;
  };
  struct {
    unsigned w:32;
  };
} __RTCCONbits_t;*/
volatile __RTCCONbits_t RTCCONbits ;//__asm__ ("RTCCON") ;//__attribute__((section("sfrs")));
volatile unsigned int        RTCCONCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        RTCCONSET ;//__attribute__((section("sfrs")));
volatile unsigned int        RTCCONINV ;//__attribute__((section("sfrs")));
volatile unsigned int        RTCALRM ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned ARPT:8;
    unsigned AMASK:4;
    unsigned ALRMSYNC:1;
    unsigned PIV:1;
    unsigned CHIME:1;
    unsigned ALRMEN:1;
  };
  struct {
    unsigned w:32;
  };
} __RTCALRMbits_t;*/
volatile __RTCALRMbits_t RTCALRMbits ;//__asm__ ("RTCALRM") ;//__attribute__((section("sfrs")));
volatile unsigned int        RTCALRMCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        RTCALRMSET ;//__attribute__((section("sfrs")));
volatile unsigned int        RTCALRMINV ;//__attribute__((section("sfrs")));
volatile unsigned int        RTCTIME ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned :8;
    unsigned SEC01:4;
    unsigned SEC10:4;
    unsigned MIN01:4;
    unsigned MIN10:4;
    unsigned HR01:4;
    unsigned HR10:4;
  };
  struct {
    unsigned w:32;
  };
} __RTCTIMEbits_t;*/
volatile __RTCTIMEbits_t RTCTIMEbits ;//__asm__ ("RTCTIME") ;//__attribute__((section("sfrs")));
volatile unsigned int        RTCTIMECLR ;//__attribute__((section("sfrs")));
volatile unsigned int        RTCTIMESET ;//__attribute__((section("sfrs")));
volatile unsigned int        RTCTIMEINV ;//__attribute__((section("sfrs")));
volatile unsigned int        RTCDATE ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned WDAY01:4;
    unsigned :4;
    unsigned DAY01:4;
    unsigned DAY10:4;
    unsigned MONTH01:4;
    unsigned MONTH10:4;
    unsigned YEAR01:4;
    unsigned YEAR10:4;
  };
  struct {
    unsigned w:32;
  };
} __RTCDATEbits_t;*/
volatile __RTCDATEbits_t RTCDATEbits ;//__asm__ ("RTCDATE") ;//__attribute__((section("sfrs")));
volatile unsigned int        RTCDATECLR ;//__attribute__((section("sfrs")));
volatile unsigned int        RTCDATESET ;//__attribute__((section("sfrs")));
volatile unsigned int        RTCDATEINV ;//__attribute__((section("sfrs")));
volatile unsigned int        ALRMTIME ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned :8;
    unsigned SEC01:4;
    unsigned SEC10:4;
    unsigned MIN01:4;
    unsigned MIN10:4;
    unsigned HR01:4;
    unsigned HR10:4;
  };
  struct {
    unsigned w:32;
  };
} __ALRMTIMEbits_t;*/
volatile __ALRMTIMEbits_t ALRMTIMEbits ;//__asm__ ("ALRMTIME") ;//__attribute__((section("sfrs")));
volatile unsigned int        ALRMTIMECLR ;//__attribute__((section("sfrs")));
volatile unsigned int        ALRMTIMESET ;//__attribute__((section("sfrs")));
volatile unsigned int        ALRMTIMEINV ;//__attribute__((section("sfrs")));
volatile unsigned int        ALRMDATE ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned WDAY01:4;
    unsigned :4;
    unsigned DAY01:4;
    unsigned DAY10:4;
    unsigned MONTH01:4;
    unsigned MONTH10:4;
  };
  struct {
    unsigned w:32;
  };
} __ALRMDATEbits_t;*/
volatile __ALRMDATEbits_t ALRMDATEbits ;//__asm__ ("ALRMDATE") ;//__attribute__((section("sfrs")));
volatile unsigned int        ALRMDATECLR ;//__attribute__((section("sfrs")));
volatile unsigned int        ALRMDATESET ;//__attribute__((section("sfrs")));
volatile unsigned int        ALRMDATEINV ;//__attribute__((section("sfrs")));
volatile unsigned int        CVRCON ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned CVR:4;
    unsigned CVRSS:1;
    unsigned CVRR:1;
    unsigned CVROE:1;
    unsigned :8;
    unsigned ON:1;
  };
  struct {
    unsigned CVR0:1;
    unsigned CVR1:1;
    unsigned CVR2:1;
    unsigned CVR3:1;
  };
  struct {
    unsigned w:32;
  };
} __CVRCONbits_t;*/
volatile __CVRCONbits_t CVRCONbits ;//__asm__ ("CVRCON") ;//__attribute__((section("sfrs")));
volatile unsigned int        CVRCONCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        CVRCONSET ;//__attribute__((section("sfrs")));
volatile unsigned int        CVRCONINV ;//__attribute__((section("sfrs")));
volatile unsigned int        _ICDCON ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned CKSWBKEN:1;
  unsigned SLPBKEN:1;
  unsigned WDTBKEN:1;
  unsigned WDTEN:1;
  unsigned RSTBUG:1;
  unsigned DMTBKEN:1;
  unsigned DMTEN:1;
  unsigned :7;
  unsigned FRZ:1;
} ___ICDCONbits_t;*/
volatile ___ICDCONbits_t _ICDCONbits ;//__asm__ ("_ICDCON") ;//__attribute__((section("sfrs")));
volatile unsigned int        _ICDSTAT ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned CKSWBF:1;
  unsigned SLPBF:1;
  unsigned WDTBF:1;
  unsigned DMTBF:1;
} ___ICDSTATbits_t;*/
volatile ___ICDSTATbits_t _ICDSTATbits ;//__asm__ ("_ICDSTAT") ;//__attribute__((section("sfrs")));
volatile unsigned int        OSCCON ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned OSWEN:1;
  unsigned SOSCEN:1;
  unsigned :1;
  unsigned CF:1;
  unsigned SLPEN:1;
  unsigned :2;
  unsigned CLKLOCK:1;
  unsigned NOSC:3;
  unsigned :1;
  unsigned COSC:3;
  unsigned :6;
  unsigned SLP2SPD:1;
  unsigned :1;
  unsigned DRMEN:1;
  unsigned FRCDIV:3;
} __OSCCONbits_t;*/
volatile __OSCCONbits_t OSCCONbits ;//__asm__ ("OSCCON") ;//__attribute__((section("sfrs")));
volatile unsigned int        OSCCONCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        OSCCONSET ;//__attribute__((section("sfrs")));
volatile unsigned int        OSCCONINV ;//__attribute__((section("sfrs")));
volatile unsigned int        OSCTUN ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned TUN:6;
} __OSCTUNbits_t;*/
volatile __OSCTUNbits_t OSCTUNbits ;//__asm__ ("OSCTUN") ;//__attribute__((section("sfrs")));
volatile unsigned int        OSCTUNCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        OSCTUNSET ;//__attribute__((section("sfrs")));
volatile unsigned int        OSCTUNINV ;//__attribute__((section("sfrs")));
volatile unsigned int        SPLLCON ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned PLLRANGE:3;
  unsigned :4;
  unsigned PLLICLK:1;
  unsigned PLLIDIV:3;
  unsigned :5;
  unsigned PLLMULT:7;
  unsigned :1;
  unsigned PLLODIV:3;
} __SPLLCONbits_t;*/
volatile __SPLLCONbits_t SPLLCONbits ;//__asm__ ("SPLLCON") ;//__attribute__((section("sfrs")));
volatile unsigned int        SPLLCONCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        SPLLCONSET ;//__attribute__((section("sfrs")));
volatile unsigned int        SPLLCONINV ;//__attribute__((section("sfrs")));
volatile unsigned int        RCON ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned POR:1;
  unsigned BOR:1;
  unsigned IDLE:1;
  unsigned SLEEP:1;
  unsigned WDTO:1;
  unsigned DMTO:1;
  unsigned SWR:1;
  unsigned EXTR:1;
  unsigned :1;
  unsigned CMR:1;
  unsigned :16;
  unsigned BCFGFAIL:1;
  unsigned BCFGERR:1;
} __RCONbits_t;*/
