HomuraVehicle/homuraLib_v2/machine/device/p32mz2048efg100_forVC.c
volatile __PB2DIVbits_t PB2DIVbits ;//__asm__ ("PB2DIV") ;//__attribute__((section("sfrs")));
volatile unsigned int        PB2DIVCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        PB2DIVSET ;//__attribute__((section("sfrs")));
volatile unsigned int        PB2DIVINV ;//__attribute__((section("sfrs")));
volatile unsigned int        PB3DIV ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned PBDIV:7;
  unsigned :4;
  unsigned PBDIVRDY:1;
  unsigned :3;
  unsigned ON:1;
} __PB3DIVbits_t;*/
volatile __PB3DIVbits_t PB3DIVbits ;//__asm__ ("PB3DIV") ;//__attribute__((section("sfrs")));
volatile unsigned int        PB3DIVCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        PB3DIVSET ;//__attribute__((section("sfrs")));
volatile unsigned int        PB3DIVINV ;//__attribute__((section("sfrs")));
volatile unsigned int        PB4DIV ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned PBDIV:7;
  unsigned :4;
  unsigned PBDIVRDY:1;
  unsigned :3;
  unsigned ON:1;
} __PB4DIVbits_t;*/
volatile __PB4DIVbits_t PB4DIVbits ;//__asm__ ("PB4DIV") ;//__attribute__((section("sfrs")));
volatile unsigned int        PB4DIVCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        PB4DIVSET ;//__attribute__((section("sfrs")));
volatile unsigned int        PB4DIVINV ;//__attribute__((section("sfrs")));
volatile unsigned int        PB5DIV ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned PBDIV:7;
  unsigned :4;
  unsigned PBDIVRDY:1;
  unsigned :3;
  unsigned ON:1;
} __PB5DIVbits_t;*/
volatile __PB5DIVbits_t PB5DIVbits ;//__asm__ ("PB5DIV") ;//__attribute__((section("sfrs")));
volatile unsigned int        PB5DIVCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        PB5DIVSET ;//__attribute__((section("sfrs")));
volatile unsigned int        PB5DIVINV ;//__attribute__((section("sfrs")));
volatile unsigned int        PB7DIV ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned PBDIV:7;
  unsigned :4;
  unsigned PBDIVRDY:1;
  unsigned :3;
  unsigned ON:1;
} __PB7DIVbits_t;*/
volatile __PB7DIVbits_t PB7DIVbits ;//__asm__ ("PB7DIV") ;//__attribute__((section("sfrs")));
volatile unsigned int        PB7DIVCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        PB7DIVSET ;//__attribute__((section("sfrs")));
volatile unsigned int        PB7DIVINV ;//__attribute__((section("sfrs")));
volatile unsigned int        PB8DIV ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned PBDIV:7;
  unsigned :4;
  unsigned PBDIVRDY:1;
  unsigned :3;
  unsigned ON:1;
} __PB8DIVbits_t;*/
volatile __PB8DIVbits_t PB8DIVbits ;//__asm__ ("PB8DIV") ;//__attribute__((section("sfrs")));
volatile unsigned int        PB8DIVCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        PB8DIVSET ;//__attribute__((section("sfrs")));
volatile unsigned int        PB8DIVINV ;//__attribute__((section("sfrs")));
volatile unsigned int        SLEWCON ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned BUSY:1;
  unsigned DNEN:1;
  unsigned UPEN:1;
  unsigned :5;
  unsigned SLWDIV:3;
  unsigned :5;
  unsigned SYSDIV:4;
} __SLEWCONbits_t;*/
volatile __SLEWCONbits_t SLEWCONbits ;//__asm__ ("SLEWCON") ;//__attribute__((section("sfrs")));
volatile unsigned int        SLEWCONCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        SLEWCONSET ;//__attribute__((section("sfrs")));
volatile unsigned int        SLEWCONINV ;//__attribute__((section("sfrs")));
volatile unsigned int        CLKSTAT ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned FRCRDY:1;
    unsigned SPDIVRDY:1;
    unsigned POSCRDY:1;
    unsigned :1;
    unsigned SOSCRDY:1;
    unsigned LPRCRDY:1;
  };
  struct {
    unsigned :1;
    unsigned DIVSPLLRDY:1;
  };
} __CLKSTATbits_t;*/
volatile __CLKSTATbits_t CLKSTATbits ;//__asm__ ("CLKSTAT") ;//__attribute__((section("sfrs")));
volatile unsigned int        CLKSTATCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        CLKSTATSET ;//__attribute__((section("sfrs")));
volatile unsigned int        CLKSTATINV ;//__attribute__((section("sfrs")));
volatile unsigned int        INT1R ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned INT1R:4;
} __INT1Rbits_t;*/
volatile __INT1Rbits_t INT1Rbits ;//__asm__ ("INT1R") ;//__attribute__((section("sfrs")));
volatile unsigned int        INT2R ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned INT2R:4;
} __INT2Rbits_t;*/
volatile __INT2Rbits_t INT2Rbits ;//__asm__ ("INT2R") ;//__attribute__((section("sfrs")));
volatile unsigned int        INT3R ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned INT3R:4;
} __INT3Rbits_t;*/
volatile __INT3Rbits_t INT3Rbits ;//__asm__ ("INT3R") ;//__attribute__((section("sfrs")));
volatile unsigned int        INT4R ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned INT4R:4;
} __INT4Rbits_t;*/
volatile __INT4Rbits_t INT4Rbits ;//__asm__ ("INT4R") ;//__attribute__((section("sfrs")));
volatile unsigned int        T2CKR ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned T2CKR:4;
} __T2CKRbits_t;*/
volatile __T2CKRbits_t T2CKRbits ;//__asm__ ("T2CKR") ;//__attribute__((section("sfrs")));
volatile unsigned int        T3CKR ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned T3CKR:4;
} __T3CKRbits_t;*/
volatile __T3CKRbits_t T3CKRbits ;//__asm__ ("T3CKR") ;//__attribute__((section("sfrs")));
volatile unsigned int        T4CKR ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned T4CKR:4;
} __T4CKRbits_t;*/
volatile __T4CKRbits_t T4CKRbits ;//__asm__ ("T4CKR") ;//__attribute__((section("sfrs")));
volatile unsigned int        T5CKR ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned T5CKR:4;
} __T5CKRbits_t;*/
volatile __T5CKRbits_t T5CKRbits ;//__asm__ ("T5CKR") ;//__attribute__((section("sfrs")));
volatile unsigned int        T6CKR ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned T6CKR:4;
} __T6CKRbits_t;*/
volatile __T6CKRbits_t T6CKRbits ;//__asm__ ("T6CKR") ;//__attribute__((section("sfrs")));
volatile unsigned int        T7CKR ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned T7CKR:4;
} __T7CKRbits_t;*/
