HomuraVehicle/homuraLib_v2/machine/device/p32mz2048efg100_forVC.c
volatile __T7CKRbits_t T7CKRbits ;//__asm__ ("T7CKR") ;//__attribute__((section("sfrs")));
volatile unsigned int        T8CKR ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned T8CKR:4;
} __T8CKRbits_t;*/
volatile __T8CKRbits_t T8CKRbits ;//__asm__ ("T8CKR") ;//__attribute__((section("sfrs")));
volatile unsigned int        T9CKR ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned T9CKR:4;
} __T9CKRbits_t;*/
volatile __T9CKRbits_t T9CKRbits ;//__asm__ ("T9CKR") ;//__attribute__((section("sfrs")));
volatile unsigned int        IC1R ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned IC1R:4;
} __IC1Rbits_t;*/
volatile __IC1Rbits_t IC1Rbits ;//__asm__ ("IC1R") ;//__attribute__((section("sfrs")));
volatile unsigned int        IC2R ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned IC2R:4;
} __IC2Rbits_t;*/
volatile __IC2Rbits_t IC2Rbits ;//__asm__ ("IC2R") ;//__attribute__((section("sfrs")));
volatile unsigned int        IC3R ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned IC3R:4;
} __IC3Rbits_t;*/
volatile __IC3Rbits_t IC3Rbits ;//__asm__ ("IC3R") ;//__attribute__((section("sfrs")));
volatile unsigned int        IC4R ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned IC4R:4;
} __IC4Rbits_t;*/
volatile __IC4Rbits_t IC4Rbits ;//__asm__ ("IC4R") ;//__attribute__((section("sfrs")));
volatile unsigned int        IC5R ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned IC5R:4;
} __IC5Rbits_t;*/
volatile __IC5Rbits_t IC5Rbits ;//__asm__ ("IC5R") ;//__attribute__((section("sfrs")));
volatile unsigned int        IC6R ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned IC6R:4;
} __IC6Rbits_t;*/
volatile __IC6Rbits_t IC6Rbits ;//__asm__ ("IC6R") ;//__attribute__((section("sfrs")));
volatile unsigned int        IC7R ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned IC7R:4;
} __IC7Rbits_t;*/
volatile __IC7Rbits_t IC7Rbits ;//__asm__ ("IC7R") ;//__attribute__((section("sfrs")));
volatile unsigned int        IC8R ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned IC8R:4;
} __IC8Rbits_t;*/
volatile __IC8Rbits_t IC8Rbits ;//__asm__ ("IC8R") ;//__attribute__((section("sfrs")));
volatile unsigned int        IC9R ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned IC9R:4;
} __IC9Rbits_t;*/
volatile __IC9Rbits_t IC9Rbits ;//__asm__ ("IC9R") ;//__attribute__((section("sfrs")));
volatile unsigned int        OCFAR ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned OCFAR:4;
} __OCFARbits_t;*/
volatile __OCFARbits_t OCFARbits ;//__asm__ ("OCFAR") ;//__attribute__((section("sfrs")));
volatile unsigned int        U1RXR ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned U1RXR:4;
} __U1RXRbits_t;*/
volatile __U1RXRbits_t U1RXRbits ;//__asm__ ("U1RXR") ;//__attribute__((section("sfrs")));
volatile unsigned int        U1CTSR ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned U1CTSR:4;
} __U1CTSRbits_t;*/
volatile __U1CTSRbits_t U1CTSRbits ;//__asm__ ("U1CTSR") ;//__attribute__((section("sfrs")));
volatile unsigned int        U2RXR ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned U2RXR:4;
} __U2RXRbits_t;*/
volatile __U2RXRbits_t U2RXRbits ;//__asm__ ("U2RXR") ;//__attribute__((section("sfrs")));
volatile unsigned int        U2CTSR ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned U2CTSR:4;
} __U2CTSRbits_t;*/
volatile __U2CTSRbits_t U2CTSRbits ;//__asm__ ("U2CTSR") ;//__attribute__((section("sfrs")));
volatile unsigned int        U3RXR ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned U3RXR:4;
} __U3RXRbits_t;*/
volatile __U3RXRbits_t U3RXRbits ;//__asm__ ("U3RXR") ;//__attribute__((section("sfrs")));
volatile unsigned int        U3CTSR ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned U3CTSR:4;
} __U3CTSRbits_t;*/
volatile __U3CTSRbits_t U3CTSRbits ;//__asm__ ("U3CTSR") ;//__attribute__((section("sfrs")));
volatile unsigned int        U4RXR ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned U4RXR:4;
} __U4RXRbits_t;*/
volatile __U4RXRbits_t U4RXRbits ;//__asm__ ("U4RXR") ;//__attribute__((section("sfrs")));
volatile unsigned int        U4CTSR ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned U4CTSR:4;
} __U4CTSRbits_t;*/
volatile __U4CTSRbits_t U4CTSRbits ;//__asm__ ("U4CTSR") ;//__attribute__((section("sfrs")));
volatile unsigned int        U5RXR ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned U5RXR:4;
} __U5RXRbits_t;*/
volatile __U5RXRbits_t U5RXRbits ;//__asm__ ("U5RXR") ;//__attribute__((section("sfrs")));
volatile unsigned int        U5CTSR ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned U5CTSR:4;
} __U5CTSRbits_t;*/
volatile __U5CTSRbits_t U5CTSRbits ;//__asm__ ("U5CTSR") ;//__attribute__((section("sfrs")));
volatile unsigned int        U6RXR ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned U6RXR:4;
} __U6RXRbits_t;*/
volatile __U6RXRbits_t U6RXRbits ;//__asm__ ("U6RXR") ;//__attribute__((section("sfrs")));
volatile unsigned int        U6CTSR ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned U6CTSR:4;
} __U6CTSRbits_t;*/
volatile __U6CTSRbits_t U6CTSRbits ;//__asm__ ("U6CTSR") ;//__attribute__((section("sfrs")));
volatile unsigned int        SDI1R ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned SDI1R:4;
} __SDI1Rbits_t;*/
volatile __SDI1Rbits_t SDI1Rbits ;//__asm__ ("SDI1R") ;//__attribute__((section("sfrs")));
volatile unsigned int        SS1R ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned SS1R:4;
} __SS1Rbits_t;*/
volatile __SS1Rbits_t SS1Rbits ;//__asm__ ("SS1R") ;//__attribute__((section("sfrs")));
volatile unsigned int        SDI2R ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned SDI2R:4;
} __SDI2Rbits_t;*/
volatile __SDI2Rbits_t SDI2Rbits ;//__asm__ ("SDI2R") ;//__attribute__((section("sfrs")));
volatile unsigned int        SS2R ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned SS2R:4;
} __SS2Rbits_t;*/
volatile __SS2Rbits_t SS2Rbits ;//__asm__ ("SS2R") ;//__attribute__((section("sfrs")));
volatile unsigned int        SDI3R ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned SDI3R:4;
} __SDI3Rbits_t;*/
volatile __SDI3Rbits_t SDI3Rbits ;//__asm__ ("SDI3R") ;//__attribute__((section("sfrs")));
volatile unsigned int        SS3R ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned SS3R:4;
} __SS3Rbits_t;*/
volatile __SS3Rbits_t SS3Rbits ;//__asm__ ("SS3R") ;//__attribute__((section("sfrs")));
volatile unsigned int        SDI4R ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned SDI4R:4;
} __SDI4Rbits_t;*/
volatile __SDI4Rbits_t SDI4Rbits ;//__asm__ ("SDI4R") ;//__attribute__((section("sfrs")));
volatile unsigned int        SS4R ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned SS4R:4;
} __SS4Rbits_t;*/
