HomuraVehicle/homuraLib_v2/machine/device/p32mz2048efg100_forVC.c
volatile __SS4Rbits_t SS4Rbits ;//__asm__ ("SS4R") ;//__attribute__((section("sfrs")));
volatile unsigned int        SDI5R ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned SDI5R:4;
} __SDI5Rbits_t;*/
volatile __SDI5Rbits_t SDI5Rbits ;//__asm__ ("SDI5R") ;//__attribute__((section("sfrs")));
volatile unsigned int        SS5R ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned SS5R:4;
} __SS5Rbits_t;*/
volatile __SS5Rbits_t SS5Rbits ;//__asm__ ("SS5R") ;//__attribute__((section("sfrs")));
volatile unsigned int        SDI6R ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned SDI6R:4;
} __SDI6Rbits_t;*/
volatile __SDI6Rbits_t SDI6Rbits ;//__asm__ ("SDI6R") ;//__attribute__((section("sfrs")));
volatile unsigned int        SS6R ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned SS6R:4;
} __SS6Rbits_t;*/
volatile __SS6Rbits_t SS6Rbits ;//__asm__ ("SS6R") ;//__attribute__((section("sfrs")));
volatile unsigned int        C1RXR ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned C1RXR:4;
} __C1RXRbits_t;*/
volatile __C1RXRbits_t C1RXRbits ;//__asm__ ("C1RXR") ;//__attribute__((section("sfrs")));
volatile unsigned int        C2RXR ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned C2RXR:4;
} __C2RXRbits_t;*/
volatile __C2RXRbits_t C2RXRbits ;//__asm__ ("C2RXR") ;//__attribute__((section("sfrs")));
volatile unsigned int        REFCLKI1R ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned REFCLKI1R:4;
} __REFCLKI1Rbits_t;*/
volatile __REFCLKI1Rbits_t REFCLKI1Rbits ;//__asm__ ("REFCLKI1R") ;//__attribute__((section("sfrs")));
volatile unsigned int        REFCLKI3R ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned REFCLKI3R:4;
} __REFCLKI3Rbits_t;*/
volatile __REFCLKI3Rbits_t REFCLKI3Rbits ;//__asm__ ("REFCLKI3R") ;//__attribute__((section("sfrs")));
volatile unsigned int        REFCLKI4R ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned REFCLKI4R:4;
} __REFCLKI4Rbits_t;*/
volatile __REFCLKI4Rbits_t REFCLKI4Rbits ;//__asm__ ("REFCLKI4R") ;//__attribute__((section("sfrs")));
volatile unsigned int        RPA14R ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned RPA14R:4;
} __RPA14Rbits_t;*/
volatile __RPA14Rbits_t RPA14Rbits ;//__asm__ ("RPA14R") ;//__attribute__((section("sfrs")));
volatile unsigned int        RPA15R ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned RPA15R:4;
} __RPA15Rbits_t;*/
volatile __RPA15Rbits_t RPA15Rbits ;//__asm__ ("RPA15R") ;//__attribute__((section("sfrs")));
volatile unsigned int        RPB0R ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned RPB0R:4;
} __RPB0Rbits_t;*/
volatile __RPB0Rbits_t RPB0Rbits ;//__asm__ ("RPB0R") ;//__attribute__((section("sfrs")));
volatile unsigned int        RPB1R ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned RPB1R:4;
} __RPB1Rbits_t;*/
volatile __RPB1Rbits_t RPB1Rbits ;//__asm__ ("RPB1R") ;//__attribute__((section("sfrs")));
volatile unsigned int        RPB2R ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned RPB2R:4;
} __RPB2Rbits_t;*/
volatile __RPB2Rbits_t RPB2Rbits ;//__asm__ ("RPB2R") ;//__attribute__((section("sfrs")));
volatile unsigned int        RPB3R ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned RPB3R:4;
} __RPB3Rbits_t;*/
volatile __RPB3Rbits_t RPB3Rbits ;//__asm__ ("RPB3R") ;//__attribute__((section("sfrs")));
volatile unsigned int        RPB5R ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned RPB5R:4;
} __RPB5Rbits_t;*/
volatile __RPB5Rbits_t RPB5Rbits ;//__asm__ ("RPB5R") ;//__attribute__((section("sfrs")));
volatile unsigned int        RPB6R ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned RPB6R:4;
} __RPB6Rbits_t;*/
volatile __RPB6Rbits_t RPB6Rbits ;//__asm__ ("RPB6R") ;//__attribute__((section("sfrs")));
volatile unsigned int        RPB7R ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned RPB7R:4;
} __RPB7Rbits_t;*/
volatile __RPB7Rbits_t RPB7Rbits ;//__asm__ ("RPB7R") ;//__attribute__((section("sfrs")));
volatile unsigned int        RPB8R ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned RPB8R:4;
} __RPB8Rbits_t;*/
volatile __RPB8Rbits_t RPB8Rbits ;//__asm__ ("RPB8R") ;//__attribute__((section("sfrs")));
volatile unsigned int        RPB9R ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned RPB9R:4;
} __RPB9Rbits_t;*/
volatile __RPB9Rbits_t RPB9Rbits ;//__asm__ ("RPB9R") ;//__attribute__((section("sfrs")));
volatile unsigned int        RPB10R ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned RPB10R:4;
} __RPB10Rbits_t;*/
volatile __RPB10Rbits_t RPB10Rbits ;//__asm__ ("RPB10R") ;//__attribute__((section("sfrs")));
volatile unsigned int        RPB14R ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned RPB14R:4;
} __RPB14Rbits_t;*/
volatile __RPB14Rbits_t RPB14Rbits ;//__asm__ ("RPB14R") ;//__attribute__((section("sfrs")));
volatile unsigned int        RPB15R ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned RPB15R:4;
} __RPB15Rbits_t;*/
volatile __RPB15Rbits_t RPB15Rbits ;//__asm__ ("RPB15R") ;//__attribute__((section("sfrs")));
volatile unsigned int        RPC1R ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned RPC1R:4;
} __RPC1Rbits_t;*/
volatile __RPC1Rbits_t RPC1Rbits ;//__asm__ ("RPC1R") ;//__attribute__((section("sfrs")));
volatile unsigned int        RPC2R ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned RPC2R:4;
} __RPC2Rbits_t;*/
volatile __RPC2Rbits_t RPC2Rbits ;//__asm__ ("RPC2R") ;//__attribute__((section("sfrs")));
volatile unsigned int        RPC3R ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned RPC3R:4;
} __RPC3Rbits_t;*/
volatile __RPC3Rbits_t RPC3Rbits ;//__asm__ ("RPC3R") ;//__attribute__((section("sfrs")));
volatile unsigned int        RPC4R ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned RPC4R:4;
} __RPC4Rbits_t;*/
volatile __RPC4Rbits_t RPC4Rbits ;//__asm__ ("RPC4R") ;//__attribute__((section("sfrs")));
volatile unsigned int        RPC13R ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned RPC13R:4;
} __RPC13Rbits_t;*/
volatile __RPC13Rbits_t RPC13Rbits ;//__asm__ ("RPC13R") ;//__attribute__((section("sfrs")));
volatile unsigned int        RPC14R ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned RPC14R:4;
} __RPC14Rbits_t;*/
volatile __RPC14Rbits_t RPC14Rbits ;//__asm__ ("RPC14R") ;//__attribute__((section("sfrs")));
volatile unsigned int        RPD0R ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned RPD0R:4;
} __RPD0Rbits_t;*/
