HomuraVehicle/homuraLib_v2/machine/device/p32mz2048efg100_forVC.c
volatile __RPD0Rbits_t RPD0Rbits ;//__asm__ ("RPD0R") ;//__attribute__((section("sfrs")));
volatile unsigned int        RPD1R ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned RPD1R:4;
} __RPD1Rbits_t;*/
volatile __RPD1Rbits_t RPD1Rbits ;//__asm__ ("RPD1R") ;//__attribute__((section("sfrs")));
volatile unsigned int        RPD2R ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned RPD2R:4;
} __RPD2Rbits_t;*/
volatile __RPD2Rbits_t RPD2Rbits ;//__asm__ ("RPD2R") ;//__attribute__((section("sfrs")));
volatile unsigned int        RPD3R ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned RPD3R:4;
} __RPD3Rbits_t;*/
volatile __RPD3Rbits_t RPD3Rbits ;//__asm__ ("RPD3R") ;//__attribute__((section("sfrs")));
volatile unsigned int        RPD4R ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned RPD4R:4;
} __RPD4Rbits_t;*/
volatile __RPD4Rbits_t RPD4Rbits ;//__asm__ ("RPD4R") ;//__attribute__((section("sfrs")));
volatile unsigned int        RPD5R ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned RPD5R:4;
} __RPD5Rbits_t;*/
volatile __RPD5Rbits_t RPD5Rbits ;//__asm__ ("RPD5R") ;//__attribute__((section("sfrs")));
volatile unsigned int        RPD9R ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned RPD9R:4;
} __RPD9Rbits_t;*/
volatile __RPD9Rbits_t RPD9Rbits ;//__asm__ ("RPD9R") ;//__attribute__((section("sfrs")));
volatile unsigned int        RPD10R ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned RPD10R:4;
} __RPD10Rbits_t;*/
volatile __RPD10Rbits_t RPD10Rbits ;//__asm__ ("RPD10R") ;//__attribute__((section("sfrs")));
volatile unsigned int        RPD11R ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned RPD11R:4;
} __RPD11Rbits_t;*/
volatile __RPD11Rbits_t RPD11Rbits ;//__asm__ ("RPD11R") ;//__attribute__((section("sfrs")));
volatile unsigned int        RPD12R ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned RPD12R:4;
} __RPD12Rbits_t;*/
volatile __RPD12Rbits_t RPD12Rbits ;//__asm__ ("RPD12R") ;//__attribute__((section("sfrs")));
volatile unsigned int        RPD14R ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned RPD14R:4;
} __RPD14Rbits_t;*/
volatile __RPD14Rbits_t RPD14Rbits ;//__asm__ ("RPD14R") ;//__attribute__((section("sfrs")));
volatile unsigned int        RPD15R ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned RPD15R:4;
} __RPD15Rbits_t;*/
volatile __RPD15Rbits_t RPD15Rbits ;//__asm__ ("RPD15R") ;//__attribute__((section("sfrs")));
volatile unsigned int        RPE3R ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned RPE3R:4;
} __RPE3Rbits_t;*/
volatile __RPE3Rbits_t RPE3Rbits ;//__asm__ ("RPE3R") ;//__attribute__((section("sfrs")));
volatile unsigned int        RPE5R ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned RPE5R:4;
} __RPE5Rbits_t;*/
volatile __RPE5Rbits_t RPE5Rbits ;//__asm__ ("RPE5R") ;//__attribute__((section("sfrs")));
volatile unsigned int        RPE8R ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned RPE8R:4;
} __RPE8Rbits_t;*/
volatile __RPE8Rbits_t RPE8Rbits ;//__asm__ ("RPE8R") ;//__attribute__((section("sfrs")));
volatile unsigned int        RPE9R ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned RPE9R:4;
} __RPE9Rbits_t;*/
volatile __RPE9Rbits_t RPE9Rbits ;//__asm__ ("RPE9R") ;//__attribute__((section("sfrs")));
volatile unsigned int        RPF0R ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned RPF0R:4;
} __RPF0Rbits_t;*/
volatile __RPF0Rbits_t RPF0Rbits ;//__asm__ ("RPF0R") ;//__attribute__((section("sfrs")));
volatile unsigned int        RPF1R ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned RPF1R:4;
} __RPF1Rbits_t;*/
volatile __RPF1Rbits_t RPF1Rbits ;//__asm__ ("RPF1R") ;//__attribute__((section("sfrs")));
volatile unsigned int        RPF2R ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned RPF2R:4;
} __RPF2Rbits_t;*/
volatile __RPF2Rbits_t RPF2Rbits ;//__asm__ ("RPF2R") ;//__attribute__((section("sfrs")));
volatile unsigned int        RPF3R ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned RPF3R:4;
} __RPF3Rbits_t;*/
volatile __RPF3Rbits_t RPF3Rbits ;//__asm__ ("RPF3R") ;//__attribute__((section("sfrs")));
volatile unsigned int        RPF4R ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned RPF4R:4;
} __RPF4Rbits_t;*/
volatile __RPF4Rbits_t RPF4Rbits ;//__asm__ ("RPF4R") ;//__attribute__((section("sfrs")));
volatile unsigned int        RPF5R ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned RPF5R:4;
} __RPF5Rbits_t;*/
volatile __RPF5Rbits_t RPF5Rbits ;//__asm__ ("RPF5R") ;//__attribute__((section("sfrs")));
volatile unsigned int        RPF8R ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned RPF8R:4;
} __RPF8Rbits_t;*/
volatile __RPF8Rbits_t RPF8Rbits ;//__asm__ ("RPF8R") ;//__attribute__((section("sfrs")));
volatile unsigned int        RPF12R ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned RPF12R:4;
} __RPF12Rbits_t;*/
volatile __RPF12Rbits_t RPF12Rbits ;//__asm__ ("RPF12R") ;//__attribute__((section("sfrs")));
volatile unsigned int        RPF13R ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned RPF13R:4;
} __RPF13Rbits_t;*/
volatile __RPF13Rbits_t RPF13Rbits ;//__asm__ ("RPF13R") ;//__attribute__((section("sfrs")));
volatile unsigned int        RPG0R ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned RPG0R:4;
} __RPG0Rbits_t;*/
volatile __RPG0Rbits_t RPG0Rbits ;//__asm__ ("RPG0R") ;//__attribute__((section("sfrs")));
volatile unsigned int        RPG1R ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned RPG1R:4;
} __RPG1Rbits_t;*/
volatile __RPG1Rbits_t RPG1Rbits ;//__asm__ ("RPG1R") ;//__attribute__((section("sfrs")));
volatile unsigned int        RPG6R ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned RPG6R:4;
} __RPG6Rbits_t;*/
