HomuraVehicle/homuraLib_v2/machine/device/p32mz2048efg100_forVC.c
volatile __RPG6Rbits_t RPG6Rbits ;//__asm__ ("RPG6R") ;//__attribute__((section("sfrs")));
volatile unsigned int        RPG7R ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned RPG7R:4;
} __RPG7Rbits_t;*/
volatile __RPG7Rbits_t RPG7Rbits ;//__asm__ ("RPG7R") ;//__attribute__((section("sfrs")));
volatile unsigned int        RPG8R ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned RPG8R:4;
} __RPG8Rbits_t;*/
volatile __RPG8Rbits_t RPG8Rbits ;//__asm__ ("RPG8R") ;//__attribute__((section("sfrs")));
volatile unsigned int        RPG9R ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned RPG9R:4;
} __RPG9Rbits_t;*/
volatile __RPG9Rbits_t RPG9Rbits ;//__asm__ ("RPG9R") ;//__attribute__((section("sfrs")));
volatile unsigned int        INTCON ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned INT0EP:1;
  unsigned INT1EP:1;
  unsigned INT2EP:1;
  unsigned INT3EP:1;
  unsigned INT4EP:1;
  unsigned :3;
  unsigned TPC:3;
  unsigned :1;
  unsigned MVEC:1;
  unsigned :11;
  unsigned NMIKEY:8;
} __INTCONbits_t;*/
volatile __INTCONbits_t INTCONbits ;//__asm__ ("INTCON") ;//__attribute__((section("sfrs")));
volatile unsigned int        INTCONCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        INTCONSET ;//__attribute__((section("sfrs")));
volatile unsigned int        INTCONINV ;//__attribute__((section("sfrs")));
volatile unsigned int        PRISS ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned SS0:1;
  unsigned :3;
  unsigned PRI1SS:4;
  unsigned PRI2SS:4;
  unsigned PRI3SS:4;
  unsigned PRI4SS:4;
  unsigned PRI5SS:4;
  unsigned PRI6SS:4;
  unsigned PRI7SS:4;
} __PRISSbits_t;*/
volatile __PRISSbits_t PRISSbits ;//__asm__ ("PRISS") ;//__attribute__((section("sfrs")));
volatile unsigned int        PRISSCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        PRISSSET ;//__attribute__((section("sfrs")));
volatile unsigned int        PRISSINV ;//__attribute__((section("sfrs")));
volatile unsigned int        INTSTAT ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned SIRQ:8;
  unsigned SRIPL:3;
} __INTSTATbits_t;*/
volatile __INTSTATbits_t INTSTATbits ;//__asm__ ("INTSTAT") ;//__attribute__((section("sfrs")));
volatile unsigned int        INTSTATCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        INTSTATSET ;//__attribute__((section("sfrs")));
volatile unsigned int        INTSTATINV ;//__attribute__((section("sfrs")));
volatile unsigned int        IPTMR ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned IPTMR:32;
} __IPTMRbits_t;*/
volatile __IPTMRbits_t IPTMRbits ;//__asm__ ("IPTMR") ;//__attribute__((section("sfrs")));
volatile unsigned int        IPTMRCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        IPTMRSET ;//__attribute__((section("sfrs")));
volatile unsigned int        IPTMRINV ;//__attribute__((section("sfrs")));
volatile unsigned int        IFS0 ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned CTIF:1;
    unsigned CS0IF:1;
    unsigned CS1IF:1;
    unsigned INT0IF:1;
    unsigned T1IF:1;
    unsigned IC1EIF:1;
    unsigned IC1IF:1;
    unsigned OC1IF:1;
    unsigned INT1IF:1;
    unsigned T2IF:1;
    unsigned IC2EIF:1;
    unsigned IC2IF:1;
    unsigned OC2IF:1;
    unsigned INT2IF:1;
    unsigned T3IF:1;
    unsigned IC3EIF:1;
    unsigned IC3IF:1;
    unsigned OC3IF:1;
    unsigned INT3IF:1;
    unsigned T4IF:1;
    unsigned IC4EIF:1;
    unsigned IC4IF:1;
    unsigned OC4IF:1;
    unsigned INT4IF:1;
    unsigned T5IF:1;
    unsigned IC5EIF:1;
    unsigned IC5IF:1;
    unsigned OC5IF:1;
    unsigned T6IF:1;
    unsigned IC6EIF:1;
    unsigned IC6IF:1;
    unsigned OC6IF:1;
  };
  struct {
    unsigned w:32;
  };
} __IFS0bits_t;*/
volatile __IFS0bits_t IFS0bits ;//__asm__ ("IFS0") ;//__attribute__((section("sfrs")));
volatile unsigned int        IFS0CLR ;//__attribute__((section("sfrs")));
volatile unsigned int        IFS0SET ;//__attribute__((section("sfrs")));
volatile unsigned int        IFS0INV ;//__attribute__((section("sfrs")));
volatile unsigned int        IFS1 ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned T7IF:1;
    unsigned IC7EIF:1;
    unsigned IC7IF:1;
    unsigned OC7IF:1;
    unsigned T8IF:1;
    unsigned IC8EIF:1;
    unsigned IC8IF:1;
    unsigned OC8IF:1;
    unsigned T9IF:1;
    unsigned IC9EIF:1;
    unsigned IC9IF:1;
    unsigned OC9IF:1;
    unsigned ADCIF:1;
    unsigned :1;
    unsigned ADCDC1IF:1;
    unsigned ADCDC2IF:1;
    unsigned ADCDC3IF:1;
    unsigned ADCDC4IF:1;
    unsigned ADCDC5IF:1;
    unsigned ADCDC6IF:1;
    unsigned ADCDF1IF:1;
    unsigned ADCDF2IF:1;
    unsigned ADCDF3IF:1;
    unsigned ADCDF4IF:1;
    unsigned ADCDF5IF:1;
    unsigned ADCDF6IF:1;
    unsigned ADCFLTIF:1;
    unsigned ADCD0IF:1;
    unsigned ADCD1IF:1;
    unsigned ADCD2IF:1;
    unsigned ADCD3IF:1;
    unsigned ADCD4IF:1;
  };
  struct {
    unsigned w:32;
  };
} __IFS1bits_t;*/
volatile __IFS1bits_t IFS1bits ;//__asm__ ("IFS1") ;//__attribute__((section("sfrs")));
volatile unsigned int        IFS1CLR ;//__attribute__((section("sfrs")));
volatile unsigned int        IFS1SET ;//__attribute__((section("sfrs")));
volatile unsigned int        IFS1INV ;//__attribute__((section("sfrs")));
volatile unsigned int        IFS2 ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned ADCD5IF:1;
    unsigned ADCD6IF:1;
    unsigned ADCD7IF:1;
    unsigned ADCD8IF:1;
    unsigned ADCD9IF:1;
    unsigned ADCD10IF:1;
    unsigned ADCD11IF:1;
    unsigned ADCD12IF:1;
    unsigned ADCD13IF:1;
    unsigned ADCD14IF:1;
    unsigned ADCD15IF:1;
    unsigned ADCD16IF:1;
    unsigned ADCD17IF:1;
    unsigned ADCD18IF:1;
    unsigned ADCD19IF:1;
    unsigned ADCD20IF:1;
    unsigned ADCD21IF:1;
    unsigned ADCD22IF:1;
    unsigned ADCD23IF:1;
    unsigned ADCD24IF:1;
    unsigned ADCD25IF:1;
    unsigned ADCD26IF:1;
    unsigned ADCD27IF:1;
    unsigned ADCD28IF:1;
    unsigned ADCD29IF:1;
    unsigned ADCD30IF:1;
    unsigned ADCD31IF:1;
    unsigned ADCD32IF:1;
    unsigned ADCD33IF:1;
    unsigned ADCD34IF:1;
  };
  struct {
    unsigned w:32;
  };
} __IFS2bits_t;*/
volatile __IFS2bits_t IFS2bits ;//__asm__ ("IFS2") ;//__attribute__((section("sfrs")));
volatile unsigned int        IFS2CLR ;//__attribute__((section("sfrs")));
volatile unsigned int        IFS2SET ;//__attribute__((section("sfrs")));
volatile unsigned int        IFS2INV ;//__attribute__((section("sfrs")));
volatile unsigned int        IFS3 ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned :6;
    unsigned ADCD43IF:1;
    unsigned ADCD44IF:1;
    unsigned CPCIF:1;
    unsigned CFDCIF:1;
    unsigned SBIF:1;
    unsigned :2;
    unsigned SPI1EIF:1;
    unsigned SPI1RXIF:1;
    unsigned SPI1TXIF:1;
    unsigned U1EIF:1;
    unsigned U1RXIF:1;
    unsigned U1TXIF:1;
    unsigned I2C1BIF:1;
    unsigned I2C1SIF:1;
    unsigned I2C1MIF:1;
    unsigned CNAIF:1;
    unsigned CNBIF:1;
    unsigned CNCIF:1;
    unsigned CNDIF:1;
    unsigned CNEIF:1;
    unsigned CNFIF:1;
    unsigned CNGIF:1;
  };
  struct {
    unsigned w:32;
  };
} __IFS3bits_t;*/
volatile __IFS3bits_t IFS3bits ;//__asm__ ("IFS3") ;//__attribute__((section("sfrs")));
volatile unsigned int        IFS3CLR ;//__attribute__((section("sfrs")));
volatile unsigned int        IFS3SET ;//__attribute__((section("sfrs")));
volatile unsigned int        IFS3INV ;//__attribute__((section("sfrs")));
volatile unsigned int        IFS4 ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned PMPIF:1;
    unsigned PMPEIF:1;
    unsigned CMP1IF:1;
    unsigned CMP2IF:1;
    unsigned USBIF:1;
    unsigned USBDMAIF:1;
    unsigned DMA0IF:1;
    unsigned DMA1IF:1;
    unsigned DMA2IF:1;
    unsigned DMA3IF:1;
    unsigned DMA4IF:1;
    unsigned DMA5IF:1;
    unsigned DMA6IF:1;
    unsigned DMA7IF:1;
    unsigned SPI2EIF:1;
    unsigned SPI2RXIF:1;
    unsigned SPI2TXIF:1;
    unsigned U2EIF:1;
    unsigned U2RXIF:1;
    unsigned U2TXIF:1;
    unsigned I2C2BIF:1;
    unsigned I2C2SIF:1;
    unsigned I2C2MIF:1;
    unsigned :2;
    unsigned ETHIF:1;
    unsigned SPI3EIF:1;
    unsigned SPI3RXIF:1;
    unsigned SPI3TXIF:1;
    unsigned U3EIF:1;
    unsigned U3RXIF:1;
    unsigned U3TXIF:1;
  };
  struct {
    unsigned w:32;
  };
} __IFS4bits_t;*/
volatile __IFS4bits_t IFS4bits ;//__asm__ ("IFS4") ;//__attribute__((section("sfrs")));
volatile unsigned int        IFS4CLR ;//__attribute__((section("sfrs")));
volatile unsigned int        IFS4SET ;//__attribute__((section("sfrs")));
volatile unsigned int        IFS4INV ;//__attribute__((section("sfrs")));
volatile unsigned int        IFS5 ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned I2C3BIF:1;
    unsigned I2C3SIF:1;
    unsigned I2C3MIF:1;
    unsigned SPI4EIF:1;
    unsigned SPI4RXIF:1;
    unsigned SPI4TXIF:1;
    unsigned RTCCIF:1;
    unsigned FCEIF:1;
    unsigned PREIF:1;
    unsigned SQI1IF:1;
    unsigned U4EIF:1;
    unsigned U4RXIF:1;
    unsigned U4TXIF:1;
    unsigned I2C4BIF:1;
    unsigned I2C4SIF:1;
    unsigned I2C4MIF:1;
    unsigned SPI5EIF:1;
    unsigned SPI5RXIF:1;
    unsigned SPI5TXIF:1;
    unsigned U5EIF:1;
    unsigned U5RXIF:1;
    unsigned U5TXIF:1;
    unsigned I2C5BIF:1;
    unsigned I2C5SIF:1;
    unsigned I2C5MIF:1;
    unsigned SPI6IF:1;
    unsigned SPI6RXIF:1;
    unsigned SPI6TX:1;
    unsigned U6EIF:1;
    unsigned U6RXIF:1;
    unsigned U6TXIF:1;
  };
  struct {
    unsigned w:32;
  };
} __IFS5bits_t;*/
volatile __IFS5bits_t IFS5bits ;//__asm__ ("IFS5") ;//__attribute__((section("sfrs")));
volatile unsigned int        IFS5CLR ;//__attribute__((section("sfrs")));
volatile unsigned int        IFS5SET ;//__attribute__((section("sfrs")));
volatile unsigned int        IFS5INV ;//__attribute__((section("sfrs")));
volatile unsigned int        IFS6 ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned ADCEOSIF:1;
    unsigned ADCARDYIF:1;
    unsigned ADCURDYIF:1;
    unsigned :1;
    unsigned ADCGRPIF:1;
    unsigned :1;
    unsigned ADC0EIF:1;
    unsigned ADC1EIF:1;
    unsigned ADC2EIF:1;
    unsigned ADC3EIF:1;
    unsigned ADC4EIF:1;
    unsigned :2;
    unsigned ADC7EIF:1;
    unsigned ADC0WIF:1;
    unsigned ADC1WIF:1;
    unsigned ADC2WIF:1;
    unsigned ADC3WIF:1;
    unsigned ADC4WIF:1;
    unsigned :2;
    unsigned ADC7WIF:1;
  };
  struct {
    unsigned w:32;
  };
} __IFS6bits_t;*/
volatile __IFS6bits_t IFS6bits ;//__asm__ ("IFS6") ;//__attribute__((section("sfrs")));
volatile unsigned int        IFS6CLR ;//__attribute__((section("sfrs")));
volatile unsigned int        IFS6SET ;//__attribute__((section("sfrs")));
volatile unsigned int        IFS6INV ;//__attribute__((section("sfrs")));
volatile unsigned int        IEC0 ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned CTIE:1;
    unsigned CS0IE:1;
    unsigned CS1IE:1;
    unsigned INT0IE:1;
    unsigned T1IE:1;
    unsigned IC1EIE:1;
    unsigned IC1IE:1;
    unsigned OC1IE:1;
    unsigned INT1IE:1;
    unsigned T2IE:1;
    unsigned IC2EIE:1;
    unsigned IC2IE:1;
    unsigned OC2IE:1;
    unsigned INT2IE:1;
    unsigned T3IE:1;
    unsigned IC3EIE:1;
    unsigned IC3IE:1;
    unsigned OC3IE:1;
    unsigned INT3IE:1;
    unsigned T4IE:1;
    unsigned IC4EIE:1;
    unsigned IC4IE:1;
    unsigned OC4IE:1;
    unsigned INT4IE:1;
    unsigned T5IE:1;
    unsigned IC5EIE:1;
    unsigned IC5IE:1;
    unsigned OC5IE:1;
    unsigned T6IE:1;
    unsigned IC6EIE:1;
    unsigned IC6IE:1;
    unsigned OC6IE:1;
  };
  struct {
    unsigned w:32;
  };
} __IEC0bits_t;*/
