HomuraVehicle/homuraLib_v2/machine/device/p32mz2048efg100_forVC.c
volatile __IEC0bits_t IEC0bits ;//__asm__ ("IEC0") ;//__attribute__((section("sfrs")));
volatile unsigned int        IEC0CLR ;//__attribute__((section("sfrs")));
volatile unsigned int        IEC0SET ;//__attribute__((section("sfrs")));
volatile unsigned int        IEC0INV ;//__attribute__((section("sfrs")));
volatile unsigned int        IEC1 ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned T7IE:1;
    unsigned IC7EIE:1;
    unsigned IC7IE:1;
    unsigned OC7IE:1;
    unsigned T8IE:1;
    unsigned IC8EIE:1;
    unsigned IC8IE:1;
    unsigned OC8IE:1;
    unsigned T9IE:1;
    unsigned IC9EIE:1;
    unsigned IC9IE:1;
    unsigned OC9IE:1;
    unsigned ADCIE:1;
    unsigned :1;
    unsigned ADCDC1IE:1;
    unsigned ADCDC2IE:1;
    unsigned ADCDC3IE:1;
    unsigned ADCDC4IE:1;
    unsigned ADCDC5IE:1;
    unsigned ADCDC6IE:1;
    unsigned ADCDF1IE:1;
    unsigned ADCDF2IE:1;
    unsigned ADCDF3IE:1;
    unsigned ADCDF4IE:1;
    unsigned ADCDF5IE:1;
    unsigned ADCDF6IE:1;
    unsigned ADCFLTIE:1;
    unsigned ADCD0IE:1;
    unsigned ADCD1IE:1;
    unsigned ADCD2IE:1;
    unsigned ADCD3IE:1;
    unsigned ADCD4IE:1;
  };
  struct {
    unsigned w:32;
  };
} __IEC1bits_t;*/
volatile __IEC1bits_t IEC1bits ;//__asm__ ("IEC1") ;//__attribute__((section("sfrs")));
volatile unsigned int        IEC1CLR ;//__attribute__((section("sfrs")));
volatile unsigned int        IEC1SET ;//__attribute__((section("sfrs")));
volatile unsigned int        IEC1INV ;//__attribute__((section("sfrs")));
volatile unsigned int        IEC2 ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned ADCD5IE:1;
    unsigned ADCD6IE:1;
    unsigned ADCD7IE:1;
    unsigned ADCD8IE:1;
    unsigned ADCD9IE:1;
    unsigned ADCD10IE:1;
    unsigned ADCD11IE:1;
    unsigned ADCD12IE:1;
    unsigned ADCD13IE:1;
    unsigned ADCD14IE:1;
    unsigned ADCD15IE:1;
    unsigned ADCD16IE:1;
    unsigned ADCD17IE:1;
    unsigned ADCD18IE:1;
    unsigned ADCD19IE:1;
    unsigned ADCD20IE:1;
    unsigned ADCD21IE:1;
    unsigned ADCD22IE:1;
    unsigned ADCD23IE:1;
    unsigned ADCD24IE:1;
    unsigned ADCD25IE:1;
    unsigned ADCD26IE:1;
    unsigned ADCD27IE:1;
    unsigned ADCD28IE:1;
    unsigned ADCD29IE:1;
    unsigned ADCD30IE:1;
    unsigned ADCD31IE:1;
    unsigned ADCD32IE:1;
    unsigned ADCD33IE:1;
    unsigned ADCD34IE:1;
  };
  struct {
    unsigned w:32;
  };
} __IEC2bits_t;*/
volatile __IEC2bits_t IEC2bits ;//__asm__ ("IEC2") ;//__attribute__((section("sfrs")));
volatile unsigned int        IEC2CLR ;//__attribute__((section("sfrs")));
volatile unsigned int        IEC2SET ;//__attribute__((section("sfrs")));
volatile unsigned int        IEC2INV ;//__attribute__((section("sfrs")));
volatile unsigned int        IEC3 ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned :6;
    unsigned ADCD43IE:1;
    unsigned ADCD44IE:1;
    unsigned CPCIE:1;
    unsigned CFDCIE:1;
    unsigned SBIE:1;
    unsigned :2;
    unsigned SPI1EIE:1;
    unsigned SPI1RXIE:1;
    unsigned SPI1TXIE:1;
    unsigned U1EIE:1;
    unsigned U1RXIE:1;
    unsigned U1TXIE:1;
    unsigned I2C1BIE:1;
    unsigned I2C1SIE:1;
    unsigned I2C1MIE:1;
    unsigned CNAIE:1;
    unsigned CNBIE:1;
    unsigned CNCIE:1;
    unsigned CNDIE:1;
    unsigned CNEIE:1;
    unsigned CNFIE:1;
    unsigned CNGIE:1;
  };
  struct {
    unsigned w:32;
  };
} __IEC3bits_t;*/
volatile __IEC3bits_t IEC3bits ;//__asm__ ("IEC3") ;//__attribute__((section("sfrs")));
volatile unsigned int        IEC3CLR ;//__attribute__((section("sfrs")));
volatile unsigned int        IEC3SET ;//__attribute__((section("sfrs")));
volatile unsigned int        IEC3INV ;//__attribute__((section("sfrs")));
volatile unsigned int        IEC4 ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned PMPIE:1;
    unsigned PMPEIE:1;
    unsigned CMP1IE:1;
    unsigned CMP2IE:1;
    unsigned USBIE:1;
    unsigned USBDMAIE:1;
    unsigned DMA0IE:1;
    unsigned DMA1IE:1;
    unsigned DMA2IE:1;
    unsigned DMA3IE:1;
    unsigned DMA4IE:1;
    unsigned DMA5IE:1;
    unsigned DMA6IE:1;
    unsigned DMA7IE:1;
    unsigned SPI2EIE:1;
    unsigned SPI2RXIE:1;
    unsigned SPI2TXIE:1;
    unsigned U2EIE:1;
    unsigned U2RXIE:1;
    unsigned U2TXIE:1;
    unsigned I2C2BIE:1;
    unsigned I2C2SIE:1;
    unsigned I2C2MIE:1;
    unsigned :2;
    unsigned ETHIE:1;
    unsigned SPI3EIE:1;
    unsigned SPI3RXIE:1;
    unsigned SPI3TXIE:1;
    unsigned U3EIE:1;
    unsigned U3RXIE:1;
    unsigned U3TXIE:1;
  };
  struct {
    unsigned w:32;
  };
} __IEC4bits_t;*/
volatile __IEC4bits_t IEC4bits ;//__asm__ ("IEC4") ;//__attribute__((section("sfrs")));
volatile unsigned int        IEC4CLR ;//__attribute__((section("sfrs")));
volatile unsigned int        IEC4SET ;//__attribute__((section("sfrs")));
volatile unsigned int        IEC4INV ;//__attribute__((section("sfrs")));
volatile unsigned int        IEC5 ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned I2C3BIE:1;
    unsigned I2C3SIE:1;
    unsigned I2C3MIE:1;
    unsigned SPI4EIE:1;
    unsigned SPI4RXIE:1;
    unsigned SPI4TXIE:1;
    unsigned RTCCIE:1;
    unsigned FCEIE:1;
    unsigned PREIE:1;
    unsigned SQI1IE:1;
    unsigned U4EIE:1;
    unsigned U4RXIE:1;
    unsigned U4TXIE:1;
    unsigned I2C4BIE:1;
    unsigned I2C4SIE:1;
    unsigned I2C4MIE:1;
    unsigned SPI5EIE:1;
    unsigned SPI5RXIE:1;
    unsigned SPI5TXIE:1;
    unsigned U5EIE:1;
    unsigned U5RXIE:1;
    unsigned U5TXIE:1;
    unsigned I2C5BIE:1;
    unsigned I2C5SIE:1;
    unsigned I2C5MIE:1;
    unsigned SPI6IE:1;
    unsigned SPI6RXIE:1;
    unsigned SPI6TXIE:1;
    unsigned U6EIE:1;
    unsigned U6RXIE:1;
    unsigned U6TXIE:1;
  };
  struct {
    unsigned w:32;
  };
} __IEC5bits_t;*/
volatile __IEC5bits_t IEC5bits ;//__asm__ ("IEC5") ;//__attribute__((section("sfrs")));
volatile unsigned int        IEC5CLR ;//__attribute__((section("sfrs")));
volatile unsigned int        IEC5SET ;//__attribute__((section("sfrs")));
volatile unsigned int        IEC5INV ;//__attribute__((section("sfrs")));
volatile unsigned int        IEC6 ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned ADCEOSIE:1;
    unsigned ADCARDYIE:1;
    unsigned ADCURDYIE:1;
    unsigned :1;
    unsigned ADCGRPIE:1;
    unsigned :1;
    unsigned ADC0EIE:1;
    unsigned ADC1EIE:1;
    unsigned ADC2EIE:1;
    unsigned ADC3EIE:1;
    unsigned ADC4EIE:1;
    unsigned :2;
    unsigned ADC7EIE:1;
    unsigned ADC0WIE:1;
    unsigned ADC1WIE:1;
    unsigned ADC2WIE:1;
    unsigned ADC3WIE:1;
    unsigned ADC4WIE:1;
    unsigned :2;
    unsigned ADC7WIE:1;
  };
  struct {
    unsigned w:32;
  };
} __IEC6bits_t;*/
volatile __IEC6bits_t IEC6bits ;//__asm__ ("IEC6") ;//__attribute__((section("sfrs")));
volatile unsigned int        IEC6CLR ;//__attribute__((section("sfrs")));
volatile unsigned int        IEC6SET ;//__attribute__((section("sfrs")));
volatile unsigned int        IEC6INV ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC0 ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned CTIS:2;
    unsigned CTIP:3;
    unsigned :3;
    unsigned CS0IS:2;
    unsigned CS0IP:3;
    unsigned :3;
    unsigned CS1IS:2;
    unsigned CS1IP:3;
    unsigned :3;
    unsigned INT0IS:2;
    unsigned INT0IP:3;
  };
  struct {
    unsigned w:32;
  };
} __IPC0bits_t;*/
volatile __IPC0bits_t IPC0bits ;//__asm__ ("IPC0") ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC0CLR ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC0SET ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC0INV ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC1 ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned T1IS:2;
    unsigned T1IP:3;
    unsigned :3;
    unsigned IC1EIS:2;
    unsigned IC1EIP:3;
    unsigned :3;
    unsigned IC1IS:2;
    unsigned IC1IP:3;
    unsigned :3;
    unsigned OC1IS:2;
    unsigned OC1IP:3;
  };
  struct {
    unsigned w:32;
  };
} __IPC1bits_t;*/
volatile __IPC1bits_t IPC1bits ;//__asm__ ("IPC1") ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC1CLR ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC1SET ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC1INV ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC2 ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned INT1IS:2;
    unsigned INT1IP:3;
    unsigned :3;
    unsigned T2IS:2;
    unsigned T2IP:3;
    unsigned :3;
    unsigned IC2EIS:2;
    unsigned IC2EIP:3;
    unsigned :3;
    unsigned IC2IS:2;
    unsigned IC2IP:3;
  };
  struct {
    unsigned w:32;
  };
} __IPC2bits_t;*/
volatile __IPC2bits_t IPC2bits ;//__asm__ ("IPC2") ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC2CLR ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC2SET ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC2INV ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC3 ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned OC2IS:2;
    unsigned OC2IP:3;
    unsigned :3;
    unsigned INT2IS:2;
    unsigned INT2IP:3;
    unsigned :3;
    unsigned T3IS:2;
    unsigned T3IP:3;
    unsigned :3;
    unsigned IC3EIS:2;
    unsigned IC3EIP:3;
  };
  struct {
    unsigned w:32;
  };
} __IPC3bits_t;*/
