HomuraVehicle/homuraLib_v2/machine/device/p32mz2048efg100_forVC.c
volatile __IPC3bits_t IPC3bits ;//__asm__ ("IPC3") ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC3CLR ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC3SET ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC3INV ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC4 ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned IC3IS:2;
    unsigned IC3IP:3;
    unsigned :3;
    unsigned OC3IS:2;
    unsigned OC3IP:3;
    unsigned :3;
    unsigned INT3IS:2;
    unsigned INT3IP:3;
    unsigned :3;
    unsigned T4IS:2;
    unsigned T4IP:3;
  };
  struct {
    unsigned w:32;
  };
} __IPC4bits_t;*/
volatile __IPC4bits_t IPC4bits ;//__asm__ ("IPC4") ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC4CLR ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC4SET ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC4INV ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC5 ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned IC4EIS:2;
    unsigned IC4EIP:3;
    unsigned :3;
    unsigned IC4IS:2;
    unsigned IC4IP:3;
    unsigned :3;
    unsigned OC4IS:2;
    unsigned OC4IP:3;
    unsigned :3;
    unsigned INT4IS:2;
    unsigned INT4IP:3;
  };
  struct {
    unsigned w:32;
  };
} __IPC5bits_t;*/
volatile __IPC5bits_t IPC5bits ;//__asm__ ("IPC5") ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC5CLR ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC5SET ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC5INV ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC6 ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned T5IS:2;
    unsigned T5IP:3;
    unsigned :3;
    unsigned IC5EIS:2;
    unsigned IC5EIP:3;
    unsigned :3;
    unsigned IC5IS:2;
    unsigned IC5IP:3;
    unsigned :3;
    unsigned OC5IS:2;
    unsigned OC5IP:3;
  };
  struct {
    unsigned w:32;
  };
} __IPC6bits_t;*/
volatile __IPC6bits_t IPC6bits ;//__asm__ ("IPC6") ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC6CLR ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC6SET ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC6INV ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC7 ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned T6IS:2;
    unsigned T6IP:3;
    unsigned :3;
    unsigned IC6EIS:2;
    unsigned IC6EIP:3;
    unsigned :3;
    unsigned IC6IS:2;
    unsigned IC6IP:3;
    unsigned :3;
    unsigned OC6IS:2;
    unsigned OC6IP:3;
  };
  struct {
    unsigned w:32;
  };
} __IPC7bits_t;*/
volatile __IPC7bits_t IPC7bits ;//__asm__ ("IPC7") ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC7CLR ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC7SET ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC7INV ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC8 ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned T7IS:2;
    unsigned T7IP:3;
    unsigned :3;
    unsigned IC7EIS:2;
    unsigned IC7EIP:3;
    unsigned :3;
    unsigned IC7IS:2;
    unsigned IC7IP:3;
    unsigned :3;
    unsigned OC7IS:2;
    unsigned OC7IP:3;
  };
  struct {
    unsigned w:32;
  };
} __IPC8bits_t;*/
volatile __IPC8bits_t IPC8bits ;//__asm__ ("IPC8") ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC8CLR ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC8SET ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC8INV ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC9 ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned T8IS:2;
    unsigned T8IP:3;
    unsigned :3;
    unsigned IC8EIS:2;
    unsigned IC8EIP:3;
    unsigned :3;
    unsigned IC8IS:2;
    unsigned IC8IP:3;
    unsigned :3;
    unsigned OC8IS:2;
    unsigned OC8IP:3;
  };
  struct {
    unsigned w:32;
  };
} __IPC9bits_t;*/
volatile __IPC9bits_t IPC9bits ;//__asm__ ("IPC9") ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC9CLR ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC9SET ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC9INV ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC10 ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned T9IS:2;
    unsigned T9IP:3;
    unsigned :3;
    unsigned IC9EIS:2;
    unsigned IC9EIP:3;
    unsigned :3;
    unsigned IC9IS:2;
    unsigned IC9IP:3;
    unsigned :3;
    unsigned OC9IS:2;
    unsigned OC9IP:3;
  };
  struct {
    unsigned w:32;
  };
} __IPC10bits_t;*/
volatile __IPC10bits_t IPC10bits ;//__asm__ ("IPC10") ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC10CLR ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC10SET ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC10INV ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC11 ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned ADCIS:2;
    unsigned ADCIP:3;
    unsigned :11;
    unsigned ADCDC1IS:2;
    unsigned ADCDC1IP:3;
    unsigned :3;
    unsigned ADCDC2IS:2;
    unsigned ADCDC2IP:3;
  };
  struct {
    unsigned w:32;
  };
} __IPC11bits_t;*/
volatile __IPC11bits_t IPC11bits ;//__asm__ ("IPC11") ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC11CLR ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC11SET ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC11INV ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC12 ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned ADCDC3IS:2;
    unsigned ADCDC3IP:3;
    unsigned :3;
    unsigned ADCDC4IS:2;
    unsigned ADCDC4IP:3;
    unsigned :3;
    unsigned ADCDC5IS:2;
    unsigned ADCDC5IP:3;
    unsigned :3;
    unsigned ADCDC6IS:2;
    unsigned ADCDC6IP:3;
  };
  struct {
    unsigned w:32;
  };
} __IPC12bits_t;*/
volatile __IPC12bits_t IPC12bits ;//__asm__ ("IPC12") ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC12CLR ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC12SET ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC12INV ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC13 ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned ADCDF1IS:2;
    unsigned ADCDF1IP:3;
    unsigned :3;
    unsigned ADCDF2IS:2;
    unsigned ADCDF2IP:3;
    unsigned :3;
    unsigned ADCDF3IS:2;
    unsigned ADCDF3IP:3;
    unsigned :3;
    unsigned ADCDF4IS:2;
    unsigned ADCDF4IP:3;
  };
  struct {
    unsigned w:32;
  };
} __IPC13bits_t;*/
volatile __IPC13bits_t IPC13bits ;//__asm__ ("IPC13") ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC13CLR ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC13SET ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC13INV ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC14 ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned ADCDF5IS:2;
    unsigned ADCDF5IP:3;
    unsigned :3;
    unsigned ADCDF6IS:2;
    unsigned ADCDF6IP:3;
    unsigned :3;
    unsigned ADCFLTIS:2;
    unsigned ADCFLTIP:3;
    unsigned :3;
    unsigned ADCD0IS:2;
    unsigned ADCD0IP:3;
  };
  struct {
    unsigned w:32;
  };
} __IPC14bits_t;*/
volatile __IPC14bits_t IPC14bits ;//__asm__ ("IPC14") ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC14CLR ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC14SET ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC14INV ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC15 ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned ADCD1IS:2;
    unsigned ADCD1IP:3;
    unsigned :3;
    unsigned ADCD2IS:2;
    unsigned ADCD2IP:3;
    unsigned :3;
    unsigned ADCD3IS:2;
    unsigned ADCD3IP:3;
    unsigned :3;
    unsigned ADCD4IS:2;
    unsigned ADCD4IP:3;
  };
  struct {
    unsigned w:32;
  };
} __IPC15bits_t;*/
volatile __IPC15bits_t IPC15bits ;//__asm__ ("IPC15") ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC15CLR ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC15SET ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC15INV ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC16 ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned ADCD5IS:2;
    unsigned ADCD5IP:3;
    unsigned :3;
    unsigned ADCD6IS:2;
    unsigned ADCD6IP:3;
    unsigned :3;
    unsigned ADCD7IS:2;
    unsigned ADCD7IP:3;
    unsigned :3;
    unsigned ADCD8IS:2;
    unsigned ADCD8IP:3;
  };
  struct {
    unsigned w:32;
  };
} __IPC16bits_t;*/
volatile __IPC16bits_t IPC16bits ;//__asm__ ("IPC16") ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC16CLR ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC16SET ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC16INV ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC17 ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned ADCD9IS:2;
    unsigned ADCD9IP:3;
    unsigned :3;
    unsigned ADCD10IS:2;
    unsigned ADCD10IP:3;
    unsigned :3;
    unsigned ADCD11IS:2;
    unsigned ADCD11IP:3;
    unsigned :3;
    unsigned ADCD12IS:2;
    unsigned ADCD12IP:3;
  };
  struct {
    unsigned w:32;
  };
} __IPC17bits_t;*/
volatile __IPC17bits_t IPC17bits ;//__asm__ ("IPC17") ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC17CLR ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC17SET ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC17INV ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC18 ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned ADCD13IS:2;
    unsigned ADCD13IP:3;
    unsigned :3;
    unsigned ADCD14IS:2;
    unsigned ADCD14IP:3;
    unsigned :3;
    unsigned ADCD15IS:2;
    unsigned ADCD15IP:3;
    unsigned :3;
    unsigned ADCD16IS:2;
    unsigned ADCD16IP:3;
  };
  struct {
    unsigned w:32;
  };
} __IPC18bits_t;*/
volatile __IPC18bits_t IPC18bits ;//__asm__ ("IPC18") ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC18CLR ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC18SET ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC18INV ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC19 ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned ADCD17IS:2;
    unsigned ADCD17IP:3;
    unsigned :3;
    unsigned ADCD18IS:2;
    unsigned ADCD18IP:3;
    unsigned :3;
    unsigned ADCD19IS:2;
    unsigned ADCD19IP:3;
    unsigned :3;
    unsigned ADCD20IS:2;
    unsigned ADCD20IP:3;
  };
  struct {
    unsigned w:32;
  };
} __IPC19bits_t;*/
volatile __IPC19bits_t IPC19bits ;//__asm__ ("IPC19") ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC19CLR ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC19SET ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC19INV ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC20 ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned ADCD21IS:2;
    unsigned ADCD21IP:3;
    unsigned :3;
    unsigned ADCD22IS:2;
    unsigned ADCD22IP:3;
    unsigned :3;
    unsigned ADCD23IS:2;
    unsigned ADCD23IP:3;
    unsigned :3;
    unsigned ADCD24IS:2;
    unsigned ADCD24IP:3;
  };
  struct {
    unsigned w:32;
  };
} __IPC20bits_t;*/
