HomuraVehicle/homuraLib_v2/machine/device/p32mz2048efg100_forVC.c
volatile __IPC20bits_t IPC20bits ;//__asm__ ("IPC20") ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC20CLR ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC20SET ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC20INV ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC21 ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned ADCD25IS:2;
    unsigned ADCD25IP:3;
    unsigned :3;
    unsigned ADCD26IS:2;
    unsigned ADCD26IP:3;
    unsigned :3;
    unsigned ADCD27IS:2;
    unsigned ADCD27IP:3;
    unsigned :3;
    unsigned ADCD28IS:2;
    unsigned ADCD28IP:3;
  };
  struct {
    unsigned w:32;
  };
} __IPC21bits_t;*/
volatile __IPC21bits_t IPC21bits ;//__asm__ ("IPC21") ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC21CLR ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC21SET ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC21INV ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC22 ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned ADCD29IS:2;
    unsigned ADCD29IP:3;
    unsigned :3;
    unsigned ADCD30IS:2;
    unsigned ADCD30IP:3;
    unsigned :3;
    unsigned ADCD31IS:2;
    unsigned ADCD31IP:3;
    unsigned :3;
    unsigned ADCD32IS:2;
    unsigned ADCD32IP:3;
  };
  struct {
    unsigned w:32;
  };
} __IPC22bits_t;*/
volatile __IPC22bits_t IPC22bits ;//__asm__ ("IPC22") ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC22CLR ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC22SET ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC22INV ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC23 ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned ADCD33IS:2;
    unsigned ADCD33IP:3;
    unsigned :3;
    unsigned ADCD34IS:2;
    unsigned ADCD34IP:3;
  };
  struct {
    unsigned w:32;
  };
} __IPC23bits_t;*/
volatile __IPC23bits_t IPC23bits ;//__asm__ ("IPC23") ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC23CLR ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC23SET ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC23INV ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC25 ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned :16;
    unsigned ADCD43IS:2;
    unsigned ADCD43IP:3;
    unsigned :3;
    unsigned ADCD44IS:2;
    unsigned ADCD44IP:3;
  };
  struct {
    unsigned w:32;
  };
} __IPC25bits_t;*/
volatile __IPC25bits_t IPC25bits ;//__asm__ ("IPC25") ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC25CLR ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC25SET ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC25INV ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC26 ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned CPCIS:2;
    unsigned CPCIP:3;
    unsigned :3;
    unsigned CFDCIS:2;
    unsigned CFDCIP:3;
    unsigned :3;
    unsigned SBIS:2;
    unsigned SBIP:3;
  };
  struct {
    unsigned w:32;
  };
} __IPC26bits_t;*/
volatile __IPC26bits_t IPC26bits ;//__asm__ ("IPC26") ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC26CLR ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC26SET ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC26INV ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC27 ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned :8;
    unsigned SPI1EIS:2;
    unsigned SPI1EIP:3;
    unsigned :3;
    unsigned SPI1RXIS:2;
    unsigned SPI1RXIP:3;
    unsigned :3;
    unsigned SPI1TXIS:2;
    unsigned SPI1TXIP:3;
  };
  struct {
    unsigned w:32;
  };
} __IPC27bits_t;*/
volatile __IPC27bits_t IPC27bits ;//__asm__ ("IPC27") ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC27CLR ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC27SET ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC27INV ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC28 ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned U1EIS:2;
    unsigned U1EIP:3;
    unsigned :3;
    unsigned U1RXIS:2;
    unsigned U1RXIP:3;
    unsigned :3;
    unsigned U1TXIS:2;
    unsigned U1TXIP:3;
    unsigned :3;
    unsigned I2C1BIS:2;
    unsigned I2C1BIP:3;
  };
  struct {
    unsigned w:32;
  };
} __IPC28bits_t;*/
volatile __IPC28bits_t IPC28bits ;//__asm__ ("IPC28") ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC28CLR ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC28SET ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC28INV ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC29 ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned I2C1SIS:2;
    unsigned I2C1SIP:3;
    unsigned :3;
    unsigned I2C1MIS:2;
    unsigned I2C1MIP:3;
    unsigned :3;
    unsigned CNAIS:2;
    unsigned CNAIP:3;
    unsigned :3;
    unsigned CNBIS:2;
    unsigned CNBIP:3;
  };
  struct {
    unsigned w:32;
  };
} __IPC29bits_t;*/
volatile __IPC29bits_t IPC29bits ;//__asm__ ("IPC29") ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC29CLR ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC29SET ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC29INV ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC30 ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned CNCIS:2;
    unsigned CNCIP:3;
    unsigned :3;
    unsigned CNDIS:2;
    unsigned CNDIP:3;
    unsigned :3;
    unsigned CNEIS:2;
    unsigned CNEIP:3;
    unsigned :3;
    unsigned CNFIS:2;
    unsigned CNFIP:3;
  };
  struct {
    unsigned w:32;
  };
} __IPC30bits_t;*/
volatile __IPC30bits_t IPC30bits ;//__asm__ ("IPC30") ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC30CLR ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC30SET ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC30INV ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC31 ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned CNGIS:2;
    unsigned CNGIP:3;
  };
  struct {
    unsigned w:32;
  };
} __IPC31bits_t;*/
