HomuraVehicle/homuraLib_v2/machine/device/p32mz2048efg100_forVC.c
volatile __IPC31bits_t IPC31bits ;//__asm__ ("IPC31") ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC31CLR ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC31SET ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC31INV ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC32 ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned PMPIS:2;
    unsigned PMPIP:3;
    unsigned :3;
    unsigned PMPEIS:2;
    unsigned PMPEIP:3;
    unsigned :3;
    unsigned CMP1IS:2;
    unsigned CMP1IP:3;
    unsigned :3;
    unsigned CMP2IS:2;
    unsigned CMP2IP:3;
  };
  struct {
    unsigned w:32;
  };
} __IPC32bits_t;*/
volatile __IPC32bits_t IPC32bits ;//__asm__ ("IPC32") ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC32CLR ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC32SET ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC32INV ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC33 ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned USBIS:2;
    unsigned USBIP:3;
    unsigned :3;
    unsigned USBDMAIS:2;
    unsigned USBDMAIP:3;
    unsigned :3;
    unsigned DMA0IS:2;
    unsigned DMA0IP:3;
    unsigned :3;
    unsigned DMA1IS:2;
    unsigned DMA1IP:3;
  };
  struct {
    unsigned w:32;
  };
} __IPC33bits_t;*/
volatile __IPC33bits_t IPC33bits ;//__asm__ ("IPC33") ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC33CLR ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC33SET ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC33INV ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC34 ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned DMA2IS:2;
    unsigned DMA2IP:3;
    unsigned :3;
    unsigned DMA3IS:2;
    unsigned DMA3IP:3;
    unsigned :3;
    unsigned DMA4IS:2;
    unsigned DMA4IP:3;
    unsigned :3;
    unsigned DMA5IS:2;
    unsigned DMA5IP:3;
  };
  struct {
    unsigned w:32;
  };
} __IPC34bits_t;*/
volatile __IPC34bits_t IPC34bits ;//__asm__ ("IPC34") ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC34CLR ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC34SET ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC34INV ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC35 ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned DMA6IS:2;
    unsigned DMA6IP:3;
    unsigned :3;
    unsigned DMA7IS:2;
    unsigned DMA7IP:3;
    unsigned :3;
    unsigned SPI2EIS:2;
    unsigned SPI2EIP:3;
    unsigned :3;
    unsigned SPI2RXIS:2;
    unsigned SPI2RXIP:3;
  };
  struct {
    unsigned w:32;
  };
} __IPC35bits_t;*/
volatile __IPC35bits_t IPC35bits ;//__asm__ ("IPC35") ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC35CLR ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC35SET ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC35INV ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC36 ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned SPI2TXIS:2;
    unsigned SPI2TXIP:3;
    unsigned :3;
    unsigned U2EIS:2;
    unsigned U2EIP:3;
    unsigned :3;
    unsigned U2RXIS:2;
    unsigned U2RXIP:3;
    unsigned :3;
    unsigned U2TXIS:2;
    unsigned U2TXIP:3;
  };
  struct {
    unsigned w:32;
  };
} __IPC36bits_t;*/
volatile __IPC36bits_t IPC36bits ;//__asm__ ("IPC36") ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC36CLR ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC36SET ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC36INV ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC37 ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned I2C2BIS:2;
    unsigned I2C2BIP:3;
    unsigned :3;
    unsigned I2C2SIS:2;
    unsigned I2C2SIP:3;
    unsigned :3;
    unsigned I2C2MIS:2;
    unsigned I2C2MIP:3;
  };
  struct {
    unsigned w:32;
  };
} __IPC37bits_t;*/
volatile __IPC37bits_t IPC37bits ;//__asm__ ("IPC37") ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC37CLR ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC37SET ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC37INV ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC38 ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned :8;
    unsigned ETHIS:2;
    unsigned ETHIP:3;
    unsigned :3;
    unsigned SPI3EIS:2;
    unsigned SPI3EIP:3;
    unsigned :3;
    unsigned SPI3RXIS:2;
    unsigned SPI3RXIP:3;
  };
  struct {
    unsigned w:32;
  };
} __IPC38bits_t;*/
volatile __IPC38bits_t IPC38bits ;//__asm__ ("IPC38") ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC38CLR ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC38SET ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC38INV ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC39 ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned SPI3TXIS:2;
    unsigned SPI3TXIP:3;
    unsigned :3;
    unsigned U3EIS:2;
    unsigned U3EIP:3;
    unsigned :3;
    unsigned U3RXIS:2;
    unsigned U3RXIP:3;
    unsigned :3;
    unsigned U3TXIS:2;
    unsigned U3TXIP:3;
  };
  struct {
    unsigned w:32;
  };
} __IPC39bits_t;*/
volatile __IPC39bits_t IPC39bits ;//__asm__ ("IPC39") ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC39CLR ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC39SET ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC39INV ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC40 ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned I2C3BIS:2;
    unsigned I2C3BIP:3;
    unsigned :3;
    unsigned I2C3SIS:2;
    unsigned I2C3SIP:3;
    unsigned :3;
    unsigned I2C3MIS:2;
    unsigned I2C3MIP:3;
    unsigned :3;
    unsigned SPI4EIS:2;
    unsigned SPI4EIP:3;
  };
  struct {
    unsigned w:32;
  };
} __IPC40bits_t;*/
volatile __IPC40bits_t IPC40bits ;//__asm__ ("IPC40") ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC40CLR ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC40SET ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC40INV ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC41 ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned SPI4RXIS:2;
    unsigned SPI4RXIP:3;
    unsigned :3;
    unsigned SPI4TXIS:2;
    unsigned SPI4TXIP:3;
    unsigned :3;
    unsigned RTCCIS:2;
    unsigned RTCCIP:3;
    unsigned :3;
    unsigned FCEIS:2;
    unsigned FCEIP:3;
  };
  struct {
    unsigned w:32;
  };
} __IPC41bits_t;*/
volatile __IPC41bits_t IPC41bits ;//__asm__ ("IPC41") ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC41CLR ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC41SET ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC41INV ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC42 ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned PREIS:2;
    unsigned PREIP:3;
    unsigned :3;
    unsigned SQI1IS:2;
    unsigned SQI1IP:3;
    unsigned :3;
    unsigned U4EIS:2;
    unsigned U4EIP:3;
    unsigned :3;
    unsigned U4RXIS:2;
    unsigned U4RXIP:3;
  };
  struct {
    unsigned w:32;
  };
} __IPC42bits_t;*/
volatile __IPC42bits_t IPC42bits ;//__asm__ ("IPC42") ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC42CLR ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC42SET ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC42INV ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC43 ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned U4TXIS:2;
    unsigned U4TXIP:3;
    unsigned :3;
    unsigned I2C4BIS:2;
    unsigned I2C4BIP:3;
    unsigned :3;
    unsigned I2C4SIS:2;
    unsigned I2C4SIP:3;
    unsigned :3;
    unsigned I2C4MIS:2;
    unsigned I2C4MIP:3;
  };
  struct {
    unsigned w:32;
  };
} __IPC43bits_t;*/
volatile __IPC43bits_t IPC43bits ;//__asm__ ("IPC43") ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC43CLR ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC43SET ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC43INV ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC44 ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned SPI5EIS:2;
    unsigned SPI5EIP:3;
    unsigned :3;
    unsigned SPI5RXIS:2;
    unsigned SPI5RXIP:3;
    unsigned :3;
    unsigned SPI5TXIS:2;
    unsigned SPI5TXIP:3;
    unsigned :3;
    unsigned U5EIS:2;
    unsigned U5EIP:3;
  };
  struct {
    unsigned w:32;
  };
} __IPC44bits_t;*/
volatile __IPC44bits_t IPC44bits ;//__asm__ ("IPC44") ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC44CLR ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC44SET ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC44INV ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC45 ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned U5RXIS:2;
    unsigned U5RXIP:3;
    unsigned :3;
    unsigned U5TXIS:2;
    unsigned U5TXIP:3;
    unsigned :3;
    unsigned I2C5BIS:2;
    unsigned I2C5BIP:3;
    unsigned :3;
    unsigned I2C5SIS:2;
    unsigned I2C5SIP:3;
  };
  struct {
    unsigned w:32;
  };
} __IPC45bits_t;*/
volatile __IPC45bits_t IPC45bits ;//__asm__ ("IPC45") ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC45CLR ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC45SET ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC45INV ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC46 ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned I2C5MIS:2;
    unsigned I2C5MIP:3;
    unsigned :3;
    unsigned SPI6EIS:2;
    unsigned SPI6EIP:3;
    unsigned :3;
    unsigned SPI6RXIS:2;
    unsigned SPI6RXIP:3;
    unsigned :3;
    unsigned SPI6TXIS:2;
    unsigned SPI6TXIP:3;
  };
  struct {
    unsigned w:32;
  };
} __IPC46bits_t;*/
volatile __IPC46bits_t IPC46bits ;//__asm__ ("IPC46") ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC46CLR ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC46SET ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC46INV ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC47 ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned U6EIS:2;
    unsigned U6EIP:3;
    unsigned :3;
    unsigned U6RXIS:2;
    unsigned U6RXIP:3;
    unsigned :3;
    unsigned U6TXIS:2;
    unsigned U6TXIP:3;
  };
  struct {
    unsigned w:32;
  };
} __IPC47bits_t;*/
volatile __IPC47bits_t IPC47bits ;//__asm__ ("IPC47") ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC47CLR ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC47SET ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC47INV ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC48 ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned ADCEOSIS:2;
    unsigned ADCEOSIP:3;
    unsigned :3;
    unsigned ADCARDYIS:2;
    unsigned ADCARDYIP:3;
    unsigned :3;
    unsigned ADCURDYIS:2;
    unsigned ADCURDYIP:3;
  };
  struct {
    unsigned w:32;
  };
} __IPC48bits_t;*/
volatile __IPC48bits_t IPC48bits ;//__asm__ ("IPC48") ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC48CLR ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC48SET ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC48INV ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC49 ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned ADCGRPIS:2;
    unsigned ADCGRPIP:3;
    unsigned :11;
    unsigned ADC0EIS:2;
    unsigned ADC0EIP:3;
    unsigned :3;
    unsigned ADC1EIS:2;
    unsigned ADC1EIP:3;
  };
  struct {
    unsigned w:32;
  };
} __IPC49bits_t;*/
volatile __IPC49bits_t IPC49bits ;//__asm__ ("IPC49") ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC49CLR ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC49SET ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC49INV ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC50 ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned ADC2EIS:2;
    unsigned ADC2EIP:3;
    unsigned :3;
    unsigned ADC3EIS:2;
    unsigned ADC3EIP:3;
    unsigned :3;
    unsigned ADC4EIS:2;
    unsigned ADC4EIP:3;
  };
  struct {
    unsigned w:32;
  };
} __IPC50bits_t;*/
volatile __IPC50bits_t IPC50bits ;//__asm__ ("IPC50") ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC50CLR ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC50SET ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC50INV ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC51 ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned :8;
    unsigned ADC7EIS:2;
    unsigned ADC7EIP:3;
    unsigned :3;
    unsigned ADC0WIS:2;
    unsigned ADC0WIP:3;
    unsigned :3;
    unsigned ADC1WIS:2;
    unsigned ADC1WIP:3;
  };
  struct {
    unsigned w:32;
  };
} __IPC51bits_t;*/
volatile __IPC51bits_t IPC51bits ;//__asm__ ("IPC51") ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC51CLR ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC51SET ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC51INV ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC52 ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned ADC2WIS:2;
    unsigned ADC2WIP:3;
    unsigned :3;
    unsigned ADC3WIS:2;
    unsigned ADC3WIP:3;
    unsigned :3;
    unsigned ADC4WIS:2;
    unsigned ADC4WIP:3;
  };
  struct {
    unsigned w:32;
  };
} __IPC52bits_t;*/
volatile __IPC52bits_t IPC52bits ;//__asm__ ("IPC52") ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC52CLR ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC52SET ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC52INV ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC53 ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned :8;
    unsigned ADC7WIS:2;
    unsigned ADC7WIP:3;
  };
  struct {
    unsigned w:32;
  };
} __IPC53bits_t;*/
volatile __IPC53bits_t IPC53bits ;//__asm__ ("IPC53") ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC53CLR ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC53SET ;//__attribute__((section("sfrs")));
volatile unsigned int        IPC53INV ;//__attribute__((section("sfrs")));
volatile unsigned int        OFF000 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF000bits_t;*/
volatile __OFF000bits_t OFF000bits ;//__asm__ ("OFF000") ;//__attribute__((section("sfrs")));
volatile unsigned int        OFF001 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF001bits_t;*/
volatile __OFF001bits_t OFF001bits ;//__asm__ ("OFF001") ;//__attribute__((section("sfrs")));
volatile unsigned int        OFF002 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF002bits_t;*/
volatile __OFF002bits_t OFF002bits ;//__asm__ ("OFF002") ;//__attribute__((section("sfrs")));
volatile unsigned int        OFF003 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF003bits_t;*/
volatile __OFF003bits_t OFF003bits ;//__asm__ ("OFF003") ;//__attribute__((section("sfrs")));
volatile unsigned int        OFF004 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF004bits_t;*/
volatile __OFF004bits_t OFF004bits ;//__asm__ ("OFF004") ;//__attribute__((section("sfrs")));
volatile unsigned int        OFF005 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF005bits_t;*/
volatile __OFF005bits_t OFF005bits ;//__asm__ ("OFF005") ;//__attribute__((section("sfrs")));
volatile unsigned int        OFF006 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF006bits_t;*/
