HomuraVehicle/homuraLib_v2/machine/device/p32mz2048efg100_forVC.c
volatile __OFF006bits_t OFF006bits ;//__asm__ ("OFF006") ;//__attribute__((section("sfrs")));
volatile unsigned int        OFF007 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF007bits_t;*/
volatile __OFF007bits_t OFF007bits ;//__asm__ ("OFF007") ;//__attribute__((section("sfrs")));
volatile unsigned int        OFF008 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF008bits_t;*/
volatile __OFF008bits_t OFF008bits ;//__asm__ ("OFF008") ;//__attribute__((section("sfrs")));
volatile unsigned int        OFF009 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF009bits_t;*/
volatile __OFF009bits_t OFF009bits ;//__asm__ ("OFF009") ;//__attribute__((section("sfrs")));
volatile unsigned int        OFF010 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF010bits_t;*/
volatile __OFF010bits_t OFF010bits ;//__asm__ ("OFF010") ;//__attribute__((section("sfrs")));
volatile unsigned int        OFF011 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF011bits_t;*/
volatile __OFF011bits_t OFF011bits ;//__asm__ ("OFF011") ;//__attribute__((section("sfrs")));
volatile unsigned int        OFF012 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF012bits_t;*/
volatile __OFF012bits_t OFF012bits ;//__asm__ ("OFF012") ;//__attribute__((section("sfrs")));
volatile unsigned int        OFF013 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF013bits_t;*/
volatile __OFF013bits_t OFF013bits ;//__asm__ ("OFF013") ;//__attribute__((section("sfrs")));
volatile unsigned int        OFF014 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF014bits_t;*/
volatile __OFF014bits_t OFF014bits ;//__asm__ ("OFF014") ;//__attribute__((section("sfrs")));
volatile unsigned int        OFF015 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF015bits_t;*/
volatile __OFF015bits_t OFF015bits ;//__asm__ ("OFF015") ;//__attribute__((section("sfrs")));
volatile unsigned int        OFF016 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF016bits_t;*/
volatile __OFF016bits_t OFF016bits ;//__asm__ ("OFF016") ;//__attribute__((section("sfrs")));
volatile unsigned int        OFF017 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF017bits_t;*/
volatile __OFF017bits_t OFF017bits ;//__asm__ ("OFF017") ;//__attribute__((section("sfrs")));
volatile unsigned int        OFF018 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF018bits_t;*/
volatile __OFF018bits_t OFF018bits ;//__asm__ ("OFF018") ;//__attribute__((section("sfrs")));
volatile unsigned int        OFF019 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF019bits_t;*/
volatile __OFF019bits_t OFF019bits ;//__asm__ ("OFF019") ;//__attribute__((section("sfrs")));
volatile unsigned int        OFF020 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF020bits_t;*/
volatile __OFF020bits_t OFF020bits ;//__asm__ ("OFF020") ;//__attribute__((section("sfrs")));
volatile unsigned int        OFF021 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF021bits_t;*/
volatile __OFF021bits_t OFF021bits ;//__asm__ ("OFF021") ;//__attribute__((section("sfrs")));
volatile unsigned int        OFF022 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF022bits_t;*/
volatile __OFF022bits_t OFF022bits ;//__asm__ ("OFF022") ;//__attribute__((section("sfrs")));
volatile unsigned int        OFF023 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF023bits_t;*/
volatile __OFF023bits_t OFF023bits ;//__asm__ ("OFF023") ;//__attribute__((section("sfrs")));
volatile unsigned int        OFF024 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF024bits_t;*/
volatile __OFF024bits_t OFF024bits ;//__asm__ ("OFF024") ;//__attribute__((section("sfrs")));
volatile unsigned int        OFF025 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF025bits_t;*/
volatile __OFF025bits_t OFF025bits ;//__asm__ ("OFF025") ;//__attribute__((section("sfrs")));
volatile unsigned int        OFF026 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF026bits_t;*/
volatile __OFF026bits_t OFF026bits ;//__asm__ ("OFF026") ;//__attribute__((section("sfrs")));
volatile unsigned int        OFF027 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF027bits_t;*/
volatile __OFF027bits_t OFF027bits ;//__asm__ ("OFF027") ;//__attribute__((section("sfrs")));
volatile unsigned int        OFF028 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF028bits_t;*/
volatile __OFF028bits_t OFF028bits ;//__asm__ ("OFF028") ;//__attribute__((section("sfrs")));
volatile unsigned int        OFF029 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF029bits_t;*/
volatile __OFF029bits_t OFF029bits ;//__asm__ ("OFF029") ;//__attribute__((section("sfrs")));
volatile unsigned int        OFF030 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF030bits_t;*/
volatile __OFF030bits_t OFF030bits ;//__asm__ ("OFF030") ;//__attribute__((section("sfrs")));
volatile unsigned int        OFF031 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF031bits_t;*/
