HomuraVehicle/homuraLib_v2/machine/device/p32mz2048efg100_forVC.c
volatile __OFF031bits_t OFF031bits ;//__asm__ ("OFF031") ;//__attribute__((section("sfrs")));
volatile unsigned int        OFF032 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF032bits_t;*/
volatile __OFF032bits_t OFF032bits ;//__asm__ ("OFF032") ;//__attribute__((section("sfrs")));
volatile unsigned int        OFF033 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF033bits_t;*/
volatile __OFF033bits_t OFF033bits ;//__asm__ ("OFF033") ;//__attribute__((section("sfrs")));
volatile unsigned int        OFF034 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF034bits_t;*/
volatile __OFF034bits_t OFF034bits ;//__asm__ ("OFF034") ;//__attribute__((section("sfrs")));
volatile unsigned int        OFF035 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF035bits_t;*/
volatile __OFF035bits_t OFF035bits ;//__asm__ ("OFF035") ;//__attribute__((section("sfrs")));
volatile unsigned int        OFF036 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF036bits_t;*/
volatile __OFF036bits_t OFF036bits ;//__asm__ ("OFF036") ;//__attribute__((section("sfrs")));
volatile unsigned int        OFF037 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF037bits_t;*/
volatile __OFF037bits_t OFF037bits ;//__asm__ ("OFF037") ;//__attribute__((section("sfrs")));
volatile unsigned int        OFF038 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF038bits_t;*/
volatile __OFF038bits_t OFF038bits ;//__asm__ ("OFF038") ;//__attribute__((section("sfrs")));
volatile unsigned int        OFF039 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF039bits_t;*/
volatile __OFF039bits_t OFF039bits ;//__asm__ ("OFF039") ;//__attribute__((section("sfrs")));
volatile unsigned int        OFF040 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF040bits_t;*/
volatile __OFF040bits_t OFF040bits ;//__asm__ ("OFF040") ;//__attribute__((section("sfrs")));
volatile unsigned int        OFF041 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF041bits_t;*/
volatile __OFF041bits_t OFF041bits ;//__asm__ ("OFF041") ;//__attribute__((section("sfrs")));
volatile unsigned int        OFF042 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF042bits_t;*/
volatile __OFF042bits_t OFF042bits ;//__asm__ ("OFF042") ;//__attribute__((section("sfrs")));
volatile unsigned int        OFF043 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF043bits_t;*/
volatile __OFF043bits_t OFF043bits ;//__asm__ ("OFF043") ;//__attribute__((section("sfrs")));
volatile unsigned int        OFF044 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF044bits_t;*/
volatile __OFF044bits_t OFF044bits ;//__asm__ ("OFF044") ;//__attribute__((section("sfrs")));
volatile unsigned int        OFF046 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF046bits_t;*/
volatile __OFF046bits_t OFF046bits ;//__asm__ ("OFF046") ;//__attribute__((section("sfrs")));
volatile unsigned int        OFF047 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF047bits_t;*/
volatile __OFF047bits_t OFF047bits ;//__asm__ ("OFF047") ;//__attribute__((section("sfrs")));
volatile unsigned int        OFF048 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF048bits_t;*/
volatile __OFF048bits_t OFF048bits ;//__asm__ ("OFF048") ;//__attribute__((section("sfrs")));
volatile unsigned int        OFF049 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF049bits_t;*/
volatile __OFF049bits_t OFF049bits ;//__asm__ ("OFF049") ;//__attribute__((section("sfrs")));
volatile unsigned int        OFF050 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF050bits_t;*/
volatile __OFF050bits_t OFF050bits ;//__asm__ ("OFF050") ;//__attribute__((section("sfrs")));
volatile unsigned int        OFF051 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF051bits_t;*/
volatile __OFF051bits_t OFF051bits ;//__asm__ ("OFF051") ;//__attribute__((section("sfrs")));
volatile unsigned int        OFF052 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF052bits_t;*/
volatile __OFF052bits_t OFF052bits ;//__asm__ ("OFF052") ;//__attribute__((section("sfrs")));
volatile unsigned int        OFF053 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF053bits_t;*/
volatile __OFF053bits_t OFF053bits ;//__asm__ ("OFF053") ;//__attribute__((section("sfrs")));
volatile unsigned int        OFF054 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF054bits_t;*/
volatile __OFF054bits_t OFF054bits ;//__asm__ ("OFF054") ;//__attribute__((section("sfrs")));
volatile unsigned int        OFF055 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF055bits_t;*/
volatile __OFF055bits_t OFF055bits ;//__asm__ ("OFF055") ;//__attribute__((section("sfrs")));
volatile unsigned int        OFF056 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF056bits_t;*/
volatile __OFF056bits_t OFF056bits ;//__asm__ ("OFF056") ;//__attribute__((section("sfrs")));
volatile unsigned int        OFF057 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF057bits_t;*/
volatile __OFF057bits_t OFF057bits ;//__asm__ ("OFF057") ;//__attribute__((section("sfrs")));
volatile unsigned int        OFF058 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF058bits_t;*/
volatile __OFF058bits_t OFF058bits ;//__asm__ ("OFF058") ;//__attribute__((section("sfrs")));
volatile unsigned int        OFF059 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF059bits_t;*/
volatile __OFF059bits_t OFF059bits ;//__asm__ ("OFF059") ;//__attribute__((section("sfrs")));
volatile unsigned int        OFF060 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF060bits_t;*/
volatile __OFF060bits_t OFF060bits ;//__asm__ ("OFF060") ;//__attribute__((section("sfrs")));
volatile unsigned int        OFF061 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF061bits_t;*/
volatile __OFF061bits_t OFF061bits ;//__asm__ ("OFF061") ;//__attribute__((section("sfrs")));
volatile unsigned int        OFF062 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF062bits_t;*/
