HomuraVehicle/homuraLib_v2/machine/device/p32mz2048efg100_forVC.c
volatile __OFF106bits_t OFF106bits ;//__asm__ ("OFF106") ;//__attribute__((section("sfrs")));
volatile unsigned int        OFF109 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF109bits_t;*/
volatile __OFF109bits_t OFF109bits ;//__asm__ ("OFF109") ;//__attribute__((section("sfrs")));
volatile unsigned int        OFF110 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF110bits_t;*/
volatile __OFF110bits_t OFF110bits ;//__asm__ ("OFF110") ;//__attribute__((section("sfrs")));
volatile unsigned int        OFF111 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF111bits_t;*/
volatile __OFF111bits_t OFF111bits ;//__asm__ ("OFF111") ;//__attribute__((section("sfrs")));
volatile unsigned int        OFF112 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF112bits_t;*/
volatile __OFF112bits_t OFF112bits ;//__asm__ ("OFF112") ;//__attribute__((section("sfrs")));
volatile unsigned int        OFF113 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF113bits_t;*/
volatile __OFF113bits_t OFF113bits ;//__asm__ ("OFF113") ;//__attribute__((section("sfrs")));
volatile unsigned int        OFF114 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF114bits_t;*/
volatile __OFF114bits_t OFF114bits ;//__asm__ ("OFF114") ;//__attribute__((section("sfrs")));
volatile unsigned int        OFF115 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF115bits_t;*/
volatile __OFF115bits_t OFF115bits ;//__asm__ ("OFF115") ;//__attribute__((section("sfrs")));
volatile unsigned int        OFF116 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF116bits_t;*/
volatile __OFF116bits_t OFF116bits ;//__asm__ ("OFF116") ;//__attribute__((section("sfrs")));
volatile unsigned int        OFF117 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF117bits_t;*/
volatile __OFF117bits_t OFF117bits ;//__asm__ ("OFF117") ;//__attribute__((section("sfrs")));
volatile unsigned int        OFF118 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF118bits_t;*/
volatile __OFF118bits_t OFF118bits ;//__asm__ ("OFF118") ;//__attribute__((section("sfrs")));
volatile unsigned int        OFF119 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF119bits_t;*/
volatile __OFF119bits_t OFF119bits ;//__asm__ ("OFF119") ;//__attribute__((section("sfrs")));
volatile unsigned int        OFF120 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF120bits_t;*/
volatile __OFF120bits_t OFF120bits ;//__asm__ ("OFF120") ;//__attribute__((section("sfrs")));
volatile unsigned int        OFF121 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF121bits_t;*/
volatile __OFF121bits_t OFF121bits ;//__asm__ ("OFF121") ;//__attribute__((section("sfrs")));
volatile unsigned int        OFF122 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF122bits_t;*/
volatile __OFF122bits_t OFF122bits ;//__asm__ ("OFF122") ;//__attribute__((section("sfrs")));
volatile unsigned int        OFF123 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF123bits_t;*/
volatile __OFF123bits_t OFF123bits ;//__asm__ ("OFF123") ;//__attribute__((section("sfrs")));
volatile unsigned int        OFF124 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF124bits_t;*/
volatile __OFF124bits_t OFF124bits ;//__asm__ ("OFF124") ;//__attribute__((section("sfrs")));
volatile unsigned int        OFF128 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF128bits_t;*/
volatile __OFF128bits_t OFF128bits ;//__asm__ ("OFF128") ;//__attribute__((section("sfrs")));
volatile unsigned int        OFF129 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF129bits_t;*/
volatile __OFF129bits_t OFF129bits ;//__asm__ ("OFF129") ;//__attribute__((section("sfrs")));
volatile unsigned int        OFF130 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF130bits_t;*/
volatile __OFF130bits_t OFF130bits ;//__asm__ ("OFF130") ;//__attribute__((section("sfrs")));
volatile unsigned int        OFF131 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF131bits_t;*/
volatile __OFF131bits_t OFF131bits ;//__asm__ ("OFF131") ;//__attribute__((section("sfrs")));
volatile unsigned int        OFF132 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF132bits_t;*/
volatile __OFF132bits_t OFF132bits ;//__asm__ ("OFF132") ;//__attribute__((section("sfrs")));
volatile unsigned int        OFF133 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF133bits_t;*/
volatile __OFF133bits_t OFF133bits ;//__asm__ ("OFF133") ;//__attribute__((section("sfrs")));
volatile unsigned int        OFF134 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF134bits_t;*/
volatile __OFF134bits_t OFF134bits ;//__asm__ ("OFF134") ;//__attribute__((section("sfrs")));
volatile unsigned int        OFF135 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF135bits_t;*/
volatile __OFF135bits_t OFF135bits ;//__asm__ ("OFF135") ;//__attribute__((section("sfrs")));
volatile unsigned int        OFF136 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF136bits_t;*/
volatile __OFF136bits_t OFF136bits ;//__asm__ ("OFF136") ;//__attribute__((section("sfrs")));
volatile unsigned int        OFF137 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF137bits_t;*/
volatile __OFF137bits_t OFF137bits ;//__asm__ ("OFF137") ;//__attribute__((section("sfrs")));
volatile unsigned int        OFF138 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned :1;
  unsigned VOFF:17;
} __OFF138bits_t;*/
