HomuraVehicle/homuraLib_v2/machine/device/p32mz2048efg100_forVC.c
volatile __DCH0SPTRbits_t DCH0SPTRbits ;//__asm__ ("DCH0SPTR") ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH0SPTRCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH0SPTRSET ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH0SPTRINV ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH0DPTR ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned CHDPTR:16;
} __DCH0DPTRbits_t;*/
volatile __DCH0DPTRbits_t DCH0DPTRbits ;//__asm__ ("DCH0DPTR") ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH0DPTRCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH0DPTRSET ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH0DPTRINV ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH0CSIZ ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned CHCSIZ:16;
} __DCH0CSIZbits_t;*/
volatile __DCH0CSIZbits_t DCH0CSIZbits ;//__asm__ ("DCH0CSIZ") ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH0CSIZCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH0CSIZSET ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH0CSIZINV ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH0CPTR ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned CHCPTR:16;
} __DCH0CPTRbits_t;*/
volatile __DCH0CPTRbits_t DCH0CPTRbits ;//__asm__ ("DCH0CPTR") ;//__attribute__((section("sfrs")));
volatile unsigned int        DCS0CPTR ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned CHCPTR:16;
} __DCS0CPTRbits_t;*/
volatile __DCS0CPTRbits_t DCS0CPTRbits ;//__asm__ ("DCS0CPTR") ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH0CPTRCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        DCS0CPTRCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH0CPTRSET ;//__attribute__((section("sfrs")));
volatile unsigned int        DCS0CPTRSET ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH0CPTRINV ;//__attribute__((section("sfrs")));
volatile unsigned int        DCS0CPTRINV ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH0DAT ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned CHPDAT:16;
} __DCH0DATbits_t;*/
volatile __DCH0DATbits_t DCH0DATbits ;//__asm__ ("DCH0DAT") ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH0DATCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH0DATSET ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH0DATINV ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH1CON ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned CHPRI:2;
  unsigned CHEDET:1;
  unsigned :1;
  unsigned CHAEN:1;
  unsigned CHCHN:1;
  unsigned CHAED:1;
  unsigned CHEN:1;
  unsigned CHCHNS:1;
  unsigned :2;
  unsigned CHPATLEN:1;
  unsigned :1;
  unsigned CHPIGNEN:1;
  unsigned :1;
  unsigned CHBUSY:1;
  unsigned :8;
  unsigned CHPIGN:8;
} __DCH1CONbits_t;*/
volatile __DCH1CONbits_t DCH1CONbits ;//__asm__ ("DCH1CON") ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH1CONCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH1CONSET ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH1CONINV ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH1ECON ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned :3;
  unsigned AIRQEN:1;
  unsigned SIRQEN:1;
  unsigned PATEN:1;
  unsigned CABORT:1;
  unsigned CFORCE:1;
  unsigned CHSIRQ:8;
  unsigned CHAIRQ:8;
} __DCH1ECONbits_t;*/
volatile __DCH1ECONbits_t DCH1ECONbits ;//__asm__ ("DCH1ECON") ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH1ECONCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH1ECONSET ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH1ECONINV ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH1INT ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned CHERIF:1;
  unsigned CHTAIF:1;
  unsigned CHCCIF:1;
  unsigned CHBCIF:1;
  unsigned CHDHIF:1;
  unsigned CHDDIF:1;
  unsigned CHSHIF:1;
  unsigned CHSDIF:1;
  unsigned :8;
  unsigned CHERIE:1;
  unsigned CHTAIE:1;
  unsigned CHCCIE:1;
  unsigned CHBCIE:1;
  unsigned CHDHIE:1;
  unsigned CHDDIE:1;
  unsigned CHSHIE:1;
  unsigned CHSDIE:1;
} __DCH1INTbits_t;*/
volatile __DCH1INTbits_t DCH1INTbits ;//__asm__ ("DCH1INT") ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH1INTCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH1INTSET ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH1INTINV ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH1SSA ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned CHSSA:32;
} __DCH1SSAbits_t;*/
volatile __DCH1SSAbits_t DCH1SSAbits ;//__asm__ ("DCH1SSA") ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH1SSACLR ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH1SSASET ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH1SSAINV ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH1DSA ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned CHDSA:32;
} __DCH1DSAbits_t;*/
volatile __DCH1DSAbits_t DCH1DSAbits ;//__asm__ ("DCH1DSA") ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH1DSACLR ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH1DSASET ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH1DSAINV ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH1SSIZ ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned CHSSIZ:16;
} __DCH1SSIZbits_t;*/
volatile __DCH1SSIZbits_t DCH1SSIZbits ;//__asm__ ("DCH1SSIZ") ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH1SSIZCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH1SSIZSET ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH1SSIZINV ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH1DSIZ ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned CHDSIZ:16;
} __DCH1DSIZbits_t;*/
volatile __DCH1DSIZbits_t DCH1DSIZbits ;//__asm__ ("DCH1DSIZ") ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH1DSIZCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH1DSIZSET ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH1DSIZINV ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH1SPTR ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned CHSPTR:16;
} __DCH1SPTRbits_t;*/
