HomuraVehicle/homuraLib_v2/machine/device/p32mz2048efg100_forVC.c
volatile __DCH1SPTRbits_t DCH1SPTRbits ;//__asm__ ("DCH1SPTR") ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH1SPTRCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH1SPTRSET ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH1SPTRINV ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH1DPTR ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned CHDPTR:16;
} __DCH1DPTRbits_t;*/
volatile __DCH1DPTRbits_t DCH1DPTRbits ;//__asm__ ("DCH1DPTR") ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH1DPTRCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH1DPTRSET ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH1DPTRINV ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH1CSIZ ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned CHCSIZ:16;
} __DCH1CSIZbits_t;*/
volatile __DCH1CSIZbits_t DCH1CSIZbits ;//__asm__ ("DCH1CSIZ") ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH1CSIZCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH1CSIZSET ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH1CSIZINV ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH1CPTR ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned CHCPTR:16;
} __DCH1CPTRbits_t;*/
volatile __DCH1CPTRbits_t DCH1CPTRbits ;//__asm__ ("DCH1CPTR") ;//__attribute__((section("sfrs")));
volatile unsigned int        DCS1CPTR ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned CHCPTR:16;
} __DCS1CPTRbits_t;*/
volatile __DCS1CPTRbits_t DCS1CPTRbits ;//__asm__ ("DCS1CPTR") ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH1CPTRCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        DCS1CPTRCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH1CPTRSET ;//__attribute__((section("sfrs")));
volatile unsigned int        DCS1CPTRSET ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH1CPTRINV ;//__attribute__((section("sfrs")));
volatile unsigned int        DCS1CPTRINV ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH1DAT ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned CHPDAT:16;
} __DCH1DATbits_t;*/
volatile __DCH1DATbits_t DCH1DATbits ;//__asm__ ("DCH1DAT") ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH1DATCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH1DATSET ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH1DATINV ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH2CON ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned CHPRI:2;
  unsigned CHEDET:1;
  unsigned :1;
  unsigned CHAEN:1;
  unsigned CHCHN:1;
  unsigned CHAED:1;
  unsigned CHEN:1;
  unsigned CHCHNS:1;
  unsigned :2;
  unsigned CHPATLEN:1;
  unsigned :1;
  unsigned CHPIGNEN:1;
  unsigned :1;
  unsigned CHBUSY:1;
  unsigned :8;
  unsigned CHPIGN:8;
} __DCH2CONbits_t;*/
volatile __DCH2CONbits_t DCH2CONbits ;//__asm__ ("DCH2CON") ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH2CONCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH2CONSET ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH2CONINV ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH2ECON ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned :3;
  unsigned AIRQEN:1;
  unsigned SIRQEN:1;
  unsigned PATEN:1;
  unsigned CABORT:1;
  unsigned CFORCE:1;
  unsigned CHSIRQ:8;
  unsigned CHAIRQ:8;
} __DCH2ECONbits_t;*/
volatile __DCH2ECONbits_t DCH2ECONbits ;//__asm__ ("DCH2ECON") ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH2ECONCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH2ECONSET ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH2ECONINV ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH2INT ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned CHERIF:1;
  unsigned CHTAIF:1;
  unsigned CHCCIF:1;
  unsigned CHBCIF:1;
  unsigned CHDHIF:1;
  unsigned CHDDIF:1;
  unsigned CHSHIF:1;
  unsigned CHSDIF:1;
  unsigned :8;
  unsigned CHERIE:1;
  unsigned CHTAIE:1;
  unsigned CHCCIE:1;
  unsigned CHBCIE:1;
  unsigned CHDHIE:1;
  unsigned CHDDIE:1;
  unsigned CHSHIE:1;
  unsigned CHSDIE:1;
} __DCH2INTbits_t;*/
volatile __DCH2INTbits_t DCH2INTbits ;//__asm__ ("DCH2INT") ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH2INTCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH2INTSET ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH2INTINV ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH2SSA ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned CHSSA:32;
} __DCH2SSAbits_t;*/
volatile __DCH2SSAbits_t DCH2SSAbits ;//__asm__ ("DCH2SSA") ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH2SSACLR ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH2SSASET ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH2SSAINV ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH2DSA ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned CHDSA:32;
} __DCH2DSAbits_t;*/
volatile __DCH2DSAbits_t DCH2DSAbits ;//__asm__ ("DCH2DSA") ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH2DSACLR ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH2DSASET ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH2DSAINV ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH2SSIZ ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned CHSSIZ:16;
} __DCH2SSIZbits_t;*/
volatile __DCH2SSIZbits_t DCH2SSIZbits ;//__asm__ ("DCH2SSIZ") ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH2SSIZCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH2SSIZSET ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH2SSIZINV ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH2DSIZ ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned CHDSIZ:16;
} __DCH2DSIZbits_t;*/
volatile __DCH2DSIZbits_t DCH2DSIZbits ;//__asm__ ("DCH2DSIZ") ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH2DSIZCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH2DSIZSET ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH2DSIZINV ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH2SPTR ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned CHSPTR:16;
} __DCH2SPTRbits_t;*/
