HomuraVehicle/homuraLib_v2/machine/device/p32mz2048efg100_forVC.c
volatile __DCH2SPTRbits_t DCH2SPTRbits ;//__asm__ ("DCH2SPTR") ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH2SPTRCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH2SPTRSET ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH2SPTRINV ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH2DPTR ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned CHDPTR:16;
} __DCH2DPTRbits_t;*/
volatile __DCH2DPTRbits_t DCH2DPTRbits ;//__asm__ ("DCH2DPTR") ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH2DPTRCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH2DPTRSET ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH2DPTRINV ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH2CSIZ ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned CHCSIZ:16;
} __DCH2CSIZbits_t;*/
volatile __DCH2CSIZbits_t DCH2CSIZbits ;//__asm__ ("DCH2CSIZ") ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH2CSIZCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH2CSIZSET ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH2CSIZINV ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH2CPTR ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned CHCPTR:16;
} __DCH2CPTRbits_t;*/
volatile __DCH2CPTRbits_t DCH2CPTRbits ;//__asm__ ("DCH2CPTR") ;//__attribute__((section("sfrs")));
volatile unsigned int        DCS2CPTR ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned CHCPTR:16;
} __DCS2CPTRbits_t;*/
volatile __DCS2CPTRbits_t DCS2CPTRbits ;//__asm__ ("DCS2CPTR") ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH2CPTRCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        DCS2CPTRCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH2CPTRSET ;//__attribute__((section("sfrs")));
volatile unsigned int        DCS2CPTRSET ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH2CPTRINV ;//__attribute__((section("sfrs")));
volatile unsigned int        DCS2CPTRINV ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH2DAT ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned CHPDAT:16;
} __DCH2DATbits_t;*/
volatile __DCH2DATbits_t DCH2DATbits ;//__asm__ ("DCH2DAT") ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH2DATCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH2DATSET ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH2DATINV ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH3CON ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned CHPRI:2;
  unsigned CHEDET:1;
  unsigned :1;
  unsigned CHAEN:1;
  unsigned CHCHN:1;
  unsigned CHAED:1;
  unsigned CHEN:1;
  unsigned CHCHNS:1;
  unsigned :2;
  unsigned CHPATLEN:1;
  unsigned :1;
  unsigned CHPIGNEN:1;
  unsigned :1;
  unsigned CHBUSY:1;
  unsigned :8;
  unsigned CHPIGN:8;
} __DCH3CONbits_t;*/
volatile __DCH3CONbits_t DCH3CONbits ;//__asm__ ("DCH3CON") ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH3CONCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH3CONSET ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH3CONINV ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH3ECON ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned :3;
  unsigned AIRQEN:1;
  unsigned SIRQEN:1;
  unsigned PATEN:1;
  unsigned CABORT:1;
  unsigned CFORCE:1;
  unsigned CHSIRQ:8;
  unsigned CHAIRQ:8;
} __DCH3ECONbits_t;*/
volatile __DCH3ECONbits_t DCH3ECONbits ;//__asm__ ("DCH3ECON") ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH3ECONCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH3ECONSET ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH3ECONINV ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH3INT ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned CHERIF:1;
  unsigned CHTAIF:1;
  unsigned CHCCIF:1;
  unsigned CHBCIF:1;
  unsigned CHDHIF:1;
  unsigned CHDDIF:1;
  unsigned CHSHIF:1;
  unsigned CHSDIF:1;
  unsigned :8;
  unsigned CHERIE:1;
  unsigned CHTAIE:1;
  unsigned CHCCIE:1;
  unsigned CHBCIE:1;
  unsigned CHDHIE:1;
  unsigned CHDDIE:1;
  unsigned CHSHIE:1;
  unsigned CHSDIE:1;
} __DCH3INTbits_t;*/
volatile __DCH3INTbits_t DCH3INTbits ;//__asm__ ("DCH3INT") ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH3INTCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH3INTSET ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH3INTINV ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH3SSA ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned CHSSA:32;
} __DCH3SSAbits_t;*/
volatile __DCH3SSAbits_t DCH3SSAbits ;//__asm__ ("DCH3SSA") ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH3SSACLR ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH3SSASET ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH3SSAINV ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH3DSA ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned CHDSA:32;
} __DCH3DSAbits_t;*/
volatile __DCH3DSAbits_t DCH3DSAbits ;//__asm__ ("DCH3DSA") ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH3DSACLR ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH3DSASET ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH3DSAINV ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH3SSIZ ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned CHSSIZ:16;
} __DCH3SSIZbits_t;*/
volatile __DCH3SSIZbits_t DCH3SSIZbits ;//__asm__ ("DCH3SSIZ") ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH3SSIZCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH3SSIZSET ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH3SSIZINV ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH3DSIZ ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned CHDSIZ:16;
} __DCH3DSIZbits_t;*/
volatile __DCH3DSIZbits_t DCH3DSIZbits ;//__asm__ ("DCH3DSIZ") ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH3DSIZCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH3DSIZSET ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH3DSIZINV ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH3SPTR ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned CHSPTR:16;
} __DCH3SPTRbits_t;*/
