HomuraVehicle/homuraLib_v2/machine/device/p32mz2048efg100_forVC.c
volatile __DCH7CONbits_t DCH7CONbits ;//__asm__ ("DCH7CON") ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH7CONCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH7CONSET ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH7CONINV ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH7ECON ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned :3;
  unsigned AIRQEN:1;
  unsigned SIRQEN:1;
  unsigned PATEN:1;
  unsigned CABORT:1;
  unsigned CFORCE:1;
  unsigned CHSIRQ:8;
  unsigned CHAIRQ:8;
} __DCH7ECONbits_t;*/
volatile __DCH7ECONbits_t DCH7ECONbits ;//__asm__ ("DCH7ECON") ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH7ECONCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH7ECONSET ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH7ECONINV ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH7INT ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned CHERIF:1;
  unsigned CHTAIF:1;
  unsigned CHCCIF:1;
  unsigned CHBCIF:1;
  unsigned CHDHIF:1;
  unsigned CHDDIF:1;
  unsigned CHSHIF:1;
  unsigned CHSDIF:1;
  unsigned :8;
  unsigned CHERIE:1;
  unsigned CHTAIE:1;
  unsigned CHCCIE:1;
  unsigned CHBCIE:1;
  unsigned CHDHIE:1;
  unsigned CHDDIE:1;
  unsigned CHSHIE:1;
  unsigned CHSDIE:1;
} __DCH7INTbits_t;*/
volatile __DCH7INTbits_t DCH7INTbits ;//__asm__ ("DCH7INT") ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH7INTCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH7INTSET ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH7INTINV ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH7SSA ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned CHSSA:32;
} __DCH7SSAbits_t;*/
volatile __DCH7SSAbits_t DCH7SSAbits ;//__asm__ ("DCH7SSA") ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH7SSACLR ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH7SSASET ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH7SSAINV ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH7DSA ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned CHDSA:32;
} __DCH7DSAbits_t;*/
volatile __DCH7DSAbits_t DCH7DSAbits ;//__asm__ ("DCH7DSA") ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH7DSACLR ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH7DSASET ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH7DSAINV ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH7SSIZ ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned CHSSIZ:16;
} __DCH7SSIZbits_t;*/
volatile __DCH7SSIZbits_t DCH7SSIZbits ;//__asm__ ("DCH7SSIZ") ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH7SSIZCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH7SSIZSET ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH7SSIZINV ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH7DSIZ ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned CHDSIZ:16;
} __DCH7DSIZbits_t;*/
volatile __DCH7DSIZbits_t DCH7DSIZbits ;//__asm__ ("DCH7DSIZ") ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH7DSIZCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH7DSIZSET ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH7DSIZINV ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH7SPTR ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned CHSPTR:16;
} __DCH7SPTRbits_t;*/
volatile __DCH7SPTRbits_t DCH7SPTRbits ;//__asm__ ("DCH7SPTR") ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH7SPTRCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH7SPTRSET ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH7SPTRINV ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH7DPTR ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned CHDPTR:16;
} __DCH7DPTRbits_t;*/
volatile __DCH7DPTRbits_t DCH7DPTRbits ;//__asm__ ("DCH7DPTR") ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH7DPTRCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH7DPTRSET ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH7DPTRINV ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH7CSIZ ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned CHCSIZ:16;
} __DCH7CSIZbits_t;*/
volatile __DCH7CSIZbits_t DCH7CSIZbits ;//__asm__ ("DCH7CSIZ") ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH7CSIZCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH7CSIZSET ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH7CSIZINV ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH7CPTR ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned CHCPTR:16;
} __DCH7CPTRbits_t;*/
volatile __DCH7CPTRbits_t DCH7CPTRbits ;//__asm__ ("DCH7CPTR") ;//__attribute__((section("sfrs")));
volatile unsigned int        DCS7CPTR ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned CHCPTR:16;
} __DCS7CPTRbits_t;*/
volatile __DCS7CPTRbits_t DCS7CPTRbits ;//__asm__ ("DCS7CPTR") ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH7CPTRCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        DCS7CPTRCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH7CPTRSET ;//__attribute__((section("sfrs")));
volatile unsigned int        DCS7CPTRSET ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH7CPTRINV ;//__attribute__((section("sfrs")));
volatile unsigned int        DCS7CPTRINV ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH7DAT ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned CHPDAT:16;
} __DCH7DATbits_t;*/
volatile __DCH7DATbits_t DCH7DATbits ;//__asm__ ("DCH7DAT") ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH7DATCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH7DATSET ;//__attribute__((section("sfrs")));
volatile unsigned int        DCH7DATINV ;//__attribute__((section("sfrs")));
volatile unsigned int        I2C1CON ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned SEN:1;
    unsigned RSEN:1;
    unsigned PEN:1;
    unsigned RCEN:1;
    unsigned ACKEN:1;
    unsigned ACKDT:1;
    unsigned STREN:1;
    unsigned GCEN:1;
    unsigned SMEN:1;
    unsigned DISSLW:1;
    unsigned A10M:1;
    unsigned STRICT:1;
    unsigned SCLREL:1;
    unsigned SIDL:1;
    unsigned :1;
    unsigned ON:1;
    unsigned DHEN:1;
    unsigned AHEN:1;
    unsigned SBCDE:1;
    unsigned SDAHT:1;
    unsigned BOEN:1;
    unsigned SCIE:1;
    unsigned PCIE:1;
  };
  struct {
    unsigned :11;
    unsigned IPMIEN:1;
    unsigned :1;
    unsigned I2CSIDL:1;
    unsigned :1;
    unsigned I2CEN:1;
  };
} __I2C1CONbits_t;*/
volatile __I2C1CONbits_t I2C1CONbits ;//__asm__ ("I2C1CON") ;//__attribute__((section("sfrs")));
volatile unsigned int        I2C1CONCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        I2C1CONSET ;//__attribute__((section("sfrs")));
volatile unsigned int        I2C1CONINV ;//__attribute__((section("sfrs")));
volatile unsigned int        I2C1STAT ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned TBF:1;
    unsigned RBF:1;
    unsigned R_W:1;
    unsigned S:1;
    unsigned P:1;
    unsigned D_A:1;
    unsigned I2COV:1;
    unsigned IWCOL:1;
    unsigned ADD10:1;
    unsigned GCSTAT:1;
    unsigned BCL:1;
    unsigned :2;
    unsigned ACKTIM:1;
    unsigned TRSTAT:1;
    unsigned ACKSTAT:1;
  };
  struct {
    unsigned :6;
    unsigned I2CPOV:1;
  };
} __I2C1STATbits_t;*/
