HomuraVehicle/homuraLib_v2/machine/device/p32mz2048efg100_forVC.c
volatile __I2C3STATbits_t I2C3STATbits ;//__asm__ ("I2C3STAT") ;//__attribute__((section("sfrs")));
volatile unsigned int        I2C3STATCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        I2C3STATSET ;//__attribute__((section("sfrs")));
volatile unsigned int        I2C3STATINV ;//__attribute__((section("sfrs")));
volatile unsigned int        I2C3ADD ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned I2CADD:10;
} __I2C3ADDbits_t;*/
volatile __I2C3ADDbits_t I2C3ADDbits ;//__asm__ ("I2C3ADD") ;//__attribute__((section("sfrs")));
volatile unsigned int        I2C3ADDCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        I2C3ADDSET ;//__attribute__((section("sfrs")));
volatile unsigned int        I2C3ADDINV ;//__attribute__((section("sfrs")));
volatile unsigned int        I2C3MSK ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned I2CMSK:10;
  };
  struct {
    unsigned AMSK:10;
  };
} __I2C3MSKbits_t;*/
volatile __I2C3MSKbits_t I2C3MSKbits ;//__asm__ ("I2C3MSK") ;//__attribute__((section("sfrs")));
volatile unsigned int        I2C3MSKCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        I2C3MSKSET ;//__attribute__((section("sfrs")));
volatile unsigned int        I2C3MSKINV ;//__attribute__((section("sfrs")));
volatile unsigned int        I2C3BRG ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned I2CBRG:16;
} __I2C3BRGbits_t;*/
volatile __I2C3BRGbits_t I2C3BRGbits ;//__asm__ ("I2C3BRG") ;//__attribute__((section("sfrs")));
volatile unsigned int        I2C3BRGCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        I2C3BRGSET ;//__attribute__((section("sfrs")));
volatile unsigned int        I2C3BRGINV ;//__attribute__((section("sfrs")));
volatile unsigned int        I2C3TRN ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned I2CTRN:8;
} __I2C3TRNbits_t;*/
volatile __I2C3TRNbits_t I2C3TRNbits ;//__asm__ ("I2C3TRN") ;//__attribute__((section("sfrs")));
volatile unsigned int        I2C3TRNCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        I2C3TRNSET ;//__attribute__((section("sfrs")));
volatile unsigned int        I2C3TRNINV ;//__attribute__((section("sfrs")));
volatile unsigned int        I2C3RCV ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned I2CRCV:8;
} __I2C3RCVbits_t;*/
volatile __I2C3RCVbits_t I2C3RCVbits ;//__asm__ ("I2C3RCV") ;//__attribute__((section("sfrs")));
volatile unsigned int        I2C3RCVCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        I2C3RCVSET ;//__attribute__((section("sfrs")));
volatile unsigned int        I2C3RCVINV ;//__attribute__((section("sfrs")));
volatile unsigned int        I2C4CON ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned SEN:1;
    unsigned RSEN:1;
    unsigned PEN:1;
    unsigned RCEN:1;
    unsigned ACKEN:1;
    unsigned ACKDT:1;
    unsigned STREN:1;
    unsigned GCEN:1;
    unsigned SMEN:1;
    unsigned DISSLW:1;
    unsigned A10M:1;
    unsigned STRICT:1;
    unsigned SCLREL:1;
    unsigned SIDL:1;
    unsigned :1;
    unsigned ON:1;
    unsigned DHEN:1;
    unsigned AHEN:1;
    unsigned SBCDE:1;
    unsigned SDAHT:1;
    unsigned BOEN:1;
    unsigned SCIE:1;
    unsigned PCIE:1;
  };
  struct {
    unsigned :11;
    unsigned IPMIEN:1;
    unsigned :1;
    unsigned I2CSIDL:1;
    unsigned :1;
    unsigned I2CEN:1;
  };
} __I2C4CONbits_t;*/
volatile __I2C4CONbits_t I2C4CONbits ;//__asm__ ("I2C4CON") ;//__attribute__((section("sfrs")));
volatile unsigned int        I2C4CONCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        I2C4CONSET ;//__attribute__((section("sfrs")));
volatile unsigned int        I2C4CONINV ;//__attribute__((section("sfrs")));
volatile unsigned int        I2C4STAT ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned TBF:1;
    unsigned RBF:1;
    unsigned R_W:1;
    unsigned S:1;
    unsigned P:1;
    unsigned D_A:1;
    unsigned I2COV:1;
    unsigned IWCOL:1;
    unsigned ADD10:1;
    unsigned GCSTAT:1;
    unsigned BCL:1;
    unsigned :2;
    unsigned ACKTIM:1;
    unsigned TRSTAT:1;
    unsigned ACKSTAT:1;
  };
  struct {
    unsigned :6;
    unsigned I2CPOV:1;
  };
} __I2C4STATbits_t;*/
volatile __I2C4STATbits_t I2C4STATbits ;//__asm__ ("I2C4STAT") ;//__attribute__((section("sfrs")));
volatile unsigned int        I2C4STATCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        I2C4STATSET ;//__attribute__((section("sfrs")));
volatile unsigned int        I2C4STATINV ;//__attribute__((section("sfrs")));
volatile unsigned int        I2C4ADD ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned I2CADD:10;
} __I2C4ADDbits_t;*/
volatile __I2C4ADDbits_t I2C4ADDbits ;//__asm__ ("I2C4ADD") ;//__attribute__((section("sfrs")));
volatile unsigned int        I2C4ADDCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        I2C4ADDSET ;//__attribute__((section("sfrs")));
volatile unsigned int        I2C4ADDINV ;//__attribute__((section("sfrs")));
volatile unsigned int        I2C4MSK ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned I2CMSK:10;
  };
  struct {
    unsigned AMSK:10;
  };
} __I2C4MSKbits_t;*/
volatile __I2C4MSKbits_t I2C4MSKbits ;//__asm__ ("I2C4MSK") ;//__attribute__((section("sfrs")));
volatile unsigned int        I2C4MSKCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        I2C4MSKSET ;//__attribute__((section("sfrs")));
volatile unsigned int        I2C4MSKINV ;//__attribute__((section("sfrs")));
volatile unsigned int        I2C4BRG ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned I2CBRG:16;
} __I2C4BRGbits_t;*/
volatile __I2C4BRGbits_t I2C4BRGbits ;//__asm__ ("I2C4BRG") ;//__attribute__((section("sfrs")));
volatile unsigned int        I2C4BRGCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        I2C4BRGSET ;//__attribute__((section("sfrs")));
volatile unsigned int        I2C4BRGINV ;//__attribute__((section("sfrs")));
volatile unsigned int        I2C4TRN ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned I2CTRN:8;
} __I2C4TRNbits_t;*/
