HomuraVehicle/homuraLib_v2/machine/device/p32mz2048efg100_forVC.c
volatile __SPI1CON2bits_t SPI1CON2bits ;//__asm__ ("SPI1CON2") ;//__attribute__((section("sfrs")));
volatile unsigned int        SPI1CON2CLR ;//__attribute__((section("sfrs")));
volatile unsigned int        SPI1CON2SET ;//__attribute__((section("sfrs")));
volatile unsigned int        SPI1CON2INV ;//__attribute__((section("sfrs")));
volatile unsigned int        SPI2CON ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned SRXISEL:2;
    unsigned STXISEL:2;
    unsigned DISSDI:1;
    unsigned MSTEN:1;
    unsigned CKP:1;
    unsigned SSEN:1;
    unsigned CKE:1;
    unsigned SMP:1;
    unsigned MODE16:1;
    unsigned MODE32:1;
    unsigned DISSDO:1;
    unsigned SIDL:1;
    unsigned :1;
    unsigned ON:1;
    unsigned ENHBUF:1;
    unsigned SPIFE:1;
    unsigned :5;
    unsigned MCLKSEL:1;
    unsigned FRMCNT:3;
    unsigned FRMSYPW:1;
    unsigned MSSEN:1;
    unsigned FRMPOL:1;
    unsigned FRMSYNC:1;
    unsigned FRMEN:1;
  };
  struct {
    unsigned w:32;
  };
} __SPI2CONbits_t;*/
volatile __SPI2CONbits_t SPI2CONbits ;//__asm__ ("SPI2CON") ;//__attribute__((section("sfrs")));
volatile unsigned int        SPI2CONCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        SPI2CONSET ;//__attribute__((section("sfrs")));
volatile unsigned int        SPI2CONINV ;//__attribute__((section("sfrs")));
volatile unsigned int        SPI2STAT ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned SPIRBF:1;
    unsigned SPITBF:1;
    unsigned :1;
    unsigned SPITBE:1;
    unsigned :1;
    unsigned SPIRBE:1;
    unsigned SPIROV:1;
    unsigned SRMT:1;
    unsigned SPITUR:1;
    unsigned :2;
    unsigned SPIBUSY:1;
    unsigned FRMERR:1;
    unsigned :3;
    unsigned TXBUFELM:5;
    unsigned :3;
    unsigned RXBUFELM:5;
  };
  struct {
    unsigned w:32;
  };
} __SPI2STATbits_t;*/
volatile __SPI2STATbits_t SPI2STATbits ;//__asm__ ("SPI2STAT") ;//__attribute__((section("sfrs")));
volatile unsigned int        SPI2STATCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        SPI2STATSET ;//__attribute__((section("sfrs")));
volatile unsigned int        SPI2STATINV ;//__attribute__((section("sfrs")));
volatile unsigned int        SPI2BUF ;//__attribute__((section("sfrs")));
volatile unsigned int        SPI2BRG ;//__attribute__((section("sfrs")));
volatile unsigned int        SPI2BRGCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        SPI2BRGSET ;//__attribute__((section("sfrs")));
volatile unsigned int        SPI2BRGINV ;//__attribute__((section("sfrs")));
volatile unsigned int        SPI2CON2 ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned AUDMOD:2;
    unsigned :1;
    unsigned AUDMONO:1;
    unsigned :3;
    unsigned AUDEN:1;
    unsigned IGNTUR:1;
    unsigned IGNROV:1;
    unsigned SPITUREN:1;
    unsigned SPIROVEN:1;
    unsigned FRMERREN:1;
    unsigned :2;
    unsigned SPISGNEXT:1;
  };
  struct {
    unsigned AUDMOD0:1;
    unsigned AUDMOD1:1;
  };
  struct {
    unsigned w:32;
  };
} __SPI2CON2bits_t;*/
volatile __SPI2CON2bits_t SPI2CON2bits ;//__asm__ ("SPI2CON2") ;//__attribute__((section("sfrs")));
volatile unsigned int        SPI2CON2CLR ;//__attribute__((section("sfrs")));
volatile unsigned int        SPI2CON2SET ;//__attribute__((section("sfrs")));
volatile unsigned int        SPI2CON2INV ;//__attribute__((section("sfrs")));
volatile unsigned int        SPI3CON ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned SRXISEL:2;
    unsigned STXISEL:2;
    unsigned DISSDI:1;
    unsigned MSTEN:1;
    unsigned CKP:1;
    unsigned SSEN:1;
    unsigned CKE:1;
    unsigned SMP:1;
    unsigned MODE16:1;
    unsigned MODE32:1;
    unsigned DISSDO:1;
    unsigned SIDL:1;
    unsigned :1;
    unsigned ON:1;
    unsigned ENHBUF:1;
    unsigned SPIFE:1;
    unsigned :5;
    unsigned MCLKSEL:1;
    unsigned FRMCNT:3;
    unsigned FRMSYPW:1;
    unsigned MSSEN:1;
    unsigned FRMPOL:1;
    unsigned FRMSYNC:1;
    unsigned FRMEN:1;
  };
  struct {
    unsigned w:32;
  };
} __SPI3CONbits_t;*/
volatile __SPI3CONbits_t SPI3CONbits ;//__asm__ ("SPI3CON") ;//__attribute__((section("sfrs")));
volatile unsigned int        SPI3CONCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        SPI3CONSET ;//__attribute__((section("sfrs")));
volatile unsigned int        SPI3CONINV ;//__attribute__((section("sfrs")));
volatile unsigned int        SPI3STAT ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned SPIRBF:1;
    unsigned SPITBF:1;
    unsigned :1;
    unsigned SPITBE:1;
    unsigned :1;
    unsigned SPIRBE:1;
    unsigned SPIROV:1;
    unsigned SRMT:1;
    unsigned SPITUR:1;
    unsigned :2;
    unsigned SPIBUSY:1;
    unsigned FRMERR:1;
    unsigned :3;
    unsigned TXBUFELM:5;
    unsigned :3;
    unsigned RXBUFELM:5;
  };
  struct {
    unsigned w:32;
  };
} __SPI3STATbits_t;*/
volatile __SPI3STATbits_t SPI3STATbits ;//__asm__ ("SPI3STAT") ;//__attribute__((section("sfrs")));
volatile unsigned int        SPI3STATCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        SPI3STATSET ;//__attribute__((section("sfrs")));
volatile unsigned int        SPI3STATINV ;//__attribute__((section("sfrs")));
volatile unsigned int        SPI3BUF ;//__attribute__((section("sfrs")));
volatile unsigned int        SPI3BRG ;//__attribute__((section("sfrs")));
volatile unsigned int        SPI3BRGCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        SPI3BRGSET ;//__attribute__((section("sfrs")));
volatile unsigned int        SPI3BRGINV ;//__attribute__((section("sfrs")));
volatile unsigned int        SPI3CON2 ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned AUDMOD:2;
    unsigned :1;
    unsigned AUDMONO:1;
    unsigned :3;
    unsigned AUDEN:1;
    unsigned IGNTUR:1;
    unsigned IGNROV:1;
    unsigned SPITUREN:1;
    unsigned SPIROVEN:1;
    unsigned FRMERREN:1;
    unsigned :2;
    unsigned SPISGNEXT:1;
  };
  struct {
    unsigned AUDMOD0:1;
    unsigned AUDMOD1:1;
  };
  struct {
    unsigned w:32;
  };
} __SPI3CON2bits_t;*/
