HomuraVehicle/homuraLib_v2/machine/device/p32mz2048efg100_forVC.c
volatile __U2MODEbits_t U2MODEbits ;//__asm__ ("U2MODE") ;//__attribute__((section("sfrs")));
volatile unsigned int        UCDMODE ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned STSEL:1;
    unsigned PDSEL:2;
    unsigned BRGH:1;
    unsigned RXINV:1;
    unsigned ABAUD:1;
    unsigned LPBACK:1;
    unsigned WAKE:1;
    unsigned UEN:2;
    unsigned :1;
    unsigned RTSMD:1;
    unsigned IREN:1;
    unsigned SIDL:1;
    unsigned :1;
    unsigned ON:1;
  };
  struct {
    unsigned :1;
    unsigned PDSEL0:1;
    unsigned PDSEL1:1;
    unsigned :5;
    unsigned UEN0:1;
    unsigned UEN1:1;
  };
  struct {
    unsigned :13;
    unsigned USIDL:1;
    unsigned :1;
    unsigned UARTEN:1;
  };
  struct {
    unsigned w:32;
  };
} __UCDMODEbits_t;*/
volatile __UCDMODEbits_t UCDMODEbits ;//__asm__ ("UCDMODE") ;//__attribute__((section("sfrs")));
volatile unsigned int        U2MODECLR ;//__attribute__((section("sfrs")));
volatile unsigned int        UCDMODECLR ;//__attribute__((section("sfrs")));
volatile unsigned int        U2MODESET ;//__attribute__((section("sfrs")));
volatile unsigned int        UCDMODESET ;//__attribute__((section("sfrs")));
volatile unsigned int        U2MODEINV ;//__attribute__((section("sfrs")));
volatile unsigned int        UCDMODEINV ;//__attribute__((section("sfrs")));
volatile unsigned int        U2STA ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned URXDA:1;
    unsigned OERR:1;
    unsigned FERR:1;
    unsigned PERR:1;
    unsigned RIDLE:1;
    unsigned ADDEN:1;
    unsigned URXISEL:2;
    unsigned TRMT:1;
    unsigned UTXBF:1;
    unsigned UTXEN:1;
    unsigned UTXBRK:1;
    unsigned URXEN:1;
    unsigned UTXINV:1;
    unsigned UTXISEL:2;
    unsigned ADDR:8;
    unsigned ADM_EN:1;
  };
  struct {
    unsigned :6;
    unsigned URXISEL0:1;
    unsigned URXISEL1:1;
    unsigned :6;
    unsigned UTXISEL0:1;
    unsigned UTXISEL1:1;
  };
  struct {
    unsigned :14;
    unsigned UTXSEL:2;
  };
  struct {
    unsigned w:32;
  };
} __U2STAbits_t;*/
volatile __U2STAbits_t U2STAbits ;//__asm__ ("U2STA") ;//__attribute__((section("sfrs")));
volatile unsigned int        UCDSTA ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned URXDA:1;
    unsigned OERR:1;
    unsigned FERR:1;
    unsigned PERR:1;
    unsigned RIDLE:1;
    unsigned ADDEN:1;
    unsigned URXISEL:2;
    unsigned TRMT:1;
    unsigned UTXBF:1;
    unsigned UTXEN:1;
    unsigned UTXBRK:1;
    unsigned URXEN:1;
    unsigned UTXINV:1;
    unsigned UTXISEL:2;
    unsigned ADDR:8;
    unsigned ADM_EN:1;
  };
  struct {
    unsigned :6;
    unsigned URXISEL0:1;
    unsigned URXISEL1:1;
    unsigned :6;
    unsigned UTXISEL0:1;
    unsigned UTXISEL1:1;
  };
  struct {
    unsigned :14;
    unsigned UTXSEL:2;
  };
  struct {
    unsigned w:32;
  };
} __UCDSTAbits_t;*/
volatile __UCDSTAbits_t UCDSTAbits ;//__asm__ ("UCDSTA") ;//__attribute__((section("sfrs")));
volatile unsigned int        U2STACLR ;//__attribute__((section("sfrs")));
volatile unsigned int        UCDSTACLR ;//__attribute__((section("sfrs")));
volatile unsigned int        U2STASET ;//__attribute__((section("sfrs")));
volatile unsigned int        UCDSTASET ;//__attribute__((section("sfrs")));
volatile unsigned int        U2STAINV ;//__attribute__((section("sfrs")));
volatile unsigned int        UCDSTAINV ;//__attribute__((section("sfrs")));
volatile unsigned int        U2TXREG ;//__attribute__((section("sfrs")));
volatile unsigned int        UCDTXREG ;//__attribute__((section("sfrs")));
volatile unsigned int        U2RXREG ;//__attribute__((section("sfrs")));
volatile unsigned int        UCDRXREG ;//__attribute__((section("sfrs")));
volatile unsigned int        U2BRG ;//__attribute__((section("sfrs")));
volatile unsigned int        UCDBRG ;//__attribute__((section("sfrs")));
volatile unsigned int        U2BRGCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        UCDBRGCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        U2BRGSET ;//__attribute__((section("sfrs")));
volatile unsigned int        UCDBRGSET ;//__attribute__((section("sfrs")));
volatile unsigned int        U2BRGINV ;//__attribute__((section("sfrs")));
volatile unsigned int        UCDBRGINV ;//__attribute__((section("sfrs")));
volatile unsigned int        U3MODE ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned STSEL:1;
    unsigned PDSEL:2;
    unsigned BRGH:1;
    unsigned RXINV:1;
    unsigned ABAUD:1;
    unsigned LPBACK:1;
    unsigned WAKE:1;
    unsigned UEN:2;
    unsigned :1;
    unsigned RTSMD:1;
    unsigned IREN:1;
    unsigned SIDL:1;
    unsigned :1;
    unsigned ON:1;
  };
  struct {
    unsigned :1;
    unsigned PDSEL0:1;
    unsigned PDSEL1:1;
    unsigned :5;
    unsigned UEN0:1;
    unsigned UEN1:1;
  };
  struct {
    unsigned :13;
    unsigned USIDL:1;
    unsigned :1;
    unsigned UARTEN:1;
  };
  struct {
    unsigned w:32;
  };
} __U3MODEbits_t;*/
volatile __U3MODEbits_t U3MODEbits ;//__asm__ ("U3MODE") ;//__attribute__((section("sfrs")));
volatile unsigned int        UEFMODE ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned STSEL:1;
    unsigned PDSEL:2;
    unsigned BRGH:1;
    unsigned RXINV:1;
    unsigned ABAUD:1;
    unsigned LPBACK:1;
    unsigned WAKE:1;
    unsigned UEN:2;
    unsigned :1;
    unsigned RTSMD:1;
    unsigned IREN:1;
    unsigned SIDL:1;
    unsigned :1;
    unsigned ON:1;
  };
  struct {
    unsigned :1;
    unsigned PDSEL0:1;
    unsigned PDSEL1:1;
    unsigned :5;
    unsigned UEN0:1;
    unsigned UEN1:1;
  };
  struct {
    unsigned :13;
    unsigned USIDL:1;
    unsigned :1;
    unsigned UARTEN:1;
  };
  struct {
    unsigned w:32;
  };
} __UEFMODEbits_t;*/
volatile __UEFMODEbits_t UEFMODEbits ;//__asm__ ("UEFMODE") ;//__attribute__((section("sfrs")));
volatile unsigned int        U3MODECLR ;//__attribute__((section("sfrs")));
volatile unsigned int        UEFMODECLR ;//__attribute__((section("sfrs")));
volatile unsigned int        U3MODESET ;//__attribute__((section("sfrs")));
volatile unsigned int        UEFMODESET ;//__attribute__((section("sfrs")));
volatile unsigned int        U3MODEINV ;//__attribute__((section("sfrs")));
volatile unsigned int        UEFMODEINV ;//__attribute__((section("sfrs")));
volatile unsigned int        U3STA ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned URXDA:1;
    unsigned OERR:1;
    unsigned FERR:1;
    unsigned PERR:1;
    unsigned RIDLE:1;
    unsigned ADDEN:1;
    unsigned URXISEL:2;
    unsigned TRMT:1;
    unsigned UTXBF:1;
    unsigned UTXEN:1;
    unsigned UTXBRK:1;
    unsigned URXEN:1;
    unsigned UTXINV:1;
    unsigned UTXISEL:2;
    unsigned ADDR:8;
    unsigned ADM_EN:1;
  };
  struct {
    unsigned :6;
    unsigned URXISEL0:1;
    unsigned URXISEL1:1;
    unsigned :6;
    unsigned UTXISEL0:1;
    unsigned UTXISEL1:1;
  };
  struct {
    unsigned :14;
    unsigned UTXSEL:2;
  };
  struct {
    unsigned w:32;
  };
} __U3STAbits_t;*/
volatile __U3STAbits_t U3STAbits ;//__asm__ ("U3STA") ;//__attribute__((section("sfrs")));
volatile unsigned int        UEFSTA ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned URXDA:1;
    unsigned OERR:1;
    unsigned FERR:1;
    unsigned PERR:1;
    unsigned RIDLE:1;
    unsigned ADDEN:1;
    unsigned URXISEL:2;
    unsigned TRMT:1;
    unsigned UTXBF:1;
    unsigned UTXEN:1;
    unsigned UTXBRK:1;
    unsigned URXEN:1;
    unsigned UTXINV:1;
    unsigned UTXISEL:2;
    unsigned ADDR:8;
    unsigned ADM_EN:1;
  };
  struct {
    unsigned :6;
    unsigned URXISEL0:1;
    unsigned URXISEL1:1;
    unsigned :6;
    unsigned UTXISEL0:1;
    unsigned UTXISEL1:1;
  };
  struct {
    unsigned :14;
    unsigned UTXSEL:2;
  };
  struct {
    unsigned w:32;
  };
} __UEFSTAbits_t;*/
volatile __UEFSTAbits_t UEFSTAbits ;//__asm__ ("UEFSTA") ;//__attribute__((section("sfrs")));
volatile unsigned int        U3STACLR ;//__attribute__((section("sfrs")));
volatile unsigned int        UEFSTACLR ;//__attribute__((section("sfrs")));
volatile unsigned int        U3STASET ;//__attribute__((section("sfrs")));
volatile unsigned int        UEFSTASET ;//__attribute__((section("sfrs")));
volatile unsigned int        U3STAINV ;//__attribute__((section("sfrs")));
volatile unsigned int        UEFSTAINV ;//__attribute__((section("sfrs")));
volatile unsigned int        U3TXREG ;//__attribute__((section("sfrs")));
volatile unsigned int        UEFTXREG ;//__attribute__((section("sfrs")));
volatile unsigned int        U3RXREG ;//__attribute__((section("sfrs")));
volatile unsigned int        UEFRXREG ;//__attribute__((section("sfrs")));
volatile unsigned int        U3BRG ;//__attribute__((section("sfrs")));
volatile unsigned int        UEFBRG ;//__attribute__((section("sfrs")));
volatile unsigned int        U3BRGCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        UEFBRGCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        U3BRGSET ;//__attribute__((section("sfrs")));
volatile unsigned int        UEFBRGSET ;//__attribute__((section("sfrs")));
volatile unsigned int        U3BRGINV ;//__attribute__((section("sfrs")));
volatile unsigned int        UEFBRGINV ;//__attribute__((section("sfrs")));
volatile unsigned int        U4MODE ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned STSEL:1;
    unsigned PDSEL:2;
    unsigned BRGH:1;
    unsigned RXINV:1;
    unsigned ABAUD:1;
    unsigned LPBACK:1;
    unsigned WAKE:1;
    unsigned UEN:2;
    unsigned :1;
    unsigned RTSMD:1;
    unsigned IREN:1;
    unsigned SIDL:1;
    unsigned :1;
    unsigned ON:1;
  };
  struct {
    unsigned :1;
    unsigned PDSEL0:1;
    unsigned PDSEL1:1;
    unsigned :5;
    unsigned UEN0:1;
    unsigned UEN1:1;
  };
  struct {
    unsigned :13;
    unsigned USIDL:1;
    unsigned :1;
    unsigned UARTEN:1;
  };
  struct {
    unsigned w:32;
  };
} __U4MODEbits_t;*/
volatile __U4MODEbits_t U4MODEbits ;//__asm__ ("U4MODE") ;//__attribute__((section("sfrs")));
volatile unsigned int        UGHMODE ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned STSEL:1;
    unsigned PDSEL:2;
    unsigned BRGH:1;
    unsigned RXINV:1;
    unsigned ABAUD:1;
    unsigned LPBACK:1;
    unsigned WAKE:1;
    unsigned UEN:2;
    unsigned :1;
    unsigned RTSMD:1;
    unsigned IREN:1;
    unsigned SIDL:1;
    unsigned :1;
    unsigned ON:1;
  };
  struct {
    unsigned :1;
    unsigned PDSEL0:1;
    unsigned PDSEL1:1;
    unsigned :5;
    unsigned UEN0:1;
    unsigned UEN1:1;
  };
  struct {
    unsigned :13;
    unsigned USIDL:1;
    unsigned :1;
    unsigned UARTEN:1;
  };
  struct {
    unsigned w:32;
  };
} __UGHMODEbits_t;*/
