HomuraVehicle/homuraLib_v2/machine/device/p32mz2048efg100_forVC.c
volatile __UGHMODEbits_t UGHMODEbits ;//__asm__ ("UGHMODE") ;//__attribute__((section("sfrs")));
volatile unsigned int        U4MODECLR ;//__attribute__((section("sfrs")));
volatile unsigned int        UGHMODECLR ;//__attribute__((section("sfrs")));
volatile unsigned int        U4MODESET ;//__attribute__((section("sfrs")));
volatile unsigned int        UGHMODESET ;//__attribute__((section("sfrs")));
volatile unsigned int        U4MODEINV ;//__attribute__((section("sfrs")));
volatile unsigned int        UGHMODEINV ;//__attribute__((section("sfrs")));
volatile unsigned int        U4STA ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned URXDA:1;
    unsigned OERR:1;
    unsigned FERR:1;
    unsigned PERR:1;
    unsigned RIDLE:1;
    unsigned ADDEN:1;
    unsigned URXISEL:2;
    unsigned TRMT:1;
    unsigned UTXBF:1;
    unsigned UTXEN:1;
    unsigned UTXBRK:1;
    unsigned URXEN:1;
    unsigned UTXINV:1;
    unsigned UTXISEL:2;
    unsigned ADDR:8;
    unsigned ADM_EN:1;
  };
  struct {
    unsigned :6;
    unsigned URXISEL0:1;
    unsigned URXISEL1:1;
    unsigned :6;
    unsigned UTXISEL0:1;
    unsigned UTXISEL1:1;
  };
  struct {
    unsigned :14;
    unsigned UTXSEL:2;
  };
  struct {
    unsigned w:32;
  };
} __U4STAbits_t;*/
volatile __U4STAbits_t U4STAbits ;//__asm__ ("U4STA") ;//__attribute__((section("sfrs")));
volatile unsigned int        UGHSTA ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned URXDA:1;
    unsigned OERR:1;
    unsigned FERR:1;
    unsigned PERR:1;
    unsigned RIDLE:1;
    unsigned ADDEN:1;
    unsigned URXISEL:2;
    unsigned TRMT:1;
    unsigned UTXBF:1;
    unsigned UTXEN:1;
    unsigned UTXBRK:1;
    unsigned URXEN:1;
    unsigned UTXINV:1;
    unsigned UTXISEL:2;
    unsigned ADDR:8;
    unsigned ADM_EN:1;
  };
  struct {
    unsigned :6;
    unsigned URXISEL0:1;
    unsigned URXISEL1:1;
    unsigned :6;
    unsigned UTXISEL0:1;
    unsigned UTXISEL1:1;
  };
  struct {
    unsigned :14;
    unsigned UTXSEL:2;
  };
  struct {
    unsigned w:32;
  };
} __UGHSTAbits_t;*/
volatile __UGHSTAbits_t UGHSTAbits ;//__asm__ ("UGHSTA") ;//__attribute__((section("sfrs")));
volatile unsigned int        U4STACLR ;//__attribute__((section("sfrs")));
volatile unsigned int        UGHSTACLR ;//__attribute__((section("sfrs")));
volatile unsigned int        U4STASET ;//__attribute__((section("sfrs")));
volatile unsigned int        UGHSTASET ;//__attribute__((section("sfrs")));
volatile unsigned int        U4STAINV ;//__attribute__((section("sfrs")));
volatile unsigned int        UGHSTAINV ;//__attribute__((section("sfrs")));
volatile unsigned int        U4TXREG ;//__attribute__((section("sfrs")));
volatile unsigned int        UGHTXREG ;//__attribute__((section("sfrs")));
volatile unsigned int        U4RXREG ;//__attribute__((section("sfrs")));
volatile unsigned int        UGHRXREG ;//__attribute__((section("sfrs")));
volatile unsigned int        U4BRG ;//__attribute__((section("sfrs")));
volatile unsigned int        UGHBRG ;//__attribute__((section("sfrs")));
volatile unsigned int        U4BRGCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        UGHBRGCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        U4BRGSET ;//__attribute__((section("sfrs")));
volatile unsigned int        UGHBRGSET ;//__attribute__((section("sfrs")));
volatile unsigned int        U4BRGINV ;//__attribute__((section("sfrs")));
volatile unsigned int        UGHBRGINV ;//__attribute__((section("sfrs")));
volatile unsigned int        U5MODE ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned STSEL:1;
    unsigned PDSEL:2;
    unsigned BRGH:1;
    unsigned RXINV:1;
    unsigned ABAUD:1;
    unsigned LPBACK:1;
    unsigned WAKE:1;
    unsigned UEN:2;
    unsigned :1;
    unsigned RTSMD:1;
    unsigned IREN:1;
    unsigned SIDL:1;
    unsigned :1;
    unsigned ON:1;
  };
  struct {
    unsigned :1;
    unsigned PDSEL0:1;
    unsigned PDSEL1:1;
    unsigned :5;
    unsigned UEN0:1;
    unsigned UEN1:1;
  };
  struct {
    unsigned :13;
    unsigned USIDL:1;
    unsigned :1;
    unsigned UARTEN:1;
  };
  struct {
    unsigned w:32;
  };
} __U5MODEbits_t;*/
volatile __U5MODEbits_t U5MODEbits ;//__asm__ ("U5MODE") ;//__attribute__((section("sfrs")));
volatile unsigned int        UJKMODE ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned STSEL:1;
    unsigned PDSEL:2;
    unsigned BRGH:1;
    unsigned RXINV:1;
    unsigned ABAUD:1;
    unsigned LPBACK:1;
    unsigned WAKE:1;
    unsigned UEN:2;
    unsigned :1;
    unsigned RTSMD:1;
    unsigned IREN:1;
    unsigned SIDL:1;
    unsigned :1;
    unsigned ON:1;
  };
  struct {
    unsigned :1;
    unsigned PDSEL0:1;
    unsigned PDSEL1:1;
    unsigned :5;
    unsigned UEN0:1;
    unsigned UEN1:1;
  };
  struct {
    unsigned :13;
    unsigned USIDL:1;
    unsigned :1;
    unsigned UARTEN:1;
  };
  struct {
    unsigned w:32;
  };
} __UJKMODEbits_t;*/
volatile __UJKMODEbits_t UJKMODEbits ;//__asm__ ("UJKMODE") ;//__attribute__((section("sfrs")));
volatile unsigned int        U5MODECLR ;//__attribute__((section("sfrs")));
volatile unsigned int        UJKMODECLR ;//__attribute__((section("sfrs")));
volatile unsigned int        U5MODESET ;//__attribute__((section("sfrs")));
volatile unsigned int        UJKMODESET ;//__attribute__((section("sfrs")));
volatile unsigned int        U5MODEINV ;//__attribute__((section("sfrs")));
volatile unsigned int        UJKMODEINV ;//__attribute__((section("sfrs")));
volatile unsigned int        U5STA ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned URXDA:1;
    unsigned OERR:1;
    unsigned FERR:1;
    unsigned PERR:1;
    unsigned RIDLE:1;
    unsigned ADDEN:1;
    unsigned URXISEL:2;
    unsigned TRMT:1;
    unsigned UTXBF:1;
    unsigned UTXEN:1;
    unsigned UTXBRK:1;
    unsigned URXEN:1;
    unsigned UTXINV:1;
    unsigned UTXISEL:2;
    unsigned ADDR:8;
    unsigned ADM_EN:1;
  };
  struct {
    unsigned :6;
    unsigned URXISEL0:1;
    unsigned URXISEL1:1;
    unsigned :6;
    unsigned UTXISEL0:1;
    unsigned UTXISEL1:1;
  };
  struct {
    unsigned :14;
    unsigned UTXSEL:2;
  };
  struct {
    unsigned w:32;
  };
} __U5STAbits_t;*/
volatile __U5STAbits_t U5STAbits ;//__asm__ ("U5STA") ;//__attribute__((section("sfrs")));
volatile unsigned int        UJKSTA ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned URXDA:1;
    unsigned OERR:1;
    unsigned FERR:1;
    unsigned PERR:1;
    unsigned RIDLE:1;
    unsigned ADDEN:1;
    unsigned URXISEL:2;
    unsigned TRMT:1;
    unsigned UTXBF:1;
    unsigned UTXEN:1;
    unsigned UTXBRK:1;
    unsigned URXEN:1;
    unsigned UTXINV:1;
    unsigned UTXISEL:2;
    unsigned ADDR:8;
    unsigned ADM_EN:1;
  };
  struct {
    unsigned :6;
    unsigned URXISEL0:1;
    unsigned URXISEL1:1;
    unsigned :6;
    unsigned UTXISEL0:1;
    unsigned UTXISEL1:1;
  };
  struct {
    unsigned :14;
    unsigned UTXSEL:2;
  };
  struct {
    unsigned w:32;
  };
} __UJKSTAbits_t;*/
volatile __UJKSTAbits_t UJKSTAbits ;//__asm__ ("UJKSTA") ;//__attribute__((section("sfrs")));
volatile unsigned int        U5STACLR ;//__attribute__((section("sfrs")));
volatile unsigned int        UJKSTACLR ;//__attribute__((section("sfrs")));
volatile unsigned int        U5STASET ;//__attribute__((section("sfrs")));
volatile unsigned int        UJKSTASET ;//__attribute__((section("sfrs")));
volatile unsigned int        U5STAINV ;//__attribute__((section("sfrs")));
volatile unsigned int        UJKSTAINV ;//__attribute__((section("sfrs")));
volatile unsigned int        U5TXREG ;//__attribute__((section("sfrs")));
volatile unsigned int        UJKTXREG ;//__attribute__((section("sfrs")));
volatile unsigned int        U5RXREG ;//__attribute__((section("sfrs")));
volatile unsigned int        UJKRXREG ;//__attribute__((section("sfrs")));
volatile unsigned int        U5BRG ;//__attribute__((section("sfrs")));
volatile unsigned int        UJKBRG ;//__attribute__((section("sfrs")));
volatile unsigned int        U5BRGCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        UJKBRGCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        U5BRGSET ;//__attribute__((section("sfrs")));
volatile unsigned int        UJKBRGSET ;//__attribute__((section("sfrs")));
volatile unsigned int        U5BRGINV ;//__attribute__((section("sfrs")));
volatile unsigned int        UJKBRGINV ;//__attribute__((section("sfrs")));
volatile unsigned int        U6MODE ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned STSEL:1;
    unsigned PDSEL:2;
    unsigned BRGH:1;
    unsigned RXINV:1;
    unsigned ABAUD:1;
    unsigned LPBACK:1;
    unsigned WAKE:1;
    unsigned UEN:2;
    unsigned :1;
    unsigned RTSMD:1;
    unsigned IREN:1;
    unsigned SIDL:1;
    unsigned :1;
    unsigned ON:1;
  };
  struct {
    unsigned :1;
    unsigned PDSEL0:1;
    unsigned PDSEL1:1;
    unsigned :5;
    unsigned UEN0:1;
    unsigned UEN1:1;
  };
  struct {
    unsigned :13;
    unsigned USIDL:1;
    unsigned :1;
    unsigned UARTEN:1;
  };
  struct {
    unsigned w:32;
  };
} __U6MODEbits_t;*/
