HomuraVehicle/homuraLib_v2/machine/device/p32mz2048efg100_forVC.c
volatile __U6MODEbits_t U6MODEbits ;//__asm__ ("U6MODE") ;//__attribute__((section("sfrs")));
volatile unsigned int        ULMMODE ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned STSEL:1;
    unsigned PDSEL:2;
    unsigned BRGH:1;
    unsigned RXINV:1;
    unsigned ABAUD:1;
    unsigned LPBACK:1;
    unsigned WAKE:1;
    unsigned UEN:2;
    unsigned :1;
    unsigned RTSMD:1;
    unsigned IREN:1;
    unsigned SIDL:1;
    unsigned :1;
    unsigned ON:1;
  };
  struct {
    unsigned :1;
    unsigned PDSEL0:1;
    unsigned PDSEL1:1;
    unsigned :5;
    unsigned UEN0:1;
    unsigned UEN1:1;
  };
  struct {
    unsigned :13;
    unsigned USIDL:1;
    unsigned :1;
    unsigned UARTEN:1;
  };
  struct {
    unsigned w:32;
  };
} __ULMMODEbits_t;*/
volatile __ULMMODEbits_t ULMMODEbits ;//__asm__ ("ULMMODE") ;//__attribute__((section("sfrs")));
volatile unsigned int        U6MODECLR ;//__attribute__((section("sfrs")));
volatile unsigned int        ULMMODECLR ;//__attribute__((section("sfrs")));
volatile unsigned int        U6MODESET ;//__attribute__((section("sfrs")));
volatile unsigned int        ULMMODESET ;//__attribute__((section("sfrs")));
volatile unsigned int        U6MODEINV ;//__attribute__((section("sfrs")));
volatile unsigned int        ULMMODEINV ;//__attribute__((section("sfrs")));
volatile unsigned int        U6STA ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned URXDA:1;
    unsigned OERR:1;
    unsigned FERR:1;
    unsigned PERR:1;
    unsigned RIDLE:1;
    unsigned ADDEN:1;
    unsigned URXISEL:2;
    unsigned TRMT:1;
    unsigned UTXBF:1;
    unsigned UTXEN:1;
    unsigned UTXBRK:1;
    unsigned URXEN:1;
    unsigned UTXINV:1;
    unsigned UTXISEL:2;
    unsigned ADDR:8;
    unsigned ADM_EN:1;
  };
  struct {
    unsigned :6;
    unsigned URXISEL0:1;
    unsigned URXISEL1:1;
    unsigned :6;
    unsigned UTXISEL0:1;
    unsigned UTXISEL1:1;
  };
  struct {
    unsigned :14;
    unsigned UTXSEL:2;
  };
  struct {
    unsigned w:32;
  };
} __U6STAbits_t;*/
volatile __U6STAbits_t U6STAbits ;//__asm__ ("U6STA") ;//__attribute__((section("sfrs")));
volatile unsigned int        ULMSTA ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned URXDA:1;
    unsigned OERR:1;
    unsigned FERR:1;
    unsigned PERR:1;
    unsigned RIDLE:1;
    unsigned ADDEN:1;
    unsigned URXISEL:2;
    unsigned TRMT:1;
    unsigned UTXBF:1;
    unsigned UTXEN:1;
    unsigned UTXBRK:1;
    unsigned URXEN:1;
    unsigned UTXINV:1;
    unsigned UTXISEL:2;
    unsigned ADDR:8;
    unsigned ADM_EN:1;
  };
  struct {
    unsigned :6;
    unsigned URXISEL0:1;
    unsigned URXISEL1:1;
    unsigned :6;
    unsigned UTXISEL0:1;
    unsigned UTXISEL1:1;
  };
  struct {
    unsigned :14;
    unsigned UTXSEL:2;
  };
  struct {
    unsigned w:32;
  };
} __ULMSTAbits_t;*/
volatile __ULMSTAbits_t ULMSTAbits ;//__asm__ ("ULMSTA") ;//__attribute__((section("sfrs")));
volatile unsigned int        U6STACLR ;//__attribute__((section("sfrs")));
volatile unsigned int        ULMSTACLR ;//__attribute__((section("sfrs")));
volatile unsigned int        U6STASET ;//__attribute__((section("sfrs")));
volatile unsigned int        ULMSTASET ;//__attribute__((section("sfrs")));
volatile unsigned int        U6STAINV ;//__attribute__((section("sfrs")));
volatile unsigned int        ULMSTAINV ;//__attribute__((section("sfrs")));
volatile unsigned int        U6TXREG ;//__attribute__((section("sfrs")));
volatile unsigned int        ULMTXREG ;//__attribute__((section("sfrs")));
volatile unsigned int        U6RXREG ;//__attribute__((section("sfrs")));
volatile unsigned int        ULMRXREG ;//__attribute__((section("sfrs")));
volatile unsigned int        U6BRG ;//__attribute__((section("sfrs")));
volatile unsigned int        ULMBRG ;//__attribute__((section("sfrs")));
volatile unsigned int        U6BRGCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        ULMBRGCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        U6BRGSET ;//__attribute__((section("sfrs")));
volatile unsigned int        ULMBRGSET ;//__attribute__((section("sfrs")));
volatile unsigned int        U6BRGINV ;//__attribute__((section("sfrs")));
volatile unsigned int        ULMBRGINV ;//__attribute__((section("sfrs")));
volatile unsigned int        PMCON ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned RDSP:1;
    unsigned WRSP:1;
    unsigned :1;
    unsigned CS1P:1;
    unsigned CS2P:1;
    unsigned ALP:1;
    unsigned CSF:2;
    unsigned PTRDEN:1;
    unsigned PTWREN:1;
    unsigned PMPTTL:1;
    unsigned ADRMUX:2;
    unsigned SIDL:1;
    unsigned :1;
    unsigned ON:1;
    unsigned :1;
    unsigned DUALBUF:1;
    unsigned :5;
    unsigned RDSTART:1;
  };
  struct {
    unsigned :6;
    unsigned CSF0:1;
    unsigned CSF1:1;
    unsigned :3;
    unsigned ADRMUX0:1;
    unsigned ADRMUX1:1;
  };
  struct {
    unsigned :13;
    unsigned PSIDL:1;
    unsigned :1;
    unsigned PMPEN:1;
  };
  struct {
    unsigned w:32;
  };
} __PMCONbits_t;*/
volatile __PMCONbits_t PMCONbits ;//__asm__ ("PMCON") ;//__attribute__((section("sfrs")));
volatile unsigned int        PMCONCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        PMCONSET ;//__attribute__((section("sfrs")));
volatile unsigned int        PMCONINV ;//__attribute__((section("sfrs")));
volatile unsigned int        PMMODE ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned WAITE:2;
    unsigned WAITM:4;
    unsigned WAITB:2;
    unsigned MODE:2;
    unsigned MODE16:1;
    unsigned INCM:2;
    unsigned IRQM:2;
    unsigned BUSY:1;
  };
  struct {
    unsigned WAITE0:1;
    unsigned WAITE1:1;
    unsigned WAITM0:1;
    unsigned WAITM1:1;
    unsigned WAITM2:1;
    unsigned WAITM3:1;
    unsigned WAITB0:1;
    unsigned WAITB1:1;
    unsigned MODE0:1;
    unsigned MODE1:1;
    unsigned :1;
    unsigned INCM0:1;
    unsigned INCM1:1;
    unsigned IRQM0:1;
    unsigned IRQM1:1;
  };
  struct {
    unsigned w:32;
  };
} __PMMODEbits_t;*/
volatile __PMMODEbits_t PMMODEbits ;//__asm__ ("PMMODE") ;//__attribute__((section("sfrs")));
volatile unsigned int        PMMODECLR ;//__attribute__((section("sfrs")));
volatile unsigned int        PMMODESET ;//__attribute__((section("sfrs")));
volatile unsigned int        PMMODEINV ;//__attribute__((section("sfrs")));
volatile unsigned int        PMADDR ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned ADDR:14;
    unsigned ADDR14:1;
    unsigned ADDR15:1;
  };
  struct {
    unsigned :14;
    unsigned CS:2;
  };
  struct {
    unsigned :14;
    unsigned CS1:1;
    unsigned CS2:1;
  };
  struct {
    unsigned w:32;
  };
} __PMADDRbits_t;*/
