HomuraVehicle/homuraLib_v2/machine/device/p32mz2048efg100_forVC.c
volatile __T3CONbits_t T3CONbits ;//__asm__ ("T3CON") ;//__attribute__((section("sfrs")));
volatile unsigned int        T3CONCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        T3CONSET ;//__attribute__((section("sfrs")));
volatile unsigned int        T3CONINV ;//__attribute__((section("sfrs")));
volatile unsigned int        TMR3 ;//__attribute__((section("sfrs")));
volatile unsigned int        TMR3CLR ;//__attribute__((section("sfrs")));
volatile unsigned int        TMR3SET ;//__attribute__((section("sfrs")));
volatile unsigned int        TMR3INV ;//__attribute__((section("sfrs")));
volatile unsigned int        PR3 ;//__attribute__((section("sfrs")));
volatile unsigned int        PR3CLR ;//__attribute__((section("sfrs")));
volatile unsigned int        PR3SET ;//__attribute__((section("sfrs")));
volatile unsigned int        PR3INV ;//__attribute__((section("sfrs")));
volatile unsigned int        T4CON ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned :1;
    unsigned TCS:1;
    unsigned :1;
    unsigned T32:1;
    unsigned TCKPS:3;
    unsigned TGATE:1;
    unsigned :5;
    unsigned SIDL:1;
    unsigned :1;
    unsigned ON:1;
  };
  struct {
    unsigned :4;
    unsigned TCKPS0:1;
    unsigned TCKPS1:1;
    unsigned TCKPS2:1;
  };
  struct {
    unsigned :13;
    unsigned TSIDL:1;
    unsigned :1;
    unsigned TON:1;
  };
  struct {
    unsigned w:32;
  };
} __T4CONbits_t;*/
volatile __T4CONbits_t T4CONbits ;//__asm__ ("T4CON") ;//__attribute__((section("sfrs")));
volatile unsigned int        T4CONCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        T4CONSET ;//__attribute__((section("sfrs")));
volatile unsigned int        T4CONINV ;//__attribute__((section("sfrs")));
volatile unsigned int        TMR4 ;//__attribute__((section("sfrs")));
volatile unsigned int        TMR4CLR ;//__attribute__((section("sfrs")));
volatile unsigned int        TMR4SET ;//__attribute__((section("sfrs")));
volatile unsigned int        TMR4INV ;//__attribute__((section("sfrs")));
volatile unsigned int        PR4 ;//__attribute__((section("sfrs")));
volatile unsigned int        PR4CLR ;//__attribute__((section("sfrs")));
volatile unsigned int        PR4SET ;//__attribute__((section("sfrs")));
volatile unsigned int        PR4INV ;//__attribute__((section("sfrs")));
volatile unsigned int        T5CON ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned :1;
    unsigned TCS:1;
    unsigned :2;
    unsigned TCKPS:3;
    unsigned TGATE:1;
    unsigned :5;
    unsigned SIDL:1;
    unsigned :1;
    unsigned ON:1;
  };
  struct {
    unsigned :4;
    unsigned TCKPS0:1;
    unsigned TCKPS1:1;
    unsigned TCKPS2:1;
  };
  struct {
    unsigned :13;
    unsigned TSIDL:1;
    unsigned :1;
    unsigned TON:1;
  };
  struct {
    unsigned w:32;
  };
} __T5CONbits_t;*/
volatile __T5CONbits_t T5CONbits ;//__asm__ ("T5CON") ;//__attribute__((section("sfrs")));
volatile unsigned int        T5CONCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        T5CONSET ;//__attribute__((section("sfrs")));
volatile unsigned int        T5CONINV ;//__attribute__((section("sfrs")));
volatile unsigned int        TMR5 ;//__attribute__((section("sfrs")));
volatile unsigned int        TMR5CLR ;//__attribute__((section("sfrs")));
volatile unsigned int        TMR5SET ;//__attribute__((section("sfrs")));
volatile unsigned int        TMR5INV ;//__attribute__((section("sfrs")));
volatile unsigned int        PR5 ;//__attribute__((section("sfrs")));
volatile unsigned int        PR5CLR ;//__attribute__((section("sfrs")));
volatile unsigned int        PR5SET ;//__attribute__((section("sfrs")));
volatile unsigned int        PR5INV ;//__attribute__((section("sfrs")));
volatile unsigned int        T6CON ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned :1;
    unsigned TCS:1;
    unsigned :1;
    unsigned T32:1;
    unsigned TCKPS:3;
    unsigned TGATE:1;
    unsigned :5;
    unsigned SIDL:1;
    unsigned :1;
    unsigned ON:1;
  };
  struct {
    unsigned :4;
    unsigned TCKPS0:1;
    unsigned TCKPS1:1;
    unsigned TCKPS2:1;
  };
  struct {
    unsigned :13;
    unsigned TSIDL:1;
    unsigned :1;
    unsigned TON:1;
  };
  struct {
    unsigned w:32;
  };
} __T6CONbits_t;*/
volatile __T6CONbits_t T6CONbits ;//__asm__ ("T6CON") ;//__attribute__((section("sfrs")));
volatile unsigned int        T6CONCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        T6CONSET ;//__attribute__((section("sfrs")));
volatile unsigned int        T6CONINV ;//__attribute__((section("sfrs")));
volatile unsigned int        TMR6 ;//__attribute__((section("sfrs")));
volatile unsigned int        TMR6CLR ;//__attribute__((section("sfrs")));
volatile unsigned int        TMR6SET ;//__attribute__((section("sfrs")));
volatile unsigned int        TMR6INV ;//__attribute__((section("sfrs")));
volatile unsigned int        PR6 ;//__attribute__((section("sfrs")));
volatile unsigned int        PR6CLR ;//__attribute__((section("sfrs")));
volatile unsigned int        PR6SET ;//__attribute__((section("sfrs")));
volatile unsigned int        PR6INV ;//__attribute__((section("sfrs")));
volatile unsigned int        T7CON ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned :1;
    unsigned TCS:1;
    unsigned :2;
    unsigned TCKPS:3;
    unsigned TGATE:1;
    unsigned :5;
    unsigned SIDL:1;
    unsigned :1;
    unsigned ON:1;
  };
  struct {
    unsigned :4;
    unsigned TCKPS0:1;
    unsigned TCKPS1:1;
    unsigned TCKPS2:1;
  };
  struct {
    unsigned :13;
    unsigned TSIDL:1;
    unsigned :1;
    unsigned TON:1;
  };
  struct {
    unsigned w:32;
  };
} __T7CONbits_t;*/
volatile __T7CONbits_t T7CONbits ;//__asm__ ("T7CON") ;//__attribute__((section("sfrs")));
volatile unsigned int        T7CONCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        T7CONSET ;//__attribute__((section("sfrs")));
volatile unsigned int        T7CONINV ;//__attribute__((section("sfrs")));
volatile unsigned int        TMR7 ;//__attribute__((section("sfrs")));
volatile unsigned int        TMR7CLR ;//__attribute__((section("sfrs")));
volatile unsigned int        TMR7SET ;//__attribute__((section("sfrs")));
volatile unsigned int        TMR7INV ;//__attribute__((section("sfrs")));
volatile unsigned int        PR7 ;//__attribute__((section("sfrs")));
volatile unsigned int        PR7CLR ;//__attribute__((section("sfrs")));
volatile unsigned int        PR7SET ;//__attribute__((section("sfrs")));
volatile unsigned int        PR7INV ;//__attribute__((section("sfrs")));
volatile unsigned int        T8CON ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned :1;
    unsigned TCS:1;
    unsigned :1;
    unsigned T32:1;
    unsigned TCKPS:3;
    unsigned TGATE:1;
    unsigned :5;
    unsigned SIDL:1;
    unsigned :1;
    unsigned ON:1;
  };
  struct {
    unsigned :4;
    unsigned TCKPS0:1;
    unsigned TCKPS1:1;
    unsigned TCKPS2:1;
  };
  struct {
    unsigned :13;
    unsigned TSIDL:1;
    unsigned :1;
    unsigned TON:1;
  };
  struct {
    unsigned w:32;
  };
} __T8CONbits_t;*/
volatile __T8CONbits_t T8CONbits ;//__asm__ ("T8CON") ;//__attribute__((section("sfrs")));
volatile unsigned int        T8CONCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        T8CONSET ;//__attribute__((section("sfrs")));
volatile unsigned int        T8CONINV ;//__attribute__((section("sfrs")));
volatile unsigned int        TMR8 ;//__attribute__((section("sfrs")));
volatile unsigned int        TMR8CLR ;//__attribute__((section("sfrs")));
volatile unsigned int        TMR8SET ;//__attribute__((section("sfrs")));
volatile unsigned int        TMR8INV ;//__attribute__((section("sfrs")));
volatile unsigned int        PR8 ;//__attribute__((section("sfrs")));
volatile unsigned int        PR8CLR ;//__attribute__((section("sfrs")));
volatile unsigned int        PR8SET ;//__attribute__((section("sfrs")));
volatile unsigned int        PR8INV ;//__attribute__((section("sfrs")));
volatile unsigned int        T9CON ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned :1;
    unsigned TCS:1;
    unsigned :2;
    unsigned TCKPS:3;
    unsigned TGATE:1;
    unsigned :5;
    unsigned SIDL:1;
    unsigned :1;
    unsigned ON:1;
  };
  struct {
    unsigned :4;
    unsigned TCKPS0:1;
    unsigned TCKPS1:1;
    unsigned TCKPS2:1;
  };
  struct {
    unsigned :13;
    unsigned TSIDL:1;
    unsigned :1;
    unsigned TON:1;
  };
  struct {
    unsigned w:32;
  };
} __T9CONbits_t;*/
volatile __T9CONbits_t T9CONbits ;//__asm__ ("T9CON") ;//__attribute__((section("sfrs")));
volatile unsigned int        T9CONCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        T9CONSET ;//__attribute__((section("sfrs")));
volatile unsigned int        T9CONINV ;//__attribute__((section("sfrs")));
volatile unsigned int        TMR9 ;//__attribute__((section("sfrs")));
volatile unsigned int        TMR9CLR ;//__attribute__((section("sfrs")));
volatile unsigned int        TMR9SET ;//__attribute__((section("sfrs")));
volatile unsigned int        TMR9INV ;//__attribute__((section("sfrs")));
volatile unsigned int        PR9 ;//__attribute__((section("sfrs")));
volatile unsigned int        PR9CLR ;//__attribute__((section("sfrs")));
volatile unsigned int        PR9SET ;//__attribute__((section("sfrs")));
volatile unsigned int        PR9INV ;//__attribute__((section("sfrs")));
volatile unsigned int        IC1CON ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned ICM:3;
    unsigned ICBNE:1;
    unsigned ICOV:1;
    unsigned ICI:2;
    unsigned ICTMR:1;
    unsigned C32:1;
    unsigned FEDGE:1;
    unsigned :3;
    unsigned SIDL:1;
    unsigned :1;
    unsigned ON:1;
  };
  struct {
    unsigned ICM0:1;
    unsigned ICM1:1;
    unsigned ICM2:1;
    unsigned :2;
    unsigned ICI0:1;
    unsigned ICI1:1;
  };
  struct {
    unsigned :13;
    unsigned ICSIDL:1;
  };
  struct {
    unsigned w:32;
  };
} __IC1CONbits_t;*/
volatile __IC1CONbits_t IC1CONbits ;//__asm__ ("IC1CON") ;//__attribute__((section("sfrs")));
volatile unsigned int        IC1CONCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        IC1CONSET ;//__attribute__((section("sfrs")));
volatile unsigned int        IC1CONINV ;//__attribute__((section("sfrs")));
volatile unsigned int        IC1BUF ;//__attribute__((section("sfrs")));
volatile unsigned int        IC2CON ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned ICM:3;
    unsigned ICBNE:1;
    unsigned ICOV:1;
    unsigned ICI:2;
    unsigned ICTMR:1;
    unsigned C32:1;
    unsigned FEDGE:1;
    unsigned :3;
    unsigned SIDL:1;
    unsigned :1;
    unsigned ON:1;
  };
  struct {
    unsigned ICM0:1;
    unsigned ICM1:1;
    unsigned ICM2:1;
    unsigned :2;
    unsigned ICI0:1;
    unsigned ICI1:1;
  };
  struct {
    unsigned :13;
    unsigned ICSIDL:1;
  };
  struct {
    unsigned w:32;
  };
} __IC2CONbits_t;*/
volatile __IC2CONbits_t IC2CONbits ;//__asm__ ("IC2CON") ;//__attribute__((section("sfrs")));
volatile unsigned int        IC2CONCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        IC2CONSET ;//__attribute__((section("sfrs")));
volatile unsigned int        IC2CONINV ;//__attribute__((section("sfrs")));
volatile unsigned int        IC2BUF ;//__attribute__((section("sfrs")));
volatile unsigned int        IC3CON ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned ICM:3;
    unsigned ICBNE:1;
    unsigned ICOV:1;
    unsigned ICI:2;
    unsigned ICTMR:1;
    unsigned C32:1;
    unsigned FEDGE:1;
    unsigned :3;
    unsigned SIDL:1;
    unsigned :1;
    unsigned ON:1;
  };
  struct {
    unsigned ICM0:1;
    unsigned ICM1:1;
    unsigned ICM2:1;
    unsigned :2;
    unsigned ICI0:1;
    unsigned ICI1:1;
  };
  struct {
    unsigned :13;
    unsigned ICSIDL:1;
  };
  struct {
    unsigned w:32;
  };
} __IC3CONbits_t;*/
