HomuraVehicle/homuraLib_v2/machine/device/p32mz2048efg100_forVC.c
volatile __OC3CONbits_t OC3CONbits ;//__asm__ ("OC3CON") ;//__attribute__((section("sfrs")));
volatile unsigned int        OC3CONCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        OC3CONSET ;//__attribute__((section("sfrs")));
volatile unsigned int        OC3CONINV ;//__attribute__((section("sfrs")));
volatile unsigned int        OC3R ;//__attribute__((section("sfrs")));
volatile unsigned int        OC3RCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        OC3RSET ;//__attribute__((section("sfrs")));
volatile unsigned int        OC3RINV ;//__attribute__((section("sfrs")));
volatile unsigned int        OC3RS ;//__attribute__((section("sfrs")));
volatile unsigned int        OC3RSCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        OC3RSSET ;//__attribute__((section("sfrs")));
volatile unsigned int        OC3RSINV ;//__attribute__((section("sfrs")));
volatile unsigned int        OC4CON ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned OCM:3;
    unsigned OCTSEL:1;
    unsigned OCFLT:1;
    unsigned OC32:1;
    unsigned :7;
    unsigned SIDL:1;
    unsigned :1;
    unsigned ON:1;
  };
  struct {
    unsigned OCM0:1;
    unsigned OCM1:1;
    unsigned OCM2:1;
  };
  struct {
    unsigned :13;
    unsigned OCSIDL:1;
  };
  struct {
    unsigned w:32;
  };
} __OC4CONbits_t;*/
volatile __OC4CONbits_t OC4CONbits ;//__asm__ ("OC4CON") ;//__attribute__((section("sfrs")));
volatile unsigned int        OC4CONCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        OC4CONSET ;//__attribute__((section("sfrs")));
volatile unsigned int        OC4CONINV ;//__attribute__((section("sfrs")));
volatile unsigned int        OC4R ;//__attribute__((section("sfrs")));
volatile unsigned int        OC4RCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        OC4RSET ;//__attribute__((section("sfrs")));
volatile unsigned int        OC4RINV ;//__attribute__((section("sfrs")));
volatile unsigned int        OC4RS ;//__attribute__((section("sfrs")));
volatile unsigned int        OC4RSCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        OC4RSSET ;//__attribute__((section("sfrs")));
volatile unsigned int        OC4RSINV ;//__attribute__((section("sfrs")));
volatile unsigned int        OC5CON ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned OCM:3;
    unsigned OCTSEL:1;
    unsigned OCFLT:1;
    unsigned OC32:1;
    unsigned :7;
    unsigned SIDL:1;
    unsigned :1;
    unsigned ON:1;
  };
  struct {
    unsigned OCM0:1;
    unsigned OCM1:1;
    unsigned OCM2:1;
  };
  struct {
    unsigned :13;
    unsigned OCSIDL:1;
  };
  struct {
    unsigned w:32;
  };
} __OC5CONbits_t;*/
volatile __OC5CONbits_t OC5CONbits ;//__asm__ ("OC5CON") ;//__attribute__((section("sfrs")));
volatile unsigned int        OC5CONCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        OC5CONSET ;//__attribute__((section("sfrs")));
volatile unsigned int        OC5CONINV ;//__attribute__((section("sfrs")));
volatile unsigned int        OC5R ;//__attribute__((section("sfrs")));
volatile unsigned int        OC5RCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        OC5RSET ;//__attribute__((section("sfrs")));
volatile unsigned int        OC5RINV ;//__attribute__((section("sfrs")));
volatile unsigned int        OC5RS ;//__attribute__((section("sfrs")));
volatile unsigned int        OC5RSCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        OC5RSSET ;//__attribute__((section("sfrs")));
volatile unsigned int        OC5RSINV ;//__attribute__((section("sfrs")));
volatile unsigned int        OC6CON ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned OCM:3;
    unsigned OCTSEL:1;
    unsigned OCFLT:1;
    unsigned OC32:1;
    unsigned :7;
    unsigned SIDL:1;
    unsigned :1;
    unsigned ON:1;
  };
  struct {
    unsigned OCM0:1;
    unsigned OCM1:1;
    unsigned OCM2:1;
  };
  struct {
    unsigned :13;
    unsigned OCSIDL:1;
  };
  struct {
    unsigned w:32;
  };
} __OC6CONbits_t;*/
volatile __OC6CONbits_t OC6CONbits ;//__asm__ ("OC6CON") ;//__attribute__((section("sfrs")));
volatile unsigned int        OC6CONCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        OC6CONSET ;//__attribute__((section("sfrs")));
volatile unsigned int        OC6CONINV ;//__attribute__((section("sfrs")));
volatile unsigned int        OC6R ;//__attribute__((section("sfrs")));
volatile unsigned int        OC6RCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        OC6RSET ;//__attribute__((section("sfrs")));
volatile unsigned int        OC6RINV ;//__attribute__((section("sfrs")));
volatile unsigned int        OC6RS ;//__attribute__((section("sfrs")));
volatile unsigned int        OC6RSCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        OC6RSSET ;//__attribute__((section("sfrs")));
volatile unsigned int        OC6RSINV ;//__attribute__((section("sfrs")));
volatile unsigned int        OC7CON ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned OCM:3;
    unsigned OCTSEL:1;
    unsigned OCFLT:1;
    unsigned OC32:1;
    unsigned :7;
    unsigned SIDL:1;
    unsigned :1;
    unsigned ON:1;
  };
  struct {
    unsigned OCM0:1;
    unsigned OCM1:1;
    unsigned OCM2:1;
  };
  struct {
    unsigned :13;
    unsigned OCSIDL:1;
  };
  struct {
    unsigned w:32;
  };
} __OC7CONbits_t;*/
volatile __OC7CONbits_t OC7CONbits ;//__asm__ ("OC7CON") ;//__attribute__((section("sfrs")));
volatile unsigned int        OC7CONCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        OC7CONSET ;//__attribute__((section("sfrs")));
volatile unsigned int        OC7CONINV ;//__attribute__((section("sfrs")));
volatile unsigned int        OC7R ;//__attribute__((section("sfrs")));
volatile unsigned int        OC7RCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        OC7RSET ;//__attribute__((section("sfrs")));
volatile unsigned int        OC7RINV ;//__attribute__((section("sfrs")));
volatile unsigned int        OC7RS ;//__attribute__((section("sfrs")));
volatile unsigned int        OC7RSCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        OC7RSSET ;//__attribute__((section("sfrs")));
volatile unsigned int        OC7RSINV ;//__attribute__((section("sfrs")));
volatile unsigned int        OC8CON ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned OCM:3;
    unsigned OCTSEL:1;
    unsigned OCFLT:1;
    unsigned OC32:1;
    unsigned :7;
    unsigned SIDL:1;
    unsigned :1;
    unsigned ON:1;
  };
  struct {
    unsigned OCM0:1;
    unsigned OCM1:1;
    unsigned OCM2:1;
  };
  struct {
    unsigned :13;
    unsigned OCSIDL:1;
  };
  struct {
    unsigned w:32;
  };
} __OC8CONbits_t;*/
volatile __OC8CONbits_t OC8CONbits ;//__asm__ ("OC8CON") ;//__attribute__((section("sfrs")));
volatile unsigned int        OC8CONCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        OC8CONSET ;//__attribute__((section("sfrs")));
volatile unsigned int        OC8CONINV ;//__attribute__((section("sfrs")));
volatile unsigned int        OC8R ;//__attribute__((section("sfrs")));
volatile unsigned int        OC8RCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        OC8RSET ;//__attribute__((section("sfrs")));
volatile unsigned int        OC8RINV ;//__attribute__((section("sfrs")));
volatile unsigned int        OC8RS ;//__attribute__((section("sfrs")));
volatile unsigned int        OC8RSCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        OC8RSSET ;//__attribute__((section("sfrs")));
volatile unsigned int        OC8RSINV ;//__attribute__((section("sfrs")));
volatile unsigned int        OC9CON ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned OCM:3;
    unsigned OCTSEL:1;
    unsigned OCFLT:1;
    unsigned OC32:1;
    unsigned :7;
    unsigned SIDL:1;
    unsigned :1;
    unsigned ON:1;
  };
  struct {
    unsigned OCM0:1;
    unsigned OCM1:1;
    unsigned OCM2:1;
  };
  struct {
    unsigned :13;
    unsigned OCSIDL:1;
  };
  struct {
    unsigned w:32;
  };
} __OC9CONbits_t;*/
