HomuraVehicle/homuraLib_v2/machine/device/p32mz2048efg100_forVC.c
volatile __ADCCMPEN4bits_t ADCCMPEN4bits ;//__asm__ ("ADCCMPEN4") ;//__attribute__((section("sfrs")));
volatile unsigned int        ADCCMP4 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned DCMPLO:16;
  unsigned DCMPHI:16;
} __ADCCMP4bits_t;*/
volatile __ADCCMP4bits_t ADCCMP4bits ;//__asm__ ("ADCCMP4") ;//__attribute__((section("sfrs")));
volatile unsigned int        ADCCMPEN5 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned CMPE0:1;
  unsigned CMPE1:1;
  unsigned CMPE2:1;
  unsigned CMPE3:1;
  unsigned CMPE4:1;
  unsigned CMPE5:1;
  unsigned CMPE6:1;
  unsigned CMPE7:1;
  unsigned CMPE8:1;
  unsigned CMPE9:1;
  unsigned CMPE10:1;
  unsigned CMPE11:1;
  unsigned CMPE12:1;
  unsigned CMPE13:1;
  unsigned CMPE14:1;
  unsigned CMPE15:1;
  unsigned CMPE16:1;
  unsigned CMPE17:1;
  unsigned CMPE18:1;
  unsigned CMPE19:1;
  unsigned CMPE20:1;
  unsigned CMPE21:1;
  unsigned CMPE22:1;
  unsigned CMPE23:1;
  unsigned CMPE24:1;
  unsigned CMPE25:1;
  unsigned CMPE26:1;
  unsigned CMPE27:1;
  unsigned CMPE28:1;
  unsigned CMPE29:1;
  unsigned CMPE30:1;
  unsigned CMPE31:1;
} __ADCCMPEN5bits_t;*/
volatile __ADCCMPEN5bits_t ADCCMPEN5bits ;//__asm__ ("ADCCMPEN5") ;//__attribute__((section("sfrs")));
volatile unsigned int        ADCCMP5 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned DCMPLO:16;
  unsigned DCMPHI:16;
} __ADCCMP5bits_t;*/
volatile __ADCCMP5bits_t ADCCMP5bits ;//__asm__ ("ADCCMP5") ;//__attribute__((section("sfrs")));
volatile unsigned int        ADCCMPEN6 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned CMPE0:1;
  unsigned CMPE1:1;
  unsigned CMPE2:1;
  unsigned CMPE3:1;
  unsigned CMPE4:1;
  unsigned CMPE5:1;
  unsigned CMPE6:1;
  unsigned CMPE7:1;
  unsigned CMPE8:1;
  unsigned CMPE9:1;
  unsigned CMPE10:1;
  unsigned CMPE11:1;
  unsigned CMPE12:1;
  unsigned CMPE13:1;
  unsigned CMPE14:1;
  unsigned CMPE15:1;
  unsigned CMPE16:1;
  unsigned CMPE17:1;
  unsigned CMPE18:1;
  unsigned CMPE19:1;
  unsigned CMPE20:1;
  unsigned CMPE21:1;
  unsigned CMPE22:1;
  unsigned CMPE23:1;
  unsigned CMPE24:1;
  unsigned CMPE25:1;
  unsigned CMPE26:1;
  unsigned CMPE27:1;
  unsigned CMPE28:1;
  unsigned CMPE29:1;
  unsigned CMPE30:1;
  unsigned CMPE31:1;
} __ADCCMPEN6bits_t;*/
volatile __ADCCMPEN6bits_t ADCCMPEN6bits ;//__asm__ ("ADCCMPEN6") ;//__attribute__((section("sfrs")));
volatile unsigned int        ADCCMP6 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned DCMPLO:16;
  unsigned DCMPHI:16;
} __ADCCMP6bits_t;*/
volatile __ADCCMP6bits_t ADCCMP6bits ;//__asm__ ("ADCCMP6") ;//__attribute__((section("sfrs")));
volatile unsigned int        ADCFLTR1 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned FLTRDATA:16;
  unsigned CHNLID:5;
  unsigned :3;
  unsigned AFRDY:1;
  unsigned AFGIEN:1;
  unsigned OVRSAM:3;
  unsigned DFMODE:1;
  unsigned DATA16EN:1;
  unsigned AFEN:1;
} __ADCFLTR1bits_t;*/
volatile __ADCFLTR1bits_t ADCFLTR1bits ;//__asm__ ("ADCFLTR1") ;//__attribute__((section("sfrs")));
volatile unsigned int        ADCFLTR2 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned FLTRDATA:16;
  unsigned CHNLID:5;
  unsigned :3;
  unsigned AFRDY:1;
  unsigned AFGIEN:1;
  unsigned OVRSAM:3;
  unsigned DFMODE:1;
  unsigned DATA16EN:1;
  unsigned AFEN:1;
} __ADCFLTR2bits_t;*/
volatile __ADCFLTR2bits_t ADCFLTR2bits ;//__asm__ ("ADCFLTR2") ;//__attribute__((section("sfrs")));
volatile unsigned int        ADCFLTR3 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned FLTRDATA:16;
  unsigned CHNLID:5;
  unsigned :3;
  unsigned AFRDY:1;
  unsigned AFGIEN:1;
  unsigned OVRSAM:3;
  unsigned DFMODE:1;
  unsigned DATA16EN:1;
  unsigned AFEN:1;
} __ADCFLTR3bits_t;*/
volatile __ADCFLTR3bits_t ADCFLTR3bits ;//__asm__ ("ADCFLTR3") ;//__attribute__((section("sfrs")));
volatile unsigned int        ADCFLTR4 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned FLTRDATA:16;
  unsigned CHNLID:5;
  unsigned :3;
  unsigned AFRDY:1;
  unsigned AFGIEN:1;
  unsigned OVRSAM:3;
  unsigned DFMODE:1;
  unsigned DATA16EN:1;
  unsigned AFEN:1;
} __ADCFLTR4bits_t;*/
volatile __ADCFLTR4bits_t ADCFLTR4bits ;//__asm__ ("ADCFLTR4") ;//__attribute__((section("sfrs")));
volatile unsigned int        ADCFLTR5 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned FLTRDATA:16;
  unsigned CHNLID:5;
  unsigned :3;
  unsigned AFRDY:1;
  unsigned AFGIEN:1;
  unsigned OVRSAM:3;
  unsigned DFMODE:1;
  unsigned DATA16EN:1;
  unsigned AFEN:1;
} __ADCFLTR5bits_t;*/
volatile __ADCFLTR5bits_t ADCFLTR5bits ;//__asm__ ("ADCFLTR5") ;//__attribute__((section("sfrs")));
volatile unsigned int        ADCFLTR6 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned FLTRDATA:16;
  unsigned CHNLID:5;
  unsigned :3;
  unsigned AFRDY:1;
  unsigned AFGIEN:1;
  unsigned OVRSAM:3;
  unsigned DFMODE:1;
  unsigned DATA16EN:1;
  unsigned AFEN:1;
} __ADCFLTR6bits_t;*/
volatile __ADCFLTR6bits_t ADCFLTR6bits ;//__asm__ ("ADCFLTR6") ;//__attribute__((section("sfrs")));
volatile unsigned int        ADCTRG1 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned TRGSRC0:5;
  unsigned :3;
  unsigned TRGSRC1:5;
  unsigned :3;
  unsigned TRGSRC2:5;
  unsigned :3;
  unsigned TRGSRC3:5;
} __ADCTRG1bits_t;*/
volatile __ADCTRG1bits_t ADCTRG1bits ;//__asm__ ("ADCTRG1") ;//__attribute__((section("sfrs")));
volatile unsigned int        ADCTRG2 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned TRGSRC4:5;
  unsigned :3;
  unsigned TRGSRC5:5;
  unsigned :3;
  unsigned TRGSRC6:5;
  unsigned :3;
  unsigned TRGSRC7:5;
} __ADCTRG2bits_t;*/
volatile __ADCTRG2bits_t ADCTRG2bits ;//__asm__ ("ADCTRG2") ;//__attribute__((section("sfrs")));
volatile unsigned int        ADCTRG3 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned TRGSRC8:5;
  unsigned :3;
  unsigned TRGSRC9:5;
  unsigned :3;
  unsigned TRGSRC10:5;
  unsigned :3;
  unsigned TRGSRC11:5;
} __ADCTRG3bits_t;*/
volatile __ADCTRG3bits_t ADCTRG3bits ;//__asm__ ("ADCTRG3") ;//__attribute__((section("sfrs")));
volatile unsigned int        ADCCMPCON1 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned IELOLO:1;
  unsigned IELOHI:1;
  unsigned IEHILO:1;
  unsigned IEHIHI:1;
  unsigned IEBTWN:1;
  unsigned DCMPED:1;
  unsigned DCMPGIEN:1;
  unsigned ENDCMP:1;
  unsigned AINID:6;
  unsigned :2;
  unsigned CVDDATA:16;
} __ADCCMPCON1bits_t;*/
volatile __ADCCMPCON1bits_t ADCCMPCON1bits ;//__asm__ ("ADCCMPCON1") ;//__attribute__((section("sfrs")));
volatile unsigned int        ADCCMPCON2 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned IELOLO:1;
  unsigned IELOHI:1;
  unsigned IEHILO:1;
  unsigned IEHIHI:1;
  unsigned IEBTWN:1;
  unsigned DCMPED:1;
  unsigned DCMPGIEN:1;
  unsigned ENDCMP:1;
  unsigned AINID:5;
} __ADCCMPCON2bits_t;*/
volatile __ADCCMPCON2bits_t ADCCMPCON2bits ;//__asm__ ("ADCCMPCON2") ;//__attribute__((section("sfrs")));
volatile unsigned int        ADCCMPCON3 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned IELOLO:1;
  unsigned IELOHI:1;
  unsigned IEHILO:1;
  unsigned IEHIHI:1;
  unsigned IEBTWN:1;
  unsigned DCMPED:1;
  unsigned DCMPGIEN:1;
  unsigned ENDCMP:1;
  unsigned AINID:5;
} __ADCCMPCON3bits_t;*/
volatile __ADCCMPCON3bits_t ADCCMPCON3bits ;//__asm__ ("ADCCMPCON3") ;//__attribute__((section("sfrs")));
volatile unsigned int        ADCCMPCON4 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned IELOLO:1;
  unsigned IELOHI:1;
  unsigned IEHILO:1;
  unsigned IEHIHI:1;
  unsigned IEBTWN:1;
  unsigned DCMPED:1;
  unsigned DCMPGIEN:1;
  unsigned ENDCMP:1;
  unsigned AINID:5;
} __ADCCMPCON4bits_t;*/
volatile __ADCCMPCON4bits_t ADCCMPCON4bits ;//__asm__ ("ADCCMPCON4") ;//__attribute__((section("sfrs")));
volatile unsigned int        ADCCMPCON5 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned IELOLO:1;
  unsigned IELOHI:1;
  unsigned IEHILO:1;
  unsigned IEHIHI:1;
  unsigned IEBTWN:1;
  unsigned DCMPED:1;
  unsigned DCMPGIEN:1;
  unsigned ENDCMP:1;
  unsigned AINID:5;
} __ADCCMPCON5bits_t;*/
volatile __ADCCMPCON5bits_t ADCCMPCON5bits ;//__asm__ ("ADCCMPCON5") ;//__attribute__((section("sfrs")));
volatile unsigned int        ADCCMPCON6 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned IELOLO:1;
  unsigned IELOHI:1;
  unsigned IEHILO:1;
  unsigned IEHIHI:1;
  unsigned IEBTWN:1;
  unsigned DCMPED:1;
  unsigned DCMPGIEN:1;
  unsigned ENDCMP:1;
  unsigned AINID:5;
} __ADCCMPCON6bits_t;*/
