HomuraVehicle/homuraLib_v2/machine/device/p32mz2048efg100_forVC.c
volatile __ADCCMPCON6bits_t ADCCMPCON6bits ;//__asm__ ("ADCCMPCON6") ;//__attribute__((section("sfrs")));
volatile unsigned int        ADCBASE ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned ADCBASE:16;
} __ADCBASEbits_t;*/
volatile __ADCBASEbits_t ADCBASEbits ;//__asm__ ("ADCBASE") ;//__attribute__((section("sfrs")));
volatile unsigned int        ADCTRGSNS ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned LVL0:1;
  unsigned LVL1:1;
  unsigned LVL2:1;
  unsigned LVL3:1;
  unsigned LVL4:1;
  unsigned LVL5:1;
  unsigned LVL6:1;
  unsigned LVL7:1;
  unsigned LVL8:1;
  unsigned LVL9:1;
  unsigned LVL10:1;
  unsigned LVL11:1;
} __ADCTRGSNSbits_t;*/
volatile __ADCTRGSNSbits_t ADCTRGSNSbits ;//__asm__ ("ADCTRGSNS") ;//__attribute__((section("sfrs")));
volatile unsigned int        ADC0TIME ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned SAMC:10;
  unsigned :6;
  unsigned ADCDIV:7;
  unsigned :1;
  unsigned SELRES:2;
  unsigned ADCEIS:3;
} __ADC0TIMEbits_t;*/
volatile __ADC0TIMEbits_t ADC0TIMEbits ;//__asm__ ("ADC0TIME") ;//__attribute__((section("sfrs")));
volatile unsigned int        ADC1TIME ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned SAMC:10;
  unsigned :6;
  unsigned ADCDIV:7;
  unsigned :1;
  unsigned SELRES:2;
  unsigned ADCEIS:3;
} __ADC1TIMEbits_t;*/
volatile __ADC1TIMEbits_t ADC1TIMEbits ;//__asm__ ("ADC1TIME") ;//__attribute__((section("sfrs")));
volatile unsigned int        ADC2TIME ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned SAMC:10;
  unsigned :6;
  unsigned ADCDIV:7;
  unsigned :1;
  unsigned SELRES:2;
  unsigned ADCEIS:3;
} __ADC2TIMEbits_t;*/
volatile __ADC2TIMEbits_t ADC2TIMEbits ;//__asm__ ("ADC2TIME") ;//__attribute__((section("sfrs")));
volatile unsigned int        ADC3TIME ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned SAMC:10;
  unsigned :6;
  unsigned ADCDIV:7;
  unsigned :1;
  unsigned SELRES:2;
  unsigned ADCEIS:3;
} __ADC3TIMEbits_t;*/
volatile __ADC3TIMEbits_t ADC3TIMEbits ;//__asm__ ("ADC3TIME") ;//__attribute__((section("sfrs")));
volatile unsigned int        ADC4TIME ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned SAMC:10;
  unsigned :6;
  unsigned ADCDIV:7;
  unsigned :1;
  unsigned SELRES:2;
  unsigned ADCEIS:3;
} __ADC4TIMEbits_t;*/
volatile __ADC4TIMEbits_t ADC4TIMEbits ;//__asm__ ("ADC4TIME") ;//__attribute__((section("sfrs")));
volatile unsigned int        ADCEIEN1 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned EIEN0:1;
  unsigned EIEN1:1;
  unsigned EIEN2:1;
  unsigned EIEN3:1;
  unsigned EIEN4:1;
  unsigned EIEN5:1;
  unsigned EIEN6:1;
  unsigned EIEN7:1;
  unsigned EIEN8:1;
  unsigned EIEN9:1;
  unsigned EIEN10:1;
  unsigned EIEN11:1;
  unsigned EIEN12:1;
  unsigned EIEN13:1;
  unsigned EIEN14:1;
  unsigned EIEN15:1;
  unsigned EIEN16:1;
  unsigned EIEN17:1;
  unsigned EIEN18:1;
  unsigned EIEN19:1;
  unsigned EIEN20:1;
  unsigned EIEN21:1;
  unsigned EIEN22:1;
  unsigned EIEN23:1;
  unsigned EIEN24:1;
  unsigned EIEN25:1;
  unsigned EIEN26:1;
  unsigned EIEN27:1;
  unsigned EIEN28:1;
  unsigned EIEN29:1;
  unsigned EIEN30:1;
  unsigned EIEN31:1;
} __ADCEIEN1bits_t;*/
volatile __ADCEIEN1bits_t ADCEIEN1bits ;//__asm__ ("ADCEIEN1") ;//__attribute__((section("sfrs")));
volatile unsigned int        ADCEIEN2 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned EIEN32:1;
  unsigned EIEN33:1;
  unsigned EIEN34:1;
  unsigned EIEN35:1;
  unsigned EIEN36:1;
  unsigned EIEN37:1;
  unsigned EIEN38:1;
  unsigned EIEN39:1;
  unsigned EIEN40:1;
  unsigned EIEN41:1;
  unsigned EIEN42:1;
  unsigned EIEN43:1;
  unsigned EIEN44:1;
} __ADCEIEN2bits_t;*/
volatile __ADCEIEN2bits_t ADCEIEN2bits ;//__asm__ ("ADCEIEN2") ;//__attribute__((section("sfrs")));
volatile unsigned int        ADCEISTAT1 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned EIRDY0:1;
  unsigned EIRDY1:1;
  unsigned EIRDY2:1;
  unsigned EIRDY3:1;
  unsigned EIRDY4:1;
  unsigned EIRDY5:1;
  unsigned EIRDY6:1;
  unsigned EIRDY7:1;
  unsigned EIRDY8:1;
  unsigned EIRDY9:1;
  unsigned EIRDY10:1;
  unsigned EIRDY11:1;
  unsigned EIRDY12:1;
  unsigned EIRDY13:1;
  unsigned EIRDY14:1;
  unsigned EIRDY15:1;
  unsigned EIRDY16:1;
  unsigned EIRDY17:1;
  unsigned EIRDY18:1;
  unsigned EIRDY19:1;
  unsigned EIRDY20:1;
  unsigned EIRDY21:1;
  unsigned EIRDY22:1;
  unsigned EIRDY23:1;
  unsigned EIRDY24:1;
  unsigned EIRDY25:1;
  unsigned EIRDY26:1;
  unsigned EIRDY27:1;
  unsigned EIRDY28:1;
  unsigned EIRDY29:1;
  unsigned EIRDY30:1;
  unsigned EIRDY31:1;
} __ADCEISTAT1bits_t;*/
volatile __ADCEISTAT1bits_t ADCEISTAT1bits ;//__asm__ ("ADCEISTAT1") ;//__attribute__((section("sfrs")));
volatile unsigned int        ADCEISTAT2 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned EIRDY32:1;
  unsigned EIRDY33:1;
  unsigned EIRDY34:1;
  unsigned EIRDY35:1;
  unsigned EIRDY36:1;
  unsigned EIRDY37:1;
  unsigned EIRDY38:1;
  unsigned EIRDY39:1;
  unsigned EIRDY40:1;
  unsigned EIRDY41:1;
  unsigned EIRDY42:1;
  unsigned EIRDY43:1;
  unsigned EIRDY44:1;
} __ADCEISTAT2bits_t;*/
volatile __ADCEISTAT2bits_t ADCEISTAT2bits ;//__asm__ ("ADCEISTAT2") ;//__attribute__((section("sfrs")));
volatile unsigned int        ADCANCON ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned ANEN0:1;
  unsigned ANEN1:1;
  unsigned ANEN2:1;
  unsigned ANEN3:1;
  unsigned ANEN4:1;
  unsigned :2;
  unsigned ANEN7:1;
  unsigned WKRDY0:1;
  unsigned WKRDY1:1;
  unsigned WKRDY2:1;
  unsigned WKRDY3:1;
  unsigned WKRDY4:1;
  unsigned :2;
  unsigned WKRDY7:1;
  unsigned WKIEN0:1;
  unsigned WKIEN1:1;
  unsigned WKIEN2:1;
  unsigned WKIEN3:1;
  unsigned WKIEN4:1;
  unsigned :2;
  unsigned WKIEN7:1;
  unsigned WKUPCLKCNT:4;
} __ADCANCONbits_t;*/
volatile __ADCANCONbits_t ADCANCONbits ;//__asm__ ("ADCANCON") ;//__attribute__((section("sfrs")));
volatile unsigned int        ADC0CFG ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned ADCCFG:32;
} __ADC0CFGbits_t;*/
volatile __ADC0CFGbits_t ADC0CFGbits ;//__asm__ ("ADC0CFG") ;//__attribute__((section("sfrs")));
volatile unsigned int        ADC1CFG ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned ADCCFG:32;
} __ADC1CFGbits_t;*/
volatile __ADC1CFGbits_t ADC1CFGbits ;//__asm__ ("ADC1CFG") ;//__attribute__((section("sfrs")));
volatile unsigned int        ADC2CFG ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned ADCCFG:32;
} __ADC2CFGbits_t;*/
volatile __ADC2CFGbits_t ADC2CFGbits ;//__asm__ ("ADC2CFG") ;//__attribute__((section("sfrs")));
volatile unsigned int        ADC3CFG ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned ADCCFG:32;
} __ADC3CFGbits_t;*/
volatile __ADC3CFGbits_t ADC3CFGbits ;//__asm__ ("ADC3CFG") ;//__attribute__((section("sfrs")));
volatile unsigned int        ADC4CFG ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned ADCCFG:32;
} __ADC4CFGbits_t;*/
volatile __ADC4CFGbits_t ADC4CFGbits ;//__asm__ ("ADC4CFG") ;//__attribute__((section("sfrs")));
volatile unsigned int        ADC7CFG ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned ADCCFG:32;
} __ADC7CFGbits_t;*/
