HomuraVehicle/homuraLib_v2/machine/device/p32mz2048efg100_forVC.c
volatile __ADC7CFGbits_t ADC7CFGbits ;//__asm__ ("ADC7CFG") ;//__attribute__((section("sfrs")));
volatile unsigned int        ADCSYSCFG0 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned AN0:1;
  unsigned AN1:1;
  unsigned AN2:1;
  unsigned AN3:1;
  unsigned AN4:1;
  unsigned AN5:1;
  unsigned AN6:1;
  unsigned AN7:1;
  unsigned AN8:1;
  unsigned AN9:1;
  unsigned AN10:1;
  unsigned AN11:1;
  unsigned AN12:1;
  unsigned AN13:1;
  unsigned AN14:1;
  unsigned AN15:1;
  unsigned AN16:1;
  unsigned AN17:1;
  unsigned AN18:1;
  unsigned AN19:1;
  unsigned AN20:1;
  unsigned AN21:1;
  unsigned AN22:1;
  unsigned AN23:1;
  unsigned AN24:1;
  unsigned AN25:1;
  unsigned AN26:1;
  unsigned AN27:1;
  unsigned AN28:1;
  unsigned AN29:1;
  unsigned AN30:1;
  unsigned AN31:1;
} __ADCSYSCFG0bits_t;*/
volatile __ADCSYSCFG0bits_t ADCSYSCFG0bits ;//__asm__ ("ADCSYSCFG0") ;//__attribute__((section("sfrs")));
volatile unsigned int        ADCSYSCFG1 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned AN32:1;
  unsigned AN33:1;
  unsigned AN34:1;
  unsigned AN35:1;
  unsigned AN36:1;
  unsigned AN37:1;
  unsigned AN38:1;
  unsigned AN39:1;
  unsigned AN40:1;
  unsigned AN41:1;
  unsigned AN42:1;
  unsigned AN43:1;
  unsigned AN44:1;
  unsigned AN45:1;
  unsigned AN46:1;
  unsigned AN47:1;
  unsigned AN48:1;
  unsigned AN49:1;
  unsigned AN50:1;
  unsigned AN51:1;
  unsigned AN52:1;
  unsigned AN53:1;
  unsigned AN54:1;
  unsigned AN55:1;
  unsigned AN56:1;
  unsigned AN57:1;
  unsigned AN58:1;
  unsigned AN59:1;
  unsigned AN60:1;
  unsigned AN61:1;
  unsigned AN62:1;
  unsigned AN63:1;
} __ADCSYSCFG1bits_t;*/
volatile __ADCSYSCFG1bits_t ADCSYSCFG1bits ;//__asm__ ("ADCSYSCFG1") ;//__attribute__((section("sfrs")));
volatile unsigned int        ADCDATA0 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned DATA:32;
} __ADCDATA0bits_t;*/
volatile __ADCDATA0bits_t ADCDATA0bits ;//__asm__ ("ADCDATA0") ;//__attribute__((section("sfrs")));
volatile unsigned int        ADCDATA1 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned DATA:32;
} __ADCDATA1bits_t;*/
volatile __ADCDATA1bits_t ADCDATA1bits ;//__asm__ ("ADCDATA1") ;//__attribute__((section("sfrs")));
volatile unsigned int        ADCDATA2 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned DATA:32;
} __ADCDATA2bits_t;*/
volatile __ADCDATA2bits_t ADCDATA2bits ;//__asm__ ("ADCDATA2") ;//__attribute__((section("sfrs")));
volatile unsigned int        ADCDATA3 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned DATA:32;
} __ADCDATA3bits_t;*/
volatile __ADCDATA3bits_t ADCDATA3bits ;//__asm__ ("ADCDATA3") ;//__attribute__((section("sfrs")));
volatile unsigned int        ADCDATA4 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned DATA:32;
} __ADCDATA4bits_t;*/
volatile __ADCDATA4bits_t ADCDATA4bits ;//__asm__ ("ADCDATA4") ;//__attribute__((section("sfrs")));
volatile unsigned int        ADCDATA5 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned DATA:32;
} __ADCDATA5bits_t;*/
volatile __ADCDATA5bits_t ADCDATA5bits ;//__asm__ ("ADCDATA5") ;//__attribute__((section("sfrs")));
volatile unsigned int        ADCDATA6 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned DATA:32;
} __ADCDATA6bits_t;*/
volatile __ADCDATA6bits_t ADCDATA6bits ;//__asm__ ("ADCDATA6") ;//__attribute__((section("sfrs")));
volatile unsigned int        ADCDATA7 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned DATA:32;
} __ADCDATA7bits_t;*/
volatile __ADCDATA7bits_t ADCDATA7bits ;//__asm__ ("ADCDATA7") ;//__attribute__((section("sfrs")));
volatile unsigned int        ADCDATA8 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned DATA:32;
} __ADCDATA8bits_t;*/
volatile __ADCDATA8bits_t ADCDATA8bits ;//__asm__ ("ADCDATA8") ;//__attribute__((section("sfrs")));
volatile unsigned int        ADCDATA9 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned DATA:32;
} __ADCDATA9bits_t;*/
volatile __ADCDATA9bits_t ADCDATA9bits ;//__asm__ ("ADCDATA9") ;//__attribute__((section("sfrs")));
volatile unsigned int        ADCDATA10 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned DATA:32;
} __ADCDATA10bits_t;*/
volatile __ADCDATA10bits_t ADCDATA10bits ;//__asm__ ("ADCDATA10") ;//__attribute__((section("sfrs")));
volatile unsigned int        ADCDATA11 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned DATA:32;
} __ADCDATA11bits_t;*/
volatile __ADCDATA11bits_t ADCDATA11bits ;//__asm__ ("ADCDATA11") ;//__attribute__((section("sfrs")));
volatile unsigned int        ADCDATA12 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned DATA:32;
} __ADCDATA12bits_t;*/
volatile __ADCDATA12bits_t ADCDATA12bits ;//__asm__ ("ADCDATA12") ;//__attribute__((section("sfrs")));
volatile unsigned int        ADCDATA13 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned DATA:32;
} __ADCDATA13bits_t;*/
volatile __ADCDATA13bits_t ADCDATA13bits ;//__asm__ ("ADCDATA13") ;//__attribute__((section("sfrs")));
volatile unsigned int        ADCDATA14 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned DATA:32;
} __ADCDATA14bits_t;*/
volatile __ADCDATA14bits_t ADCDATA14bits ;//__asm__ ("ADCDATA14") ;//__attribute__((section("sfrs")));
volatile unsigned int        ADCDATA15 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned DATA:32;
} __ADCDATA15bits_t;*/
volatile __ADCDATA15bits_t ADCDATA15bits ;//__asm__ ("ADCDATA15") ;//__attribute__((section("sfrs")));
volatile unsigned int        ADCDATA16 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned DATA:32;
} __ADCDATA16bits_t;*/
volatile __ADCDATA16bits_t ADCDATA16bits ;//__asm__ ("ADCDATA16") ;//__attribute__((section("sfrs")));
volatile unsigned int        ADCDATA17 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned DATA:32;
} __ADCDATA17bits_t;*/
volatile __ADCDATA17bits_t ADCDATA17bits ;//__asm__ ("ADCDATA17") ;//__attribute__((section("sfrs")));
volatile unsigned int        ADCDATA18 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned DATA:32;
} __ADCDATA18bits_t;*/
volatile __ADCDATA18bits_t ADCDATA18bits ;//__asm__ ("ADCDATA18") ;//__attribute__((section("sfrs")));
volatile unsigned int        ADCDATA19 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned DATA:32;
} __ADCDATA19bits_t;*/
volatile __ADCDATA19bits_t ADCDATA19bits ;//__asm__ ("ADCDATA19") ;//__attribute__((section("sfrs")));
volatile unsigned int        ADCDATA20 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned DATA:32;
} __ADCDATA20bits_t;*/
volatile __ADCDATA20bits_t ADCDATA20bits ;//__asm__ ("ADCDATA20") ;//__attribute__((section("sfrs")));
volatile unsigned int        ADCDATA21 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned DATA:32;
} __ADCDATA21bits_t;*/
volatile __ADCDATA21bits_t ADCDATA21bits ;//__asm__ ("ADCDATA21") ;//__attribute__((section("sfrs")));
volatile unsigned int        ADCDATA22 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned DATA:32;
} __ADCDATA22bits_t;*/
volatile __ADCDATA22bits_t ADCDATA22bits ;//__asm__ ("ADCDATA22") ;//__attribute__((section("sfrs")));
volatile unsigned int        ADCDATA23 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned DATA:32;
} __ADCDATA23bits_t;*/
