HomuraVehicle/homuraLib_v2/machine/device/p32mz2048efg100_forVC.c
volatile __ADCDATA23bits_t ADCDATA23bits ;//__asm__ ("ADCDATA23") ;//__attribute__((section("sfrs")));
volatile unsigned int        ADCDATA24 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned DATA:32;
} __ADCDATA24bits_t;*/
volatile __ADCDATA24bits_t ADCDATA24bits ;//__asm__ ("ADCDATA24") ;//__attribute__((section("sfrs")));
volatile unsigned int        ADCDATA25 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned DATA:32;
} __ADCDATA25bits_t;*/
volatile __ADCDATA25bits_t ADCDATA25bits ;//__asm__ ("ADCDATA25") ;//__attribute__((section("sfrs")));
volatile unsigned int        ADCDATA26 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned DATA:32;
} __ADCDATA26bits_t;*/
volatile __ADCDATA26bits_t ADCDATA26bits ;//__asm__ ("ADCDATA26") ;//__attribute__((section("sfrs")));
volatile unsigned int        ADCDATA27 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned DATA:32;
} __ADCDATA27bits_t;*/
volatile __ADCDATA27bits_t ADCDATA27bits ;//__asm__ ("ADCDATA27") ;//__attribute__((section("sfrs")));
volatile unsigned int        ADCDATA28 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned DATA:32;
} __ADCDATA28bits_t;*/
volatile __ADCDATA28bits_t ADCDATA28bits ;//__asm__ ("ADCDATA28") ;//__attribute__((section("sfrs")));
volatile unsigned int        ADCDATA29 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned DATA:32;
} __ADCDATA29bits_t;*/
volatile __ADCDATA29bits_t ADCDATA29bits ;//__asm__ ("ADCDATA29") ;//__attribute__((section("sfrs")));
volatile unsigned int        ADCDATA30 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned DATA:32;
} __ADCDATA30bits_t;*/
volatile __ADCDATA30bits_t ADCDATA30bits ;//__asm__ ("ADCDATA30") ;//__attribute__((section("sfrs")));
volatile unsigned int        ADCDATA31 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned DATA:32;
} __ADCDATA31bits_t;*/
volatile __ADCDATA31bits_t ADCDATA31bits ;//__asm__ ("ADCDATA31") ;//__attribute__((section("sfrs")));
volatile unsigned int        ADCDATA32 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned DATA:32;
} __ADCDATA32bits_t;*/
volatile __ADCDATA32bits_t ADCDATA32bits ;//__asm__ ("ADCDATA32") ;//__attribute__((section("sfrs")));
volatile unsigned int        ADCDATA33 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned DATA:32;
} __ADCDATA33bits_t;*/
volatile __ADCDATA33bits_t ADCDATA33bits ;//__asm__ ("ADCDATA33") ;//__attribute__((section("sfrs")));
volatile unsigned int        ADCDATA34 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned DATA:32;
} __ADCDATA34bits_t;*/
volatile __ADCDATA34bits_t ADCDATA34bits ;//__asm__ ("ADCDATA34") ;//__attribute__((section("sfrs")));
volatile unsigned int        ADCDATA43 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned DATA:32;
} __ADCDATA43bits_t;*/
volatile __ADCDATA43bits_t ADCDATA43bits ;//__asm__ ("ADCDATA43") ;//__attribute__((section("sfrs")));
volatile unsigned int        ADCDATA44 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned DATA:32;
} __ADCDATA44bits_t;*/
volatile __ADCDATA44bits_t ADCDATA44bits ;//__asm__ ("ADCDATA44") ;//__attribute__((section("sfrs")));
volatile unsigned int        CM1CON ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned CCH:2;
    unsigned :2;
    unsigned CREF:1;
    unsigned :1;
    unsigned EVPOL:2;
    unsigned COUT:1;
    unsigned :4;
    unsigned CPOL:1;
    unsigned COE:1;
    unsigned ON:1;
  };
  struct {
    unsigned CCH0:1;
    unsigned CCH1:1;
    unsigned :4;
    unsigned EVPOL0:1;
    unsigned EVPOL1:1;
  };
  struct {
    unsigned w:32;
  };
} __CM1CONbits_t;*/
volatile __CM1CONbits_t CM1CONbits ;//__asm__ ("CM1CON") ;//__attribute__((section("sfrs")));
volatile unsigned int        CM1CONCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        CM1CONSET ;//__attribute__((section("sfrs")));
volatile unsigned int        CM1CONINV ;//__attribute__((section("sfrs")));
volatile unsigned int        CM2CON ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned CCH:2;
    unsigned :2;
    unsigned CREF:1;
    unsigned :1;
    unsigned EVPOL:2;
    unsigned COUT:1;
    unsigned :4;
    unsigned CPOL:1;
    unsigned COE:1;
    unsigned ON:1;
  };
  struct {
    unsigned CCH0:1;
    unsigned CCH1:1;
    unsigned :4;
    unsigned EVPOL0:1;
    unsigned EVPOL1:1;
  };
  struct {
    unsigned w:32;
  };
} __CM2CONbits_t;*/
volatile __CM2CONbits_t CM2CONbits ;//__asm__ ("CM2CON") ;//__attribute__((section("sfrs")));
volatile unsigned int        CM2CONCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        CM2CONSET ;//__attribute__((section("sfrs")));
volatile unsigned int        CM2CONINV ;//__attribute__((section("sfrs")));
volatile unsigned int        CMSTAT ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned C1OUT:1;
    unsigned C2OUT:1;
    unsigned :11;
    unsigned SIDL:1;
  };
  struct {
    unsigned w:32;
  };
} __CMSTATbits_t;*/
volatile __CMSTATbits_t CMSTATbits ;//__asm__ ("CMSTAT") ;//__attribute__((section("sfrs")));
volatile unsigned int        CMSTATCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        CMSTATSET ;//__attribute__((section("sfrs")));
volatile unsigned int        CMSTATINV ;//__attribute__((section("sfrs")));
volatile unsigned int        ANSELA ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned ANSA0:1;
    unsigned ANSA1:1;
    unsigned :3;
    unsigned ANSA5:1;
    unsigned :3;
    unsigned ANSA9:1;
    unsigned ANSA10:1;
  };
  struct {
    unsigned w:32;
  };
} __ANSELAbits_t;*/
volatile __ANSELAbits_t ANSELAbits ;//__asm__ ("ANSELA") ;//__attribute__((section("sfrs")));
volatile unsigned int        ANSELACLR ;//__attribute__((section("sfrs")));
volatile unsigned int        ANSELASET ;//__attribute__((section("sfrs")));
volatile unsigned int        ANSELAINV ;//__attribute__((section("sfrs")));
volatile unsigned int        TRISA ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned TRISA0:1;
    unsigned TRISA1:1;
    unsigned TRISA2:1;
    unsigned TRISA3:1;
    unsigned TRISA4:1;
    unsigned TRISA5:1;
    unsigned TRISA6:1;
    unsigned TRISA7:1;
    unsigned :1;
    unsigned TRISA9:1;
    unsigned TRISA10:1;
    unsigned :3;
    unsigned TRISA14:1;
    unsigned TRISA15:1;
  };
  struct {
    unsigned w:32;
  };
} __TRISAbits_t;*/
volatile __TRISAbits_t TRISAbits ;//__asm__ ("TRISA") ;//__attribute__((section("sfrs")));
volatile unsigned int        TRISACLR ;//__attribute__((section("sfrs")));
volatile unsigned int        TRISASET ;//__attribute__((section("sfrs")));
volatile unsigned int        TRISAINV ;//__attribute__((section("sfrs")));
volatile unsigned int        PORTA ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned RA0:1;
    unsigned RA1:1;
    unsigned RA2:1;
    unsigned RA3:1;
    unsigned RA4:1;
    unsigned RA5:1;
    unsigned RA6:1;
    unsigned RA7:1;
    unsigned :1;
    unsigned RA9:1;
    unsigned RA10:1;
    unsigned :3;
    unsigned RA14:1;
    unsigned RA15:1;
  };
  struct {
    unsigned w:32;
  };
} __PORTAbits_t;*/
