HomuraVehicle/homuraLib_v2/machine/device/p32mz2048efg100_forVC.c
volatile __PORTAbits_t PORTAbits ;//__asm__ ("PORTA") ;//__attribute__((section("sfrs")));
volatile unsigned int        PORTACLR ;//__attribute__((section("sfrs")));
volatile unsigned int        PORTASET ;//__attribute__((section("sfrs")));
volatile unsigned int        PORTAINV ;//__attribute__((section("sfrs")));
volatile unsigned int        LATA ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned LATA0:1;
    unsigned LATA1:1;
    unsigned LATA2:1;
    unsigned LATA3:1;
    unsigned LATA4:1;
    unsigned LATA5:1;
    unsigned LATA6:1;
    unsigned LATA7:1;
    unsigned :1;
    unsigned LATA9:1;
    unsigned LATA10:1;
    unsigned :3;
    unsigned LATA14:1;
    unsigned LATA15:1;
  };
  struct {
    unsigned w:32;
  };
} __LATAbits_t;*/
volatile __LATAbits_t LATAbits ;//__asm__ ("LATA") ;//__attribute__((section("sfrs")));
volatile unsigned int        LATACLR ;//__attribute__((section("sfrs")));
volatile unsigned int        LATASET ;//__attribute__((section("sfrs")));
volatile unsigned int        LATAINV ;//__attribute__((section("sfrs")));
volatile unsigned int        ODCA ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned ODCA0:1;
    unsigned ODCA1:1;
    unsigned ODCA2:1;
    unsigned ODCA3:1;
    unsigned ODCA4:1;
    unsigned ODCA5:1;
    unsigned ODCA6:1;
    unsigned ODCA7:1;
    unsigned :1;
    unsigned ODCA9:1;
    unsigned ODCA10:1;
    unsigned :3;
    unsigned ODCA14:1;
    unsigned ODCA15:1;
  };
  struct {
    unsigned w:32;
  };
} __ODCAbits_t;*/
volatile __ODCAbits_t ODCAbits ;//__asm__ ("ODCA") ;//__attribute__((section("sfrs")));
volatile unsigned int        ODCACLR ;//__attribute__((section("sfrs")));
volatile unsigned int        ODCASET ;//__attribute__((section("sfrs")));
volatile unsigned int        ODCAINV ;//__attribute__((section("sfrs")));
volatile unsigned int        CNPUA ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned CNPUA0:1;
    unsigned CNPUA1:1;
    unsigned CNPUA2:1;
    unsigned CNPUA3:1;
    unsigned CNPUA4:1;
    unsigned CNPUA5:1;
    unsigned CNPUA6:1;
    unsigned CNPUA7:1;
    unsigned :1;
    unsigned CNPUA9:1;
    unsigned CNPUA10:1;
    unsigned :3;
    unsigned CNPUA14:1;
    unsigned CNPUA15:1;
  };
  struct {
    unsigned w:32;
  };
} __CNPUAbits_t;*/
volatile __CNPUAbits_t CNPUAbits ;//__asm__ ("CNPUA") ;//__attribute__((section("sfrs")));
volatile unsigned int        CNPUACLR ;//__attribute__((section("sfrs")));
volatile unsigned int        CNPUASET ;//__attribute__((section("sfrs")));
volatile unsigned int        CNPUAINV ;//__attribute__((section("sfrs")));
volatile unsigned int        CNPDA ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned CNPDA0:1;
    unsigned CNPDA1:1;
    unsigned CNPDA2:1;
    unsigned CNPDA3:1;
    unsigned CNPDA4:1;
    unsigned CNPDA5:1;
    unsigned CNPDA6:1;
    unsigned CNPDA7:1;
    unsigned :1;
    unsigned CNPDA9:1;
    unsigned CNPDA10:1;
    unsigned :3;
    unsigned CNPDA14:1;
    unsigned CNPDA15:1;
  };
  struct {
    unsigned w:32;
  };
} __CNPDAbits_t;*/
volatile __CNPDAbits_t CNPDAbits ;//__asm__ ("CNPDA") ;//__attribute__((section("sfrs")));
volatile unsigned int        CNPDACLR ;//__attribute__((section("sfrs")));
volatile unsigned int        CNPDASET ;//__attribute__((section("sfrs")));
volatile unsigned int        CNPDAINV ;//__attribute__((section("sfrs")));
volatile unsigned int        CNCONA ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned :11;
    unsigned EDGEDETECT:1;
    unsigned :1;
    unsigned SIDL:1;
    unsigned :1;
    unsigned ON:1;
  };
  struct {
    unsigned w:32;
  };
} __CNCONAbits_t;*/
volatile __CNCONAbits_t CNCONAbits ;//__asm__ ("CNCONA") ;//__attribute__((section("sfrs")));
volatile unsigned int        CNCONACLR ;//__attribute__((section("sfrs")));
volatile unsigned int        CNCONASET ;//__attribute__((section("sfrs")));
volatile unsigned int        CNCONAINV ;//__attribute__((section("sfrs")));
volatile unsigned int        CNENA ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned CNIEA0:1;
    unsigned CNIEA1:1;
    unsigned CNIEA2:1;
    unsigned CNIEA3:1;
    unsigned CNIEA4:1;
    unsigned CNIEA5:1;
    unsigned CNIEA6:1;
    unsigned CNIEA7:1;
    unsigned :1;
    unsigned CNIEA9:1;
    unsigned CNIEA10:1;
    unsigned :3;
    unsigned CNIEA14:1;
    unsigned CNIEA15:1;
  };
  struct {
    unsigned w:32;
  };
} __CNENAbits_t;*/
volatile __CNENAbits_t CNENAbits ;//__asm__ ("CNENA") ;//__attribute__((section("sfrs")));
volatile unsigned int        CNENACLR ;//__attribute__((section("sfrs")));
volatile unsigned int        CNENASET ;//__attribute__((section("sfrs")));
volatile unsigned int        CNENAINV ;//__attribute__((section("sfrs")));
volatile unsigned int        CNSTATA ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned CNSTATA0:1;
    unsigned CNSTATA1:1;
    unsigned CNSTATA2:1;
    unsigned CNSTATA3:1;
    unsigned CNSTATA4:1;
    unsigned CNSTATA5:1;
    unsigned CNSTATA6:1;
    unsigned CNSTATA7:1;
    unsigned :1;
    unsigned CNSTATA9:1;
    unsigned CNSTATA10:1;
    unsigned :3;
    unsigned CNSTATA14:1;
    unsigned CNSTATA15:1;
  };
  struct {
    unsigned w:32;
  };
} __CNSTATAbits_t;*/
volatile __CNSTATAbits_t CNSTATAbits ;//__asm__ ("CNSTATA") ;//__attribute__((section("sfrs")));
volatile unsigned int        CNSTATACLR ;//__attribute__((section("sfrs")));
volatile unsigned int        CNSTATASET ;//__attribute__((section("sfrs")));
volatile unsigned int        CNSTATAINV ;//__attribute__((section("sfrs")));
volatile unsigned int        CNNEA ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned CNNEA0:1;
  unsigned CNNEA1:1;
  unsigned CNNEA2:1;
  unsigned CNNEA3:1;
  unsigned CNNEA4:1;
  unsigned CNNEA5:1;
  unsigned CNNEA6:1;
  unsigned CNNEA7:1;
  unsigned :1;
  unsigned CNNEA9:1;
  unsigned CNNEA10:1;
  unsigned :3;
  unsigned CNNEA14:1;
  unsigned CNNEA15:1;
} __CNNEAbits_t;*/
volatile __CNNEAbits_t CNNEAbits ;//__asm__ ("CNNEA") ;//__attribute__((section("sfrs")));
volatile unsigned int        CNFA ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned CNFA0:1;
  unsigned CNFA1:1;
  unsigned CNFA2:1;
  unsigned CNFA3:1;
  unsigned CNFA4:1;
  unsigned CNFA5:1;
  unsigned CNFA6:1;
  unsigned CNFA7:1;
  unsigned :1;
  unsigned CNFA9:1;
  unsigned CNFA10:1;
  unsigned :3;
  unsigned CNFA14:1;
  unsigned CNFA15:1;
} __CNFAbits_t;*/
volatile __CNFAbits_t CNFAbits ;//__asm__ ("CNFA") ;//__attribute__((section("sfrs")));
volatile unsigned int        SRCON0A ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned :6;
  unsigned SR0A6:1;
  unsigned SR0A7:1;
} __SRCON0Abits_t;*/
volatile __SRCON0Abits_t SRCON0Abits ;//__asm__ ("SRCON0A") ;//__attribute__((section("sfrs")));
volatile unsigned int        SRCON1A ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned :6;
  unsigned SR1A6:1;
  unsigned SR1A7:1;
} __SRCON1Abits_t;*/
volatile __SRCON1Abits_t SRCON1Abits ;//__asm__ ("SRCON1A") ;//__attribute__((section("sfrs")));
volatile unsigned int        ANSELB ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned ANSB0:1;
    unsigned ANSB1:1;
    unsigned ANSB2:1;
    unsigned ANSB3:1;
    unsigned ANSB4:1;
    unsigned ANSB5:1;
    unsigned ANSB6:1;
    unsigned ANSB7:1;
    unsigned ANSB8:1;
    unsigned ANSB9:1;
    unsigned ANSB10:1;
    unsigned ANSB11:1;
    unsigned ANSB12:1;
    unsigned ANSB13:1;
    unsigned ANSB14:1;
    unsigned ANSB15:1;
  };
  struct {
    unsigned w:32;
  };
} __ANSELBbits_t;*/
volatile __ANSELBbits_t ANSELBbits ;//__asm__ ("ANSELB") ;//__attribute__((section("sfrs")));
volatile unsigned int        ANSELBCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        ANSELBSET ;//__attribute__((section("sfrs")));
volatile unsigned int        ANSELBINV ;//__attribute__((section("sfrs")));
volatile unsigned int        TRISB ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned TRISB0:1;
    unsigned TRISB1:1;
    unsigned TRISB2:1;
    unsigned TRISB3:1;
    unsigned TRISB4:1;
    unsigned TRISB5:1;
    unsigned TRISB6:1;
    unsigned TRISB7:1;
    unsigned TRISB8:1;
    unsigned TRISB9:1;
    unsigned TRISB10:1;
    unsigned TRISB11:1;
    unsigned TRISB12:1;
    unsigned TRISB13:1;
    unsigned TRISB14:1;
    unsigned TRISB15:1;
  };
  struct {
    unsigned w:32;
  };
} __TRISBbits_t;*/
