HomuraVehicle/homuraLib_v2/machine/device/p32mz2048efg100_forVC.c
volatile __TRISBbits_t TRISBbits ;//__asm__ ("TRISB") ;//__attribute__((section("sfrs")));
volatile unsigned int        TRISBCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        TRISBSET ;//__attribute__((section("sfrs")));
volatile unsigned int        TRISBINV ;//__attribute__((section("sfrs")));
volatile unsigned int        PORTB ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned RB0:1;
    unsigned RB1:1;
    unsigned RB2:1;
    unsigned RB3:1;
    unsigned RB4:1;
    unsigned RB5:1;
    unsigned RB6:1;
    unsigned RB7:1;
    unsigned RB8:1;
    unsigned RB9:1;
    unsigned RB10:1;
    unsigned RB11:1;
    unsigned RB12:1;
    unsigned RB13:1;
    unsigned RB14:1;
    unsigned RB15:1;
  };
  struct {
    unsigned w:32;
  };
} __PORTBbits_t;*/
volatile __PORTBbits_t PORTBbits ;//__asm__ ("PORTB") ;//__attribute__((section("sfrs")));
volatile unsigned int        PORTBCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        PORTBSET ;//__attribute__((section("sfrs")));
volatile unsigned int        PORTBINV ;//__attribute__((section("sfrs")));
volatile unsigned int        LATB ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned LATB0:1;
    unsigned LATB1:1;
    unsigned LATB2:1;
    unsigned LATB3:1;
    unsigned LATB4:1;
    unsigned LATB5:1;
    unsigned LATB6:1;
    unsigned LATB7:1;
    unsigned LATB8:1;
    unsigned LATB9:1;
    unsigned LATB10:1;
    unsigned LATB11:1;
    unsigned LATB12:1;
    unsigned LATB13:1;
    unsigned LATB14:1;
    unsigned LATB15:1;
  };
  struct {
    unsigned w:32;
  };
} __LATBbits_t;*/
volatile __LATBbits_t LATBbits ;//__asm__ ("LATB") ;//__attribute__((section("sfrs")));
volatile unsigned int        LATBCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        LATBSET ;//__attribute__((section("sfrs")));
volatile unsigned int        LATBINV ;//__attribute__((section("sfrs")));
volatile unsigned int        ODCB ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned ODCB0:1;
    unsigned ODCB1:1;
    unsigned ODCB2:1;
    unsigned ODCB3:1;
    unsigned ODCB4:1;
    unsigned ODCB5:1;
    unsigned ODCB6:1;
    unsigned ODCB7:1;
    unsigned ODCB8:1;
    unsigned ODCB9:1;
    unsigned ODCB10:1;
    unsigned ODCB11:1;
    unsigned ODCB12:1;
    unsigned ODCB13:1;
    unsigned ODCB14:1;
    unsigned ODCB15:1;
  };
  struct {
    unsigned w:32;
  };
} __ODCBbits_t;*/
volatile __ODCBbits_t ODCBbits ;//__asm__ ("ODCB") ;//__attribute__((section("sfrs")));
volatile unsigned int        ODCBCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        ODCBSET ;//__attribute__((section("sfrs")));
volatile unsigned int        ODCBINV ;//__attribute__((section("sfrs")));
volatile unsigned int        CNPUB ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned CNPUB0:1;
    unsigned CNPUB1:1;
    unsigned CNPUB2:1;
    unsigned CNPUB3:1;
    unsigned CNPUB4:1;
    unsigned CNPUB5:1;
    unsigned CNPUB6:1;
    unsigned CNPUB7:1;
    unsigned CNPUB8:1;
    unsigned CNPUB9:1;
    unsigned CNPUB10:1;
    unsigned CNPUB11:1;
    unsigned CNPUB12:1;
    unsigned CNPUB13:1;
    unsigned CNPUB14:1;
    unsigned CNPUB15:1;
  };
  struct {
    unsigned w:32;
  };
} __CNPUBbits_t;*/
volatile __CNPUBbits_t CNPUBbits ;//__asm__ ("CNPUB") ;//__attribute__((section("sfrs")));
volatile unsigned int        CNPUBCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        CNPUBSET ;//__attribute__((section("sfrs")));
volatile unsigned int        CNPUBINV ;//__attribute__((section("sfrs")));
volatile unsigned int        CNPDB ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned CNPDB0:1;
    unsigned CNPDB1:1;
    unsigned CNPDB2:1;
    unsigned CNPDB3:1;
    unsigned CNPDB4:1;
    unsigned CNPDB5:1;
    unsigned CNPDB6:1;
    unsigned CNPDB7:1;
    unsigned CNPDB8:1;
    unsigned CNPDB9:1;
    unsigned CNPDB10:1;
    unsigned CNPDB11:1;
    unsigned CNPDB12:1;
    unsigned CNPDB13:1;
    unsigned CNPDB14:1;
    unsigned CNPDB15:1;
  };
  struct {
    unsigned w:32;
  };
} __CNPDBbits_t;*/
volatile __CNPDBbits_t CNPDBbits ;//__asm__ ("CNPDB") ;//__attribute__((section("sfrs")));
volatile unsigned int        CNPDBCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        CNPDBSET ;//__attribute__((section("sfrs")));
volatile unsigned int        CNPDBINV ;//__attribute__((section("sfrs")));
volatile unsigned int        CNCONB ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned :11;
    unsigned EDGEDETECT:1;
    unsigned :1;
    unsigned SIDL:1;
    unsigned :1;
    unsigned ON:1;
  };
  struct {
    unsigned w:32;
  };
} __CNCONBbits_t;*/
volatile __CNCONBbits_t CNCONBbits ;//__asm__ ("CNCONB") ;//__attribute__((section("sfrs")));
volatile unsigned int        CNCONBCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        CNCONBSET ;//__attribute__((section("sfrs")));
volatile unsigned int        CNCONBINV ;//__attribute__((section("sfrs")));
volatile unsigned int        CNENB ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned CNIEB0:1;
    unsigned CNIEB1:1;
    unsigned CNIEB2:1;
    unsigned CNIEB3:1;
    unsigned CNIEB4:1;
    unsigned CNIEB5:1;
    unsigned CNIEB6:1;
    unsigned CNIEB7:1;
    unsigned CNIEB8:1;
    unsigned CNIEB9:1;
    unsigned CNIEB10:1;
    unsigned CNIEB11:1;
    unsigned CNIEB12:1;
    unsigned CNIEB13:1;
    unsigned CNIEB14:1;
    unsigned CNIEB15:1;
  };
  struct {
    unsigned w:32;
  };
} __CNENBbits_t;*/
volatile __CNENBbits_t CNENBbits ;//__asm__ ("CNENB") ;//__attribute__((section("sfrs")));
volatile unsigned int        CNENBCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        CNENBSET ;//__attribute__((section("sfrs")));
volatile unsigned int        CNENBINV ;//__attribute__((section("sfrs")));
volatile unsigned int        CNSTATB ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned CNSTATB0:1;
    unsigned CNSTATB1:1;
    unsigned CNSTATB2:1;
    unsigned CNSTATB3:1;
    unsigned CNSTATB4:1;
    unsigned CNSTATB5:1;
    unsigned CNSTATB6:1;
    unsigned CNSTATB7:1;
    unsigned CNSTATB8:1;
    unsigned CNSTATB9:1;
    unsigned CNSTATB10:1;
    unsigned CNSTATB11:1;
    unsigned CNSTATB12:1;
    unsigned CNSTATB13:1;
    unsigned CNSTATB14:1;
    unsigned CNSTATB15:1;
  };
  struct {
    unsigned w:32;
  };
} __CNSTATBbits_t;*/
volatile __CNSTATBbits_t CNSTATBbits ;//__asm__ ("CNSTATB") ;//__attribute__((section("sfrs")));
volatile unsigned int        CNSTATBCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        CNSTATBSET ;//__attribute__((section("sfrs")));
volatile unsigned int        CNSTATBINV ;//__attribute__((section("sfrs")));
volatile unsigned int        CNNEB ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned CNNEB0:1;
  unsigned CNNEB1:1;
  unsigned CNNEB2:1;
  unsigned CNNEB3:1;
  unsigned CNNEB4:1;
  unsigned CNNEB5:1;
  unsigned CNNEB6:1;
  unsigned CNNEB7:1;
  unsigned CNNEB8:1;
  unsigned CNNEB9:1;
  unsigned CNNEB10:1;
  unsigned CNNEB11:1;
  unsigned CNNEB12:1;
  unsigned CNNEB13:1;
  unsigned CNNEB14:1;
  unsigned CNNEB15:1;
} __CNNEBbits_t;*/
volatile __CNNEBbits_t CNNEBbits ;//__asm__ ("CNNEB") ;//__attribute__((section("sfrs")));
volatile unsigned int        CNFB ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned CNFB0:1;
  unsigned CNFB1:1;
  unsigned CNFB2:1;
  unsigned CNFB3:1;
  unsigned CNFB4:1;
  unsigned CNFB5:1;
  unsigned CNFB6:1;
  unsigned CNFB7:1;
  unsigned CNFB8:1;
  unsigned CNFB9:1;
  unsigned CNFB10:1;
  unsigned CNFB11:1;
  unsigned CNFB12:1;
  unsigned CNFB13:1;
  unsigned CNFB14:1;
  unsigned CNFB15:1;
} __CNFBbits_t;*/
volatile __CNFBbits_t CNFBbits ;//__asm__ ("CNFB") ;//__attribute__((section("sfrs")));
volatile unsigned int        SRCON0B ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned :3;
  unsigned SR0B3:1;
  unsigned :1;
  unsigned SR0B5:1;
  unsigned :2;
  unsigned SR0B8:1;
  unsigned SR0B9:1;
  unsigned SR0B10:1;
  unsigned :3;
  unsigned SR0B14:1;
} __SRCON0Bbits_t;*/
volatile __SRCON0Bbits_t SRCON0Bbits ;//__asm__ ("SRCON0B") ;//__attribute__((section("sfrs")));
volatile unsigned int        SRCON1B ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned :3;
  unsigned SR1B3:1;
  unsigned :1;
  unsigned SR1B5:1;
  unsigned :2;
  unsigned SR1B8:1;
  unsigned SR1B9:1;
  unsigned SR1B10:1;
  unsigned :3;
  unsigned SR1B14:1;
} __SRCON1Bbits_t;*/
volatile __SRCON1Bbits_t SRCON1Bbits ;//__asm__ ("SRCON1B") ;//__attribute__((section("sfrs")));
volatile unsigned int        ANSELC ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned :1;
    unsigned ANSC1:1;
    unsigned ANSC2:1;
    unsigned ANSC3:1;
    unsigned ANSC4:1;
  };
  struct {
    unsigned w:32;
  };
} __ANSELCbits_t;*/
volatile __ANSELCbits_t ANSELCbits ;//__asm__ ("ANSELC") ;//__attribute__((section("sfrs")));
volatile unsigned int        ANSELCCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        ANSELCSET ;//__attribute__((section("sfrs")));
volatile unsigned int        ANSELCINV ;//__attribute__((section("sfrs")));
volatile unsigned int        TRISC ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned :1;
    unsigned TRISC1:1;
    unsigned TRISC2:1;
    unsigned TRISC3:1;
    unsigned TRISC4:1;
    unsigned :7;
    unsigned TRISC12:1;
    unsigned TRISC13:1;
    unsigned TRISC14:1;
    unsigned TRISC15:1;
  };
  struct {
    unsigned w:32;
  };
} __TRISCbits_t;*/
volatile __TRISCbits_t TRISCbits ;//__asm__ ("TRISC") ;//__attribute__((section("sfrs")));
volatile unsigned int        TRISCCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        TRISCSET ;//__attribute__((section("sfrs")));
volatile unsigned int        TRISCINV ;//__attribute__((section("sfrs")));
volatile unsigned int        PORTC ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned :1;
    unsigned RC1:1;
    unsigned RC2:1;
    unsigned RC3:1;
    unsigned RC4:1;
    unsigned :7;
    unsigned RC12:1;
    unsigned RC13:1;
    unsigned RC14:1;
    unsigned RC15:1;
  };
  struct {
    unsigned w:32;
  };
} __PORTCbits_t;*/
