HomuraVehicle/homuraLib_v2/machine/device/p32mz2048efg100_forVC.c
volatile __PORTCbits_t PORTCbits ;//__asm__ ("PORTC") ;//__attribute__((section("sfrs")));
volatile unsigned int        PORTCCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        PORTCSET ;//__attribute__((section("sfrs")));
volatile unsigned int        PORTCINV ;//__attribute__((section("sfrs")));
volatile unsigned int        LATC ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned :1;
    unsigned LATC1:1;
    unsigned LATC2:1;
    unsigned LATC3:1;
    unsigned LATC4:1;
    unsigned :7;
    unsigned LATC12:1;
    unsigned LATC13:1;
    unsigned LATC14:1;
    unsigned LATC15:1;
  };
  struct {
    unsigned w:32;
  };
} __LATCbits_t;*/
volatile __LATCbits_t LATCbits ;//__asm__ ("LATC") ;//__attribute__((section("sfrs")));
volatile unsigned int        LATCCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        LATCSET ;//__attribute__((section("sfrs")));
volatile unsigned int        LATCINV ;//__attribute__((section("sfrs")));
volatile unsigned int        ODCC ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned :1;
    unsigned ODCC1:1;
    unsigned ODCC2:1;
    unsigned ODCC3:1;
    unsigned ODCC4:1;
    unsigned :7;
    unsigned ODCC12:1;
    unsigned ODCC13:1;
    unsigned ODCC14:1;
    unsigned ODCC15:1;
  };
  struct {
    unsigned w:32;
  };
} __ODCCbits_t;*/
volatile __ODCCbits_t ODCCbits ;//__asm__ ("ODCC") ;//__attribute__((section("sfrs")));
volatile unsigned int        ODCCCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        ODCCSET ;//__attribute__((section("sfrs")));
volatile unsigned int        ODCCINV ;//__attribute__((section("sfrs")));
volatile unsigned int        CNPUC ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned :1;
    unsigned CNPUC1:1;
    unsigned CNPUC2:1;
    unsigned CNPUC3:1;
    unsigned CNPUC4:1;
    unsigned :7;
    unsigned CNPUC12:1;
    unsigned CNPUC13:1;
    unsigned CNPUC14:1;
    unsigned CNPUC15:1;
  };
  struct {
    unsigned w:32;
  };
} __CNPUCbits_t;*/
volatile __CNPUCbits_t CNPUCbits ;//__asm__ ("CNPUC") ;//__attribute__((section("sfrs")));
volatile unsigned int        CNPUCCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        CNPUCSET ;//__attribute__((section("sfrs")));
volatile unsigned int        CNPUCINV ;//__attribute__((section("sfrs")));
volatile unsigned int        CNPDC ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned :1;
    unsigned CNPDC1:1;
    unsigned CNPDC2:1;
    unsigned CNPDC3:1;
    unsigned CNPDC4:1;
    unsigned :7;
    unsigned CNPDC12:1;
    unsigned CNPDC13:1;
    unsigned CNPDC14:1;
    unsigned CNPDC15:1;
  };
  struct {
    unsigned w:32;
  };
} __CNPDCbits_t;*/
volatile __CNPDCbits_t CNPDCbits ;//__asm__ ("CNPDC") ;//__attribute__((section("sfrs")));
volatile unsigned int        CNPDCCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        CNPDCSET ;//__attribute__((section("sfrs")));
volatile unsigned int        CNPDCINV ;//__attribute__((section("sfrs")));
volatile unsigned int        CNCONC ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned :11;
    unsigned EDGEDETECT:1;
    unsigned :1;
    unsigned SIDL:1;
    unsigned :1;
    unsigned ON:1;
  };
  struct {
    unsigned w:32;
  };
} __CNCONCbits_t;*/
volatile __CNCONCbits_t CNCONCbits ;//__asm__ ("CNCONC") ;//__attribute__((section("sfrs")));
volatile unsigned int        CNCONCCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        CNCONCSET ;//__attribute__((section("sfrs")));
volatile unsigned int        CNCONCINV ;//__attribute__((section("sfrs")));
volatile unsigned int        CNENC ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned :1;
    unsigned CNIEC1:1;
    unsigned CNIEC2:1;
    unsigned CNIEC3:1;
    unsigned CNIEC4:1;
    unsigned :7;
    unsigned CNIEC12:1;
    unsigned CNIEC13:1;
    unsigned CNIEC14:1;
    unsigned CNIEC15:1;
  };
  struct {
    unsigned w:32;
  };
} __CNENCbits_t;*/
volatile __CNENCbits_t CNENCbits ;//__asm__ ("CNENC") ;//__attribute__((section("sfrs")));
volatile unsigned int        CNENCCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        CNENCSET ;//__attribute__((section("sfrs")));
volatile unsigned int        CNENCINV ;//__attribute__((section("sfrs")));
volatile unsigned int        CNSTATC ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned :1;
    unsigned CNSTATC1:1;
    unsigned CNSTATC2:1;
    unsigned CNSTATC3:1;
    unsigned CNSTATC4:1;
    unsigned :7;
    unsigned CNSTATC12:1;
    unsigned CNSTATC13:1;
    unsigned CNSTATC14:1;
    unsigned CNSTATC15:1;
  };
  struct {
    unsigned w:32;
  };
} __CNSTATCbits_t;*/
volatile __CNSTATCbits_t CNSTATCbits ;//__asm__ ("CNSTATC") ;//__attribute__((section("sfrs")));
volatile unsigned int        CNSTATCCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        CNSTATCSET ;//__attribute__((section("sfrs")));
volatile unsigned int        CNSTATCINV ;//__attribute__((section("sfrs")));
volatile unsigned int        CNNEC ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned :1;
  unsigned CNNEC1:1;
  unsigned CNNEC2:1;
  unsigned CNNEC3:1;
  unsigned CNNEC4:1;
  unsigned :7;
  unsigned CNNEC12:1;
  unsigned CNNEC13:1;
  unsigned CNNEC14:1;
  unsigned CNNEC15:1;
} __CNNECbits_t;*/
volatile __CNNECbits_t CNNECbits ;//__asm__ ("CNNEC") ;//__attribute__((section("sfrs")));
volatile unsigned int        CNFC ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned :1;
  unsigned CNFC1:1;
  unsigned CNFC2:1;
  unsigned CNFC3:1;
  unsigned CNFC4:1;
  unsigned :7;
  unsigned CNFC12:1;
  unsigned CNFC13:1;
  unsigned CNFC14:1;
  unsigned CNFC15:1;
} __CNFCbits_t;*/
volatile __CNFCbits_t CNFCbits ;//__asm__ ("CNFC") ;//__attribute__((section("sfrs")));
volatile unsigned int        ANSELD ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned :14;
    unsigned ANSD14:1;
    unsigned ANSD15:1;
  };
  struct {
    unsigned w:32;
  };
} __ANSELDbits_t;*/
volatile __ANSELDbits_t ANSELDbits ;//__asm__ ("ANSELD") ;//__attribute__((section("sfrs")));
volatile unsigned int        ANSELDCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        ANSELDSET ;//__attribute__((section("sfrs")));
volatile unsigned int        ANSELDINV ;//__attribute__((section("sfrs")));
volatile unsigned int        TRISD ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned TRISD0:1;
    unsigned TRISD1:1;
    unsigned TRISD2:1;
    unsigned TRISD3:1;
    unsigned TRISD4:1;
    unsigned TRISD5:1;
    unsigned :3;
    unsigned TRISD9:1;
    unsigned TRISD10:1;
    unsigned TRISD11:1;
    unsigned TRISD12:1;
    unsigned TRISD13:1;
    unsigned TRISD14:1;
    unsigned TRISD15:1;
  };
  struct {
    unsigned w:32;
  };
} __TRISDbits_t;*/
