HomuraVehicle/homuraLib_v2/machine/device/p32mz2048efg100_forVC.c
volatile __TRISDbits_t TRISDbits ;//__asm__ ("TRISD") ;//__attribute__((section("sfrs")));
volatile unsigned int        TRISDCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        TRISDSET ;//__attribute__((section("sfrs")));
volatile unsigned int        TRISDINV ;//__attribute__((section("sfrs")));
volatile unsigned int        PORTD ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned RD0:1;
    unsigned RD1:1;
    unsigned RD2:1;
    unsigned RD3:1;
    unsigned RD4:1;
    unsigned RD5:1;
    unsigned :3;
    unsigned RD9:1;
    unsigned RD10:1;
    unsigned RD11:1;
    unsigned RD12:1;
    unsigned RD13:1;
    unsigned RD14:1;
    unsigned RD15:1;
  };
  struct {
    unsigned w:32;
  };
} __PORTDbits_t;*/
volatile __PORTDbits_t PORTDbits ;//__asm__ ("PORTD") ;//__attribute__((section("sfrs")));
volatile unsigned int        PORTDCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        PORTDSET ;//__attribute__((section("sfrs")));
volatile unsigned int        PORTDINV ;//__attribute__((section("sfrs")));
volatile unsigned int        LATD ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned LATD0:1;
    unsigned LATD1:1;
    unsigned LATD2:1;
    unsigned LATD3:1;
    unsigned LATD4:1;
    unsigned LATD5:1;
    unsigned :3;
    unsigned LATD9:1;
    unsigned LATD10:1;
    unsigned LATD11:1;
    unsigned LATD12:1;
    unsigned LATD13:1;
    unsigned LATD14:1;
    unsigned LATD15:1;
  };
  struct {
    unsigned w:32;
  };
} __LATDbits_t;*/
volatile __LATDbits_t LATDbits ;//__asm__ ("LATD") ;//__attribute__((section("sfrs")));
volatile unsigned int        LATDCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        LATDSET ;//__attribute__((section("sfrs")));
volatile unsigned int        LATDINV ;//__attribute__((section("sfrs")));
volatile unsigned int        ODCD ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned ODCD0:1;
    unsigned ODCD1:1;
    unsigned ODCD2:1;
    unsigned ODCD3:1;
    unsigned ODCD4:1;
    unsigned ODCD5:1;
    unsigned :3;
    unsigned ODCD9:1;
    unsigned ODCD10:1;
    unsigned ODCD11:1;
    unsigned ODCD12:1;
    unsigned ODCD13:1;
    unsigned ODCD14:1;
    unsigned ODCD15:1;
  };
  struct {
    unsigned w:32;
  };
} __ODCDbits_t;*/
volatile __ODCDbits_t ODCDbits ;//__asm__ ("ODCD") ;//__attribute__((section("sfrs")));
volatile unsigned int        ODCDCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        ODCDSET ;//__attribute__((section("sfrs")));
volatile unsigned int        ODCDINV ;//__attribute__((section("sfrs")));
volatile unsigned int        CNPUD ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned CNPUD0:1;
    unsigned CNPUD1:1;
    unsigned CNPUD2:1;
    unsigned CNPUD3:1;
    unsigned CNPUD4:1;
    unsigned CNPUD5:1;
    unsigned :3;
    unsigned CNPUD9:1;
    unsigned CNPUD10:1;
    unsigned CNPUD11:1;
    unsigned CNPUD12:1;
    unsigned CNPUD13:1;
    unsigned CNPUD14:1;
    unsigned CNPUD15:1;
  };
  struct {
    unsigned w:32;
  };
} __CNPUDbits_t;*/
volatile __CNPUDbits_t CNPUDbits ;//__asm__ ("CNPUD") ;//__attribute__((section("sfrs")));
volatile unsigned int        CNPUDCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        CNPUDSET ;//__attribute__((section("sfrs")));
volatile unsigned int        CNPUDINV ;//__attribute__((section("sfrs")));
volatile unsigned int        CNPDD ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned CNPDD0:1;
    unsigned CNPDD1:1;
    unsigned CNPDD2:1;
    unsigned CNPDD3:1;
    unsigned CNPDD4:1;
    unsigned CNPDD5:1;
    unsigned :3;
    unsigned CNPDD9:1;
    unsigned CNPDD10:1;
    unsigned CNPDD11:1;
    unsigned CNPDD12:1;
    unsigned CNPDD13:1;
    unsigned CNPDD14:1;
    unsigned CNPDD15:1;
  };
  struct {
    unsigned w:32;
  };
} __CNPDDbits_t;*/
volatile __CNPDDbits_t CNPDDbits ;//__asm__ ("CNPDD") ;//__attribute__((section("sfrs")));
volatile unsigned int        CNPDDCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        CNPDDSET ;//__attribute__((section("sfrs")));
volatile unsigned int        CNPDDINV ;//__attribute__((section("sfrs")));
volatile unsigned int        CNCOND ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned :11;
    unsigned EDGEDETECT:1;
    unsigned :1;
    unsigned SIDL:1;
    unsigned :1;
    unsigned ON:1;
  };
  struct {
    unsigned w:32;
  };
} __CNCONDbits_t;*/
volatile __CNCONDbits_t CNCONDbits ;//__asm__ ("CNCOND") ;//__attribute__((section("sfrs")));
volatile unsigned int        CNCONDCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        CNCONDSET ;//__attribute__((section("sfrs")));
volatile unsigned int        CNCONDINV ;//__attribute__((section("sfrs")));
volatile unsigned int        CNEND ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned CNIED0:1;
    unsigned CNIED1:1;
    unsigned CNIED2:1;
    unsigned CNIED3:1;
    unsigned CNIED4:1;
    unsigned CNIED5:1;
    unsigned :3;
    unsigned CNIED9:1;
    unsigned CNIED10:1;
    unsigned CNIED11:1;
    unsigned CNIED12:1;
    unsigned CNIED13:1;
    unsigned CNIED14:1;
    unsigned CNIED15:1;
  };
  struct {
    unsigned w:32;
  };
} __CNENDbits_t;*/
volatile __CNENDbits_t CNENDbits ;//__asm__ ("CNEND") ;//__attribute__((section("sfrs")));
volatile unsigned int        CNENDCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        CNENDSET ;//__attribute__((section("sfrs")));
volatile unsigned int        CNENDINV ;//__attribute__((section("sfrs")));
volatile unsigned int        CNSTATD ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned CNSTATD0:1;
    unsigned CNSTATD1:1;
    unsigned CNSTATD2:1;
    unsigned CNSTATD3:1;
    unsigned CNSTATD4:1;
    unsigned CNSTATD5:1;
    unsigned :3;
    unsigned CNSTATD9:1;
    unsigned CNSTATD10:1;
    unsigned CNSTATD11:1;
    unsigned CNSTATD12:1;
    unsigned CNSTATD13:1;
    unsigned CNSTATD14:1;
    unsigned CNSTATD15:1;
  };
  struct {
    unsigned w:32;
  };
} __CNSTATDbits_t;*/
