HomuraVehicle/homuraLib_v2/machine/device/p32mz2048efg100_forVC.c
volatile __CNSTATDbits_t CNSTATDbits ;//__asm__ ("CNSTATD") ;//__attribute__((section("sfrs")));
volatile unsigned int        CNSTATDCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        CNSTATDSET ;//__attribute__((section("sfrs")));
volatile unsigned int        CNSTATDINV ;//__attribute__((section("sfrs")));
volatile unsigned int        CNNED ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned CNNED0:1;
  unsigned CNNED1:1;
  unsigned CNNED2:1;
  unsigned CNNED3:1;
  unsigned CNNED4:1;
  unsigned CNNED5:1;
  unsigned :3;
  unsigned CNNED9:1;
  unsigned CNNED10:1;
  unsigned CNNED11:1;
  unsigned CNNED12:1;
  unsigned CNNED13:1;
  unsigned CNNED14:1;
  unsigned CNNED15:1;
} __CNNEDbits_t;*/
volatile __CNNEDbits_t CNNEDbits ;//__asm__ ("CNNED") ;//__attribute__((section("sfrs")));
volatile unsigned int        CNFD ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned CNFD0:1;
  unsigned CNFD1:1;
  unsigned CNFD2:1;
  unsigned CNFD3:1;
  unsigned CNFD4:1;
  unsigned CNFD5:1;
  unsigned :3;
  unsigned CNFD9:1;
  unsigned CNFD10:1;
  unsigned CNFD11:1;
  unsigned CNFD12:1;
  unsigned CNFD13:1;
  unsigned CNFD14:1;
  unsigned CNFD15:1;
} __CNFDbits_t;*/
volatile __CNFDbits_t CNFDbits ;//__asm__ ("CNFD") ;//__attribute__((section("sfrs")));
volatile unsigned int        ANSELE ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned :4;
    unsigned ANSE4:1;
    unsigned ANSE5:1;
    unsigned ANSE6:1;
    unsigned ANSE7:1;
    unsigned ANSE8:1;
    unsigned ANSE9:1;
  };
  struct {
    unsigned w:32;
  };
} __ANSELEbits_t;*/
volatile __ANSELEbits_t ANSELEbits ;//__asm__ ("ANSELE") ;//__attribute__((section("sfrs")));
volatile unsigned int        ANSELECLR ;//__attribute__((section("sfrs")));
volatile unsigned int        ANSELESET ;//__attribute__((section("sfrs")));
volatile unsigned int        ANSELEINV ;//__attribute__((section("sfrs")));
volatile unsigned int        TRISE ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned TRISE0:1;
    unsigned TRISE1:1;
    unsigned TRISE2:1;
    unsigned TRISE3:1;
    unsigned TRISE4:1;
    unsigned TRISE5:1;
    unsigned TRISE6:1;
    unsigned TRISE7:1;
    unsigned TRISE8:1;
    unsigned TRISE9:1;
  };
  struct {
    unsigned w:32;
  };
} __TRISEbits_t;*/
volatile __TRISEbits_t TRISEbits ;//__asm__ ("TRISE") ;//__attribute__((section("sfrs")));
volatile unsigned int        TRISECLR ;//__attribute__((section("sfrs")));
volatile unsigned int        TRISESET ;//__attribute__((section("sfrs")));
volatile unsigned int        TRISEINV ;//__attribute__((section("sfrs")));
volatile unsigned int        PORTE ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned RE0:1;
    unsigned RE1:1;
    unsigned RE2:1;
    unsigned RE3:1;
    unsigned RE4:1;
    unsigned RE5:1;
    unsigned RE6:1;
    unsigned RE7:1;
    unsigned RE8:1;
    unsigned RE9:1;
  };
  struct {
    unsigned w:32;
  };
} __PORTEbits_t;*/
volatile __PORTEbits_t PORTEbits ;//__asm__ ("PORTE") ;//__attribute__((section("sfrs")));
volatile unsigned int        PORTECLR ;//__attribute__((section("sfrs")));
volatile unsigned int        PORTESET ;//__attribute__((section("sfrs")));
volatile unsigned int        PORTEINV ;//__attribute__((section("sfrs")));
volatile unsigned int        LATE ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned LATE0:1;
    unsigned LATE1:1;
    unsigned LATE2:1;
    unsigned LATE3:1;
    unsigned LATE4:1;
    unsigned LATE5:1;
    unsigned LATE6:1;
    unsigned LATE7:1;
    unsigned LATE8:1;
    unsigned LATE9:1;
  };
  struct {
    unsigned w:32;
  };
} __LATEbits_t;*/
volatile __LATEbits_t LATEbits ;//__asm__ ("LATE") ;//__attribute__((section("sfrs")));
volatile unsigned int        LATECLR ;//__attribute__((section("sfrs")));
volatile unsigned int        LATESET ;//__attribute__((section("sfrs")));
volatile unsigned int        LATEINV ;//__attribute__((section("sfrs")));
volatile unsigned int        ODCE ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned ODCE0:1;
    unsigned ODCE1:1;
    unsigned ODCE2:1;
    unsigned ODCE3:1;
    unsigned ODCE4:1;
    unsigned ODCE5:1;
    unsigned ODCE6:1;
    unsigned ODCE7:1;
    unsigned ODCE8:1;
    unsigned ODCE9:1;
  };
  struct {
    unsigned w:32;
  };
} __ODCEbits_t;*/
volatile __ODCEbits_t ODCEbits ;//__asm__ ("ODCE") ;//__attribute__((section("sfrs")));
volatile unsigned int        ODCECLR ;//__attribute__((section("sfrs")));
volatile unsigned int        ODCESET ;//__attribute__((section("sfrs")));
volatile unsigned int        ODCEINV ;//__attribute__((section("sfrs")));
volatile unsigned int        CNPUE ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned CNPUE0:1;
    unsigned CNPUE1:1;
    unsigned CNPUE2:1;
    unsigned CNPUE3:1;
    unsigned CNPUE4:1;
    unsigned CNPUE5:1;
    unsigned CNPUE6:1;
    unsigned CNPUE7:1;
    unsigned CNPUE8:1;
    unsigned CNPUE9:1;
  };
  struct {
    unsigned w:32;
  };
} __CNPUEbits_t;*/
volatile __CNPUEbits_t CNPUEbits ;//__asm__ ("CNPUE") ;//__attribute__((section("sfrs")));
volatile unsigned int        CNPUECLR ;//__attribute__((section("sfrs")));
volatile unsigned int        CNPUESET ;//__attribute__((section("sfrs")));
volatile unsigned int        CNPUEINV ;//__attribute__((section("sfrs")));
volatile unsigned int        CNPDE ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned CNPDE0:1;
    unsigned CNPDE1:1;
    unsigned CNPDE2:1;
    unsigned CNPDE3:1;
    unsigned CNPDE4:1;
    unsigned CNPDE5:1;
    unsigned CNPDE6:1;
    unsigned CNPDE7:1;
    unsigned CNPDE8:1;
    unsigned CNPDE9:1;
  };
  struct {
    unsigned w:32;
  };
} __CNPDEbits_t;*/
volatile __CNPDEbits_t CNPDEbits ;//__asm__ ("CNPDE") ;//__attribute__((section("sfrs")));
volatile unsigned int        CNPDECLR ;//__attribute__((section("sfrs")));
volatile unsigned int        CNPDESET ;//__attribute__((section("sfrs")));
volatile unsigned int        CNPDEINV ;//__attribute__((section("sfrs")));
volatile unsigned int        CNCONE ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned :11;
    unsigned EDGEDETECT:1;
    unsigned :1;
    unsigned SIDL:1;
    unsigned :1;
    unsigned ON:1;
  };
  struct {
    unsigned w:32;
  };
} __CNCONEbits_t;*/
volatile __CNCONEbits_t CNCONEbits ;//__asm__ ("CNCONE") ;//__attribute__((section("sfrs")));
volatile unsigned int        CNCONECLR ;//__attribute__((section("sfrs")));
volatile unsigned int        CNCONESET ;//__attribute__((section("sfrs")));
volatile unsigned int        CNCONEINV ;//__attribute__((section("sfrs")));
volatile unsigned int        CNENE ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned CNIEE0:1;
    unsigned CNIEE1:1;
    unsigned CNIEE2:1;
    unsigned CNIEE3:1;
    unsigned CNIEE4:1;
    unsigned CNIEE5:1;
    unsigned CNIEE6:1;
    unsigned CNIEE7:1;
    unsigned CNIEE8:1;
    unsigned CNIEE9:1;
  };
  struct {
    unsigned w:32;
  };
} __CNENEbits_t;*/
volatile __CNENEbits_t CNENEbits ;//__asm__ ("CNENE") ;//__attribute__((section("sfrs")));
volatile unsigned int        CNENECLR ;//__attribute__((section("sfrs")));
volatile unsigned int        CNENESET ;//__attribute__((section("sfrs")));
volatile unsigned int        CNENEINV ;//__attribute__((section("sfrs")));
volatile unsigned int        CNSTATE ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned CNSTATE0:1;
    unsigned CNSTATE1:1;
    unsigned CNSTATE2:1;
    unsigned CNSTATE3:1;
    unsigned CNSTATE4:1;
    unsigned CNSTATE5:1;
    unsigned CNSTATE6:1;
    unsigned CNSTATE7:1;
    unsigned CNSTATE8:1;
    unsigned CNSTATE9:1;
  };
  struct {
    unsigned w:32;
  };
} __CNSTATEbits_t;*/
