HomuraVehicle/homuraLib_v2/machine/device/p32mz2048efg100_forVC.c
volatile __ETHALGNERRbits_t ETHALGNERRbits ;//__asm__ ("ETHALGNERR") ;//__attribute__((section("sfrs")));
volatile unsigned int        ETHALGNERRCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        ETHALGNERRSET ;//__attribute__((section("sfrs")));
volatile unsigned int        ETHALGNERRINV ;//__attribute__((section("sfrs")));
volatile unsigned int        EMAC1CFG1 ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned RXENABLE:1;
    unsigned PASSALL:1;
    unsigned RXPAUSE:1;
    unsigned TXPAUSE:1;
    unsigned LOOPBACK:1;
    unsigned :3;
    unsigned RESETTFUN:1;
    unsigned RESETTMCS:1;
    unsigned RESETRFUN:1;
    unsigned RESETRMCS:1;
    unsigned :2;
    unsigned SIMRESET:1;
    unsigned SOFTRESET:1;
  };
  struct {
    unsigned w:32;
  };
} __EMAC1CFG1bits_t;*/
volatile __EMAC1CFG1bits_t EMAC1CFG1bits ;//__asm__ ("EMAC1CFG1") ;//__attribute__((section("sfrs")));
volatile unsigned int        EMACxCFG1 ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned RXENABLE:1;
    unsigned PASSALL:1;
    unsigned RXPAUSE:1;
    unsigned TXPAUSE:1;
    unsigned LOOPBACK:1;
    unsigned :3;
    unsigned RESETTFUN:1;
    unsigned RESETTMCS:1;
    unsigned RESETRFUN:1;
    unsigned RESETRMCS:1;
    unsigned :2;
    unsigned SIMRESET:1;
    unsigned SOFTRESET:1;
  };
  struct {
    unsigned w:32;
  };
} __EMACxCFG1bits_t;*/
volatile __EMACxCFG1bits_t EMACxCFG1bits ;//__asm__ ("EMACxCFG1") ;//__attribute__((section("sfrs")));
volatile unsigned int        EMAC1CFG1CLR ;//__attribute__((section("sfrs")));
volatile unsigned int        EMACxCFG1CLR ;//__attribute__((section("sfrs")));
volatile unsigned int        EMAC1CFG1SET ;//__attribute__((section("sfrs")));
volatile unsigned int        EMACxCFG1SET ;//__attribute__((section("sfrs")));
volatile unsigned int        EMAC1CFG1INV ;//__attribute__((section("sfrs")));
volatile unsigned int        EMACxCFG1INV ;//__attribute__((section("sfrs")));
volatile unsigned int        EMAC1CFG2 ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned FULLDPLX:1;
    unsigned LENGTHCK:1;
    unsigned HUGEFRM:1;
    unsigned DELAYCRC:1;
    unsigned CRCENABLE:1;
    unsigned PADENABLE:1;
    unsigned VLANPAD:1;
    unsigned AUTOPAD:1;
    unsigned PUREPRE:1;
    unsigned LONGPRE:1;
    unsigned :2;
    unsigned NOBKOFF:1;
    unsigned BPNOBKOFF:1;
    unsigned EXCESSDFR:1;
  };
  struct {
    unsigned w:32;
  };
} __EMAC1CFG2bits_t;*/
volatile __EMAC1CFG2bits_t EMAC1CFG2bits ;//__asm__ ("EMAC1CFG2") ;//__attribute__((section("sfrs")));
volatile unsigned int        EMACxCFG2 ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned FULLDPLX:1;
    unsigned LENGTHCK:1;
    unsigned HUGEFRM:1;
    unsigned DELAYCRC:1;
    unsigned CRCENABLE:1;
    unsigned PADENABLE:1;
    unsigned VLANPAD:1;
    unsigned AUTOPAD:1;
    unsigned PUREPRE:1;
    unsigned LONGPRE:1;
    unsigned :2;
    unsigned NOBKOFF:1;
    unsigned BPNOBKOFF:1;
    unsigned EXCESSDFR:1;
  };
  struct {
    unsigned w:32;
  };
} __EMACxCFG2bits_t;*/
volatile __EMACxCFG2bits_t EMACxCFG2bits ;//__asm__ ("EMACxCFG2") ;//__attribute__((section("sfrs")));
volatile unsigned int        EMAC1CFG2CLR ;//__attribute__((section("sfrs")));
volatile unsigned int        EMACxCFG2CLR ;//__attribute__((section("sfrs")));
volatile unsigned int        EMAC1CFG2SET ;//__attribute__((section("sfrs")));
volatile unsigned int        EMACxCFG2SET ;//__attribute__((section("sfrs")));
volatile unsigned int        EMAC1CFG2INV ;//__attribute__((section("sfrs")));
volatile unsigned int        EMACxCFG2INV ;//__attribute__((section("sfrs")));
volatile unsigned int        EMAC1IPGT ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned B2BIPKTGP:7;
  };
  struct {
    unsigned w:32;
  };
} __EMAC1IPGTbits_t;*/
volatile __EMAC1IPGTbits_t EMAC1IPGTbits ;//__asm__ ("EMAC1IPGT") ;//__attribute__((section("sfrs")));
volatile unsigned int        EMACxIPGT ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned B2BIPKTGP:7;
  };
  struct {
    unsigned w:32;
  };
} __EMACxIPGTbits_t;*/
volatile __EMACxIPGTbits_t EMACxIPGTbits ;//__asm__ ("EMACxIPGT") ;//__attribute__((section("sfrs")));
volatile unsigned int        EMAC1IPGTCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        EMACxIPGTCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        EMAC1IPGTSET ;//__attribute__((section("sfrs")));
volatile unsigned int        EMACxIPGTSET ;//__attribute__((section("sfrs")));
volatile unsigned int        EMAC1IPGTINV ;//__attribute__((section("sfrs")));
volatile unsigned int        EMACxIPGTINV ;//__attribute__((section("sfrs")));
volatile unsigned int        EMAC1IPGR ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned NB2BIPKTGP2:7;
    unsigned :1;
    unsigned NB2BIPKTGP1:7;
  };
  struct {
    unsigned w:32;
  };
} __EMAC1IPGRbits_t;*/
volatile __EMAC1IPGRbits_t EMAC1IPGRbits ;//__asm__ ("EMAC1IPGR") ;//__attribute__((section("sfrs")));
volatile unsigned int        EMACxIPGR ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned NB2BIPKTGP2:7;
    unsigned :1;
    unsigned NB2BIPKTGP1:7;
  };
  struct {
    unsigned w:32;
  };
} __EMACxIPGRbits_t;*/
volatile __EMACxIPGRbits_t EMACxIPGRbits ;//__asm__ ("EMACxIPGR") ;//__attribute__((section("sfrs")));
volatile unsigned int        EMAC1IPGRCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        EMACxIPGRCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        EMAC1IPGRSET ;//__attribute__((section("sfrs")));
volatile unsigned int        EMACxIPGRSET ;//__attribute__((section("sfrs")));
volatile unsigned int        EMAC1IPGRINV ;//__attribute__((section("sfrs")));
volatile unsigned int        EMACxIPGRINV ;//__attribute__((section("sfrs")));
volatile unsigned int        EMAC1CLRT ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned RETX:4;
    unsigned :4;
    unsigned CWINDOW:6;
  };
  struct {
    unsigned w:32;
  };
} __EMAC1CLRTbits_t;*/
