HomuraVehicle/homuraLib_v2/machine/device/p32mz2048efg100_forVC.c
volatile __EMAC1CLRTbits_t EMAC1CLRTbits ;//__asm__ ("EMAC1CLRT") ;//__attribute__((section("sfrs")));
volatile unsigned int        EMACxCLRT ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned RETX:4;
    unsigned :4;
    unsigned CWINDOW:6;
  };
  struct {
    unsigned w:32;
  };
} __EMACxCLRTbits_t;*/
volatile __EMACxCLRTbits_t EMACxCLRTbits ;//__asm__ ("EMACxCLRT") ;//__attribute__((section("sfrs")));
volatile unsigned int        EMAC1CLRTCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        EMACxCLRTCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        EMAC1CLRTSET ;//__attribute__((section("sfrs")));
volatile unsigned int        EMACxCLRTSET ;//__attribute__((section("sfrs")));
volatile unsigned int        EMAC1CLRTINV ;//__attribute__((section("sfrs")));
volatile unsigned int        EMACxCLRTINV ;//__attribute__((section("sfrs")));
volatile unsigned int        EMAC1MAXF ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned MACMAXF:16;
  };
  struct {
    unsigned w:32;
  };
} __EMAC1MAXFbits_t;*/
volatile __EMAC1MAXFbits_t EMAC1MAXFbits ;//__asm__ ("EMAC1MAXF") ;//__attribute__((section("sfrs")));
volatile unsigned int        EMACxMAXF ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned MACMAXF:16;
  };
  struct {
    unsigned w:32;
  };
} __EMACxMAXFbits_t;*/
volatile __EMACxMAXFbits_t EMACxMAXFbits ;//__asm__ ("EMACxMAXF") ;//__attribute__((section("sfrs")));
volatile unsigned int        EMAC1MAXFCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        EMACxMAXFCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        EMAC1MAXFSET ;//__attribute__((section("sfrs")));
volatile unsigned int        EMACxMAXFSET ;//__attribute__((section("sfrs")));
volatile unsigned int        EMAC1MAXFINV ;//__attribute__((section("sfrs")));
volatile unsigned int        EMACxMAXFINV ;//__attribute__((section("sfrs")));
volatile unsigned int        EMAC1SUPP ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned :8;
    unsigned SPEEDRMII:1;
    unsigned :2;
    unsigned RESETRMII:1;
  };
  struct {
    unsigned w:32;
  };
} __EMAC1SUPPbits_t;*/
volatile __EMAC1SUPPbits_t EMAC1SUPPbits ;//__asm__ ("EMAC1SUPP") ;//__attribute__((section("sfrs")));
volatile unsigned int        EMACxSUPP ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned :8;
    unsigned SPEEDRMII:1;
    unsigned :2;
    unsigned RESETRMII:1;
  };
  struct {
    unsigned w:32;
  };
} __EMACxSUPPbits_t;*/
volatile __EMACxSUPPbits_t EMACxSUPPbits ;//__asm__ ("EMACxSUPP") ;//__attribute__((section("sfrs")));
volatile unsigned int        EMAC1SUPPCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        EMACxSUPPCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        EMAC1SUPPSET ;//__attribute__((section("sfrs")));
volatile unsigned int        EMACxSUPPSET ;//__attribute__((section("sfrs")));
volatile unsigned int        EMAC1SUPPINV ;//__attribute__((section("sfrs")));
volatile unsigned int        EMACxSUPPINV ;//__attribute__((section("sfrs")));
volatile unsigned int        EMAC1TEST ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned SHRTQNTA:1;
    unsigned TESTPAUSE:1;
    unsigned TESTBP:1;
  };
  struct {
    unsigned w:32;
  };
} __EMAC1TESTbits_t;*/
volatile __EMAC1TESTbits_t EMAC1TESTbits ;//__asm__ ("EMAC1TEST") ;//__attribute__((section("sfrs")));
volatile unsigned int        EMACxTEST ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned SHRTQNTA:1;
    unsigned TESTPAUSE:1;
    unsigned TESTBP:1;
  };
  struct {
    unsigned w:32;
  };
} __EMACxTESTbits_t;*/
volatile __EMACxTESTbits_t EMACxTESTbits ;//__asm__ ("EMACxTEST") ;//__attribute__((section("sfrs")));
volatile unsigned int        EMAC1TESTCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        EMACxTESTCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        EMAC1TESTSET ;//__attribute__((section("sfrs")));
volatile unsigned int        EMACxTESTSET ;//__attribute__((section("sfrs")));
volatile unsigned int        EMAC1TESTINV ;//__attribute__((section("sfrs")));
volatile unsigned int        EMACxTESTINV ;//__attribute__((section("sfrs")));
volatile unsigned int        EMAC1MCFG ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned SCANINC:1;
    unsigned NOPRE:1;
    unsigned CLKSEL:4;
    unsigned :9;
    unsigned RESETMGMT:1;
  };
  struct {
    unsigned w:32;
  };
} __EMAC1MCFGbits_t;*/
volatile __EMAC1MCFGbits_t EMAC1MCFGbits ;//__asm__ ("EMAC1MCFG") ;//__attribute__((section("sfrs")));
volatile unsigned int        EMACxMCFG ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned SCANINC:1;
    unsigned NOPRE:1;
    unsigned CLKSEL:4;
    unsigned :9;
    unsigned RESETMGMT:1;
  };
  struct {
    unsigned w:32;
  };
} __EMACxMCFGbits_t;*/
volatile __EMACxMCFGbits_t EMACxMCFGbits ;//__asm__ ("EMACxMCFG") ;//__attribute__((section("sfrs")));
volatile unsigned int        EMAC1MCFGCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        EMACxMCFGCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        EMAC1MCFGSET ;//__attribute__((section("sfrs")));
volatile unsigned int        EMACxMCFGSET ;//__attribute__((section("sfrs")));
volatile unsigned int        EMAC1MCFGINV ;//__attribute__((section("sfrs")));
volatile unsigned int        EMACxMCFGINV ;//__attribute__((section("sfrs")));
volatile unsigned int        EMAC1MCMD ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned READ:1;
    unsigned SCAN:1;
  };
  struct {
    unsigned w:32;
  };
} __EMAC1MCMDbits_t;*/
volatile __EMAC1MCMDbits_t EMAC1MCMDbits ;//__asm__ ("EMAC1MCMD") ;//__attribute__((section("sfrs")));
volatile unsigned int        EMACxMCMD ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned READ:1;
    unsigned SCAN:1;
  };
  struct {
    unsigned w:32;
  };
} __EMACxMCMDbits_t;*/
volatile __EMACxMCMDbits_t EMACxMCMDbits ;//__asm__ ("EMACxMCMD") ;//__attribute__((section("sfrs")));
volatile unsigned int        EMAC1MCMDCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        EMACxMCMDCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        EMAC1MCMDSET ;//__attribute__((section("sfrs")));
volatile unsigned int        EMACxMCMDSET ;//__attribute__((section("sfrs")));
volatile unsigned int        EMAC1MCMDINV ;//__attribute__((section("sfrs")));
volatile unsigned int        EMACxMCMDINV ;//__attribute__((section("sfrs")));
volatile unsigned int        EMAC1MADR ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned REGADDR:5;
    unsigned :3;
    unsigned PHYADDR:5;
  };
  struct {
    unsigned w:32;
  };
} __EMAC1MADRbits_t;*/
volatile __EMAC1MADRbits_t EMAC1MADRbits ;//__asm__ ("EMAC1MADR") ;//__attribute__((section("sfrs")));
volatile unsigned int        EMACxMADR ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned REGADDR:5;
    unsigned :3;
    unsigned PHYADDR:5;
  };
  struct {
    unsigned w:32;
  };
} __EMACxMADRbits_t;*/
