HomuraVehicle/homuraLib_v2/machine/device/p32mz2048efg100_forVC.c
volatile __EMACxMADRbits_t EMACxMADRbits ;//__asm__ ("EMACxMADR") ;//__attribute__((section("sfrs")));
volatile unsigned int        EMAC1MADRCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        EMACxMADRCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        EMAC1MADRSET ;//__attribute__((section("sfrs")));
volatile unsigned int        EMACxMADRSET ;//__attribute__((section("sfrs")));
volatile unsigned int        EMAC1MADRINV ;//__attribute__((section("sfrs")));
volatile unsigned int        EMACxMADRINV ;//__attribute__((section("sfrs")));
volatile unsigned int        EMAC1MWTD ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned MWTD:16;
  };
  struct {
    unsigned w:32;
  };
} __EMAC1MWTDbits_t;*/
volatile __EMAC1MWTDbits_t EMAC1MWTDbits ;//__asm__ ("EMAC1MWTD") ;//__attribute__((section("sfrs")));
volatile unsigned int        EMACxMWTD ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned MWTD:16;
  };
  struct {
    unsigned w:32;
  };
} __EMACxMWTDbits_t;*/
volatile __EMACxMWTDbits_t EMACxMWTDbits ;//__asm__ ("EMACxMWTD") ;//__attribute__((section("sfrs")));
volatile unsigned int        EMAC1MWTDCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        EMACxMWTDCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        EMAC1MWTDSET ;//__attribute__((section("sfrs")));
volatile unsigned int        EMACxMWTDSET ;//__attribute__((section("sfrs")));
volatile unsigned int        EMAC1MWTDINV ;//__attribute__((section("sfrs")));
volatile unsigned int        EMACxMWTDINV ;//__attribute__((section("sfrs")));
volatile unsigned int        EMAC1MRDD ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned MRDD:16;
  };
  struct {
    unsigned w:32;
  };
} __EMAC1MRDDbits_t;*/
volatile __EMAC1MRDDbits_t EMAC1MRDDbits ;//__asm__ ("EMAC1MRDD") ;//__attribute__((section("sfrs")));
volatile unsigned int        EMACxMRDD ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned MRDD:16;
  };
  struct {
    unsigned w:32;
  };
} __EMACxMRDDbits_t;*/
volatile __EMACxMRDDbits_t EMACxMRDDbits ;//__asm__ ("EMACxMRDD") ;//__attribute__((section("sfrs")));
volatile unsigned int        EMAC1MRDDCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        EMACxMRDDCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        EMAC1MRDDSET ;//__attribute__((section("sfrs")));
volatile unsigned int        EMACxMRDDSET ;//__attribute__((section("sfrs")));
volatile unsigned int        EMAC1MRDDINV ;//__attribute__((section("sfrs")));
volatile unsigned int        EMACxMRDDINV ;//__attribute__((section("sfrs")));
volatile unsigned int        EMAC1MIND ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned MIIMBUSY:1;
    unsigned SCAN:1;
    unsigned NOTVALID:1;
    unsigned LINKFAIL:1;
  };
  struct {
    unsigned w:32;
  };
} __EMAC1MINDbits_t;*/
volatile __EMAC1MINDbits_t EMAC1MINDbits ;//__asm__ ("EMAC1MIND") ;//__attribute__((section("sfrs")));
volatile unsigned int        EMACxMIND ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned MIIMBUSY:1;
    unsigned SCAN:1;
    unsigned NOTVALID:1;
    unsigned LINKFAIL:1;
  };
  struct {
    unsigned w:32;
  };
} __EMACxMINDbits_t;*/
volatile __EMACxMINDbits_t EMACxMINDbits ;//__asm__ ("EMACxMIND") ;//__attribute__((section("sfrs")));
volatile unsigned int        EMAC1MINDCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        EMACxMINDCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        EMAC1MINDSET ;//__attribute__((section("sfrs")));
volatile unsigned int        EMACxMINDSET ;//__attribute__((section("sfrs")));
volatile unsigned int        EMAC1MINDINV ;//__attribute__((section("sfrs")));
volatile unsigned int        EMACxMINDINV ;//__attribute__((section("sfrs")));
volatile unsigned int        EMAC1SA0 ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned STNADDR5:8;
    unsigned STNADDR6:8;
  };
  struct {
    unsigned w:32;
  };
} __EMAC1SA0bits_t;*/
volatile __EMAC1SA0bits_t EMAC1SA0bits ;//__asm__ ("EMAC1SA0") ;//__attribute__((section("sfrs")));
volatile unsigned int        EMACxSA0 ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned STNADDR5:8;
    unsigned STNADDR6:8;
  };
  struct {
    unsigned w:32;
  };
} __EMACxSA0bits_t;*/
volatile __EMACxSA0bits_t EMACxSA0bits ;//__asm__ ("EMACxSA0") ;//__attribute__((section("sfrs")));
volatile unsigned int        EMAC1SA0CLR ;//__attribute__((section("sfrs")));
volatile unsigned int        EMACxSA0CLR ;//__attribute__((section("sfrs")));
volatile unsigned int        EMAC1SA0SET ;//__attribute__((section("sfrs")));
volatile unsigned int        EMACxSA0SET ;//__attribute__((section("sfrs")));
volatile unsigned int        EMAC1SA0INV ;//__attribute__((section("sfrs")));
volatile unsigned int        EMACxSA0INV ;//__attribute__((section("sfrs")));
volatile unsigned int        EMAC1SA1 ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned STNADDR3:8;
    unsigned STNADDR4:8;
  };
  struct {
    unsigned w:32;
  };
} __EMAC1SA1bits_t;*/
volatile __EMAC1SA1bits_t EMAC1SA1bits ;//__asm__ ("EMAC1SA1") ;//__attribute__((section("sfrs")));
volatile unsigned int        EMACxSA1 ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned STNADDR3:8;
    unsigned STNADDR4:8;
  };
  struct {
    unsigned w:32;
  };
} __EMACxSA1bits_t;*/
volatile __EMACxSA1bits_t EMACxSA1bits ;//__asm__ ("EMACxSA1") ;//__attribute__((section("sfrs")));
volatile unsigned int        EMAC1SA1CLR ;//__attribute__((section("sfrs")));
volatile unsigned int        EMACxSA1CLR ;//__attribute__((section("sfrs")));
volatile unsigned int        EMAC1SA1SET ;//__attribute__((section("sfrs")));
volatile unsigned int        EMACxSA1SET ;//__attribute__((section("sfrs")));
volatile unsigned int        EMAC1SA1INV ;//__attribute__((section("sfrs")));
volatile unsigned int        EMACxSA1INV ;//__attribute__((section("sfrs")));
volatile unsigned int        EMAC1SA2 ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned STNADDR1:8;
    unsigned STNADDR2:8;
  };
  struct {
    unsigned w:32;
  };
} __EMAC1SA2bits_t;*/
volatile __EMAC1SA2bits_t EMAC1SA2bits ;//__asm__ ("EMAC1SA2") ;//__attribute__((section("sfrs")));
volatile unsigned int        EMACxSA2 ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned STNADDR1:8;
    unsigned STNADDR2:8;
  };
  struct {
    unsigned w:32;
  };
} __EMACxSA2bits_t;*/
volatile __EMACxSA2bits_t EMACxSA2bits ;//__asm__ ("EMACxSA2") ;//__attribute__((section("sfrs")));
volatile unsigned int        EMAC1SA2CLR ;//__attribute__((section("sfrs")));
volatile unsigned int        EMACxSA2CLR ;//__attribute__((section("sfrs")));
volatile unsigned int        EMAC1SA2SET ;//__attribute__((section("sfrs")));
volatile unsigned int        EMACxSA2SET ;//__attribute__((section("sfrs")));
volatile unsigned int        EMAC1SA2INV ;//__attribute__((section("sfrs")));
volatile unsigned int        EMACxSA2INV ;//__attribute__((section("sfrs")));
volatile unsigned int        USBCRCON ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned USBWKUPEN:1;
  unsigned USBRIE:1;
  unsigned USBIE:1;
  unsigned SENDMONEN:1;
  unsigned BSVALMONEN:1;
  unsigned ASVALMONEN:1;
  unsigned VBUSMONEN:1;
  unsigned PHYIDEN:1;
  unsigned USBIDVAL:1;
  unsigned USBIDOVEN:1;
  unsigned :14;
  unsigned USBWKUP:1;
  unsigned USBRF:1;
  unsigned USBIF:1;
} __USBCRCONbits_t;*/
volatile __USBCRCONbits_t USBCRCONbits ;//__asm__ ("USBCRCON") ;//__attribute__((section("sfrs")));
volatile unsigned int        PRECON ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned PFMWS:3;
  unsigned :1;
  unsigned PREFEN:2;
  unsigned :20;
  unsigned PFMSECEN:1;
} __PRECONbits_t;*/
