HomuraVehicle/homuraLib_v2/machine/device/p32mz2048efg100_forVC.c
volatile __PRECONbits_t PRECONbits ;//__asm__ ("PRECON") ;//__attribute__((section("sfrs")));
volatile unsigned int        PRECONCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        PRECONSET ;//__attribute__((section("sfrs")));
volatile unsigned int        PRECONINV ;//__attribute__((section("sfrs")));
volatile unsigned int        PRESTAT ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned PFMSECCNT:8;
  unsigned :18;
  unsigned PFMSEC:1;
  unsigned PFMDED:1;
} __PRESTATbits_t;*/
volatile __PRESTATbits_t PRESTATbits ;//__asm__ ("PRESTAT") ;//__attribute__((section("sfrs")));
volatile unsigned int        PRESTATCLR ;//__attribute__((section("sfrs")));
volatile unsigned int        PRESTATSET ;//__attribute__((section("sfrs")));
volatile unsigned int        PRESTATINV ;//__attribute__((section("sfrs")));
volatile unsigned int        EBICS0 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned :16;
  unsigned CSADDR:16;
} __EBICS0bits_t;*/
volatile __EBICS0bits_t EBICS0bits ;//__asm__ ("EBICS0") ;//__attribute__((section("sfrs")));
volatile unsigned int        EBICS1 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned :16;
  unsigned CSADDR:16;
} __EBICS1bits_t;*/
volatile __EBICS1bits_t EBICS1bits ;//__asm__ ("EBICS1") ;//__attribute__((section("sfrs")));
volatile unsigned int        EBICS2 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned :16;
  unsigned CSADDR:16;
} __EBICS2bits_t;*/
volatile __EBICS2bits_t EBICS2bits ;//__asm__ ("EBICS2") ;//__attribute__((section("sfrs")));
volatile unsigned int        EBICS3 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned :16;
  unsigned CSADDR:16;
} __EBICS3bits_t;*/
volatile __EBICS3bits_t EBICS3bits ;//__asm__ ("EBICS3") ;//__attribute__((section("sfrs")));
volatile unsigned int        EBIMSK0 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned MEMSIZE:5;
  unsigned MEMTYPE:3;
  unsigned REGSEL:3;
} __EBIMSK0bits_t;*/
volatile __EBIMSK0bits_t EBIMSK0bits ;//__asm__ ("EBIMSK0") ;//__attribute__((section("sfrs")));
volatile unsigned int        EBIMSK1 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned MEMSIZE:5;
  unsigned MEMTYPE:3;
  unsigned REGSEL:3;
} __EBIMSK1bits_t;*/
volatile __EBIMSK1bits_t EBIMSK1bits ;//__asm__ ("EBIMSK1") ;//__attribute__((section("sfrs")));
volatile unsigned int        EBIMSK2 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned MEMSIZE:5;
  unsigned MEMTYPE:3;
  unsigned REGSEL:3;
} __EBIMSK2bits_t;*/
volatile __EBIMSK2bits_t EBIMSK2bits ;//__asm__ ("EBIMSK2") ;//__attribute__((section("sfrs")));
volatile unsigned int        EBIMSK3 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned MEMSIZE:5;
  unsigned MEMTYPE:3;
  unsigned REGSEL:3;
} __EBIMSK3bits_t;*/
volatile __EBIMSK3bits_t EBIMSK3bits ;//__asm__ ("EBIMSK3") ;//__attribute__((section("sfrs")));
volatile unsigned int        EBISMT0 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned TRC:6;
  unsigned TAS:2;
  unsigned TWR:2;
  unsigned TWP:6;
  unsigned TBTA:3;
  unsigned TPRC:4;
  unsigned PAGEMODE:1;
  unsigned PAGESIZE:2;
  unsigned RDYMODE:1;
} __EBISMT0bits_t;*/
volatile __EBISMT0bits_t EBISMT0bits ;//__asm__ ("EBISMT0") ;//__attribute__((section("sfrs")));
volatile unsigned int        EBISMT1 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned TRC:6;
  unsigned TAS:2;
  unsigned TWR:2;
  unsigned TWP:6;
  unsigned TBTA:3;
  unsigned TPRC:4;
  unsigned PAGEMODE:1;
  unsigned PAGESIZE:2;
  unsigned RDYMODE:1;
} __EBISMT1bits_t;*/
volatile __EBISMT1bits_t EBISMT1bits ;//__asm__ ("EBISMT1") ;//__attribute__((section("sfrs")));
volatile unsigned int        EBISMT2 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned TRC:6;
  unsigned TAS:2;
  unsigned TWR:2;
  unsigned TWP:6;
  unsigned TBTA:3;
  unsigned TPRC:4;
  unsigned PAGEMODE:1;
  unsigned PAGESIZE:2;
  unsigned RDYMODE:1;
} __EBISMT2bits_t;*/
volatile __EBISMT2bits_t EBISMT2bits ;//__asm__ ("EBISMT2") ;//__attribute__((section("sfrs")));
volatile unsigned int        EBIFTRPD ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned TRPD:31;
} __EBIFTRPDbits_t;*/
volatile __EBIFTRPDbits_t EBIFTRPDbits ;//__asm__ ("EBIFTRPD") ;//__attribute__((section("sfrs")));
volatile unsigned int        EBISMCON ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned SMRP:1;
  unsigned :6;
  unsigned SMDWIDTH0:3;
  unsigned SMDWIDTH1:3;
  unsigned SMDWIDTH2:3;
} __EBISMCONbits_t;*/
volatile __EBISMCONbits_t EBISMCONbits ;//__asm__ ("EBISMCON") ;//__attribute__((section("sfrs")));
volatile unsigned int        SQI1XCON1 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned TYPECMD:2;
  unsigned TYPEADDR:2;
  unsigned TYPEMODE:2;
  unsigned TYPEDUMMY:2;
  unsigned TYPEDATA:2;
  unsigned READOPCODE:8;
  unsigned ADDRBYTES:3;
  unsigned DUMMYBYTES:3;
  unsigned DDRCMD:1;
  unsigned DDRADDR:1;
  unsigned DDRMODE:1;
  unsigned DDRDUMMY:1;
  unsigned DDRDATA:1;
  unsigned SDRCMD:1;
} __SQI1XCON1bits_t;*/
volatile __SQI1XCON1bits_t SQI1XCON1bits ;//__asm__ ("SQI1XCON1") ;//__attribute__((section("sfrs")));
volatile unsigned int        SQI1XCON2 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned MODECODE:8;
  unsigned MODEBYTES:2;
  unsigned DEVSEL:2;
} __SQI1XCON2bits_t;*/
volatile __SQI1XCON2bits_t SQI1XCON2bits ;//__asm__ ("SQI1XCON2") ;//__attribute__((section("sfrs")));
volatile unsigned int        SQI1CFG ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned MODE:3;
  unsigned CPHA:1;
  unsigned CPOL:1;
  unsigned LSBF:1;
  unsigned :3;
  unsigned WP:1;
  unsigned HOLD:1;
  unsigned :1;
  unsigned BURSTEN:1;
  unsigned :3;
  unsigned RESET:1;
  unsigned TXBUFRST:1;
  unsigned RXBUFRST:1;
  unsigned CONBUFRST:1;
  unsigned DATAEN:2;
  unsigned :1;
  unsigned SQIEN:1;
  unsigned CSEN:2;
} __SQI1CFGbits_t;*/
volatile __SQI1CFGbits_t SQI1CFGbits ;//__asm__ ("SQI1CFG") ;//__attribute__((section("sfrs")));
volatile unsigned int        SQI1CON ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned TXRXCOUNT:16;
  unsigned CMDINIT:2;
  unsigned LANEMODE:2;
  unsigned DEVSEL:2;
  unsigned DASSERT:1;
  unsigned DDRMODE:1;
  unsigned SCHECK:1;
} __SQI1CONbits_t;*/
volatile __SQI1CONbits_t SQI1CONbits ;//__asm__ ("SQI1CON") ;//__attribute__((section("sfrs")));
volatile unsigned int        SQI1CLKCON ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned EN:1;
  unsigned STABLE:1;
  unsigned :6;
  unsigned CLKDIV:11;
} __SQI1CLKCONbits_t;*/
volatile __SQI1CLKCONbits_t SQI1CLKCONbits ;//__asm__ ("SQI1CLKCON") ;//__attribute__((section("sfrs")));
volatile unsigned int        SQI1CMDTHR ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned RXCMDTHR:6;
  unsigned :2;
  unsigned TXCMDTHR:6;
} __SQI1CMDTHRbits_t;*/
volatile __SQI1CMDTHRbits_t SQI1CMDTHRbits ;//__asm__ ("SQI1CMDTHR") ;//__attribute__((section("sfrs")));
volatile unsigned int        SQI1INTTHR ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned RXINTTHR:6;
  unsigned :2;
  unsigned TXINTTHR:6;
} __SQI1INTTHRbits_t;*/
volatile __SQI1INTTHRbits_t SQI1INTTHRbits ;//__asm__ ("SQI1INTTHR") ;//__attribute__((section("sfrs")));
volatile unsigned int        SQI1INTEN ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned TXEMPTYIE:1;
  unsigned TXFULLIE:1;
  unsigned TXTHRIE:1;
  unsigned RXEMPTYIE:1;
  unsigned RXFULLIE:1;
  unsigned RXTHRIE:1;
  unsigned CONFULLIE:1;
  unsigned CONEMPTYIE:1;
  unsigned CONTHRIE:1;
  unsigned BDDONEIE:1;
  unsigned PKTCOMPIE:1;
  unsigned DMAEIE:1;
} __SQI1INTENbits_t;*/
