HomuraVehicle/homuraLib_v2/machine/device/p32mz2048efg100_forVC.c
volatile __SQI1INTENbits_t SQI1INTENbits ;//__asm__ ("SQI1INTEN") ;//__attribute__((section("sfrs")));
volatile unsigned int        SQI1INTSTAT ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned TXEMPTYIF:1;
  unsigned TXFULLIF:1;
  unsigned TXTHRIF:1;
  unsigned RXEMPTYIF:1;
  unsigned RXFULLIF:1;
  unsigned RXTHRIF:1;
  unsigned CONFULLIF:1;
  unsigned CONEMPTYIF:1;
  unsigned CONTHRIF:1;
  unsigned BDDONEIF:1;
  unsigned PKTCOMPIF:1;
  unsigned DMAEIF:1;
} __SQI1INTSTATbits_t;*/
volatile __SQI1INTSTATbits_t SQI1INTSTATbits ;//__asm__ ("SQI1INTSTAT") ;//__attribute__((section("sfrs")));
volatile unsigned int        SQI1TXDATA ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned TXDATA:32;
} __SQI1TXDATAbits_t;*/
volatile __SQI1TXDATAbits_t SQI1TXDATAbits ;//__asm__ ("SQI1TXDATA") ;//__attribute__((section("sfrs")));
volatile unsigned int        SQI1RXDATA ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned RXDATA:32;
} __SQI1RXDATAbits_t;*/
volatile __SQI1RXDATAbits_t SQI1RXDATAbits ;//__asm__ ("SQI1RXDATA") ;//__attribute__((section("sfrs")));
volatile unsigned int        SQI1STAT1 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned RXBUFCNT:6;
  unsigned :10;
  unsigned TXBUFFREE:6;
} __SQI1STAT1bits_t;*/
volatile __SQI1STAT1bits_t SQI1STAT1bits ;//__asm__ ("SQI1STAT1") ;//__attribute__((section("sfrs")));
volatile unsigned int        SQI1STAT2 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned TXOV:1;
  unsigned RXUN:1;
  unsigned :1;
  unsigned SQID0:1;
  unsigned SQID1:1;
  unsigned SQID2:1;
  unsigned SQID3:1;
  unsigned CONAVAIL:4;
  unsigned :5;
  unsigned CMDSTAT:2;
} __SQI1STAT2bits_t;*/
volatile __SQI1STAT2bits_t SQI1STAT2bits ;//__asm__ ("SQI1STAT2") ;//__attribute__((section("sfrs")));
volatile unsigned int        SQI1BDCON ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned DMAEN:1;
  unsigned POLLEN:1;
  unsigned START:1;
} __SQI1BDCONbits_t;*/
volatile __SQI1BDCONbits_t SQI1BDCONbits ;//__asm__ ("SQI1BDCON") ;//__attribute__((section("sfrs")));
volatile unsigned int        SQI1BDCURADD ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned BDCURRADDR:32;
} __SQI1BDCURADDbits_t;*/
volatile __SQI1BDCURADDbits_t SQI1BDCURADDbits ;//__asm__ ("SQI1BDCURADD") ;//__attribute__((section("sfrs")));
volatile unsigned int        SQI1BDBASEADD ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned BDADDR:32;
} __SQI1BDBASEADDbits_t;*/
volatile __SQI1BDBASEADDbits_t SQI1BDBASEADDbits ;//__asm__ ("SQI1BDBASEADD") ;//__attribute__((section("sfrs")));
volatile unsigned int        SQI1BDSTAT ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned BDCON:16;
  unsigned DMAACTV:1;
  unsigned DMASTART:1;
  unsigned BDSTATE:4;
} __SQI1BDSTATbits_t;*/
volatile __SQI1BDSTATbits_t SQI1BDSTATbits ;//__asm__ ("SQI1BDSTAT") ;//__attribute__((section("sfrs")));
volatile unsigned int        SQI1BDPOLLCON ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned POLLCON:16;
} __SQI1BDPOLLCONbits_t;*/
volatile __SQI1BDPOLLCONbits_t SQI1BDPOLLCONbits ;//__asm__ ("SQI1BDPOLLCON") ;//__attribute__((section("sfrs")));
volatile unsigned int        SQI1BDTXDSTAT ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned TXCURBUFLEN:9;
  unsigned :7;
  unsigned TXBUFCNT:5;
  unsigned :4;
  unsigned TXSTATE:4;
} __SQI1BDTXDSTATbits_t;*/
volatile __SQI1BDTXDSTATbits_t SQI1BDTXDSTATbits ;//__asm__ ("SQI1BDTXDSTAT") ;//__attribute__((section("sfrs")));
volatile unsigned int        SQI1BDRXDSTAT ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned RXCURBUFLEN:9;
  unsigned :7;
  unsigned RXBUFCNT:5;
  unsigned :4;
  unsigned RXSTATE:4;
} __SQI1BDRXDSTATbits_t;*/
volatile __SQI1BDRXDSTATbits_t SQI1BDRXDSTATbits ;//__asm__ ("SQI1BDRXDSTAT") ;//__attribute__((section("sfrs")));
volatile unsigned int        SQI1THR ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned THRES:4;
} __SQI1THRbits_t;*/
volatile __SQI1THRbits_t SQI1THRbits ;//__asm__ ("SQI1THR") ;//__attribute__((section("sfrs")));
volatile unsigned int        SQI1INTSIGEN ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned TXEMPTYISE:1;
  unsigned TXFULLISE:1;
  unsigned TXTHRISE:1;
  unsigned RXEMPTYISE:1;
  unsigned RXFULLISE:1;
  unsigned RXTHRISE:1;
  unsigned CONFULLISE:1;
  unsigned CONEMPTYISE:1;
  unsigned CONTHRISE:1;
  unsigned BDDONEISE:1;
  unsigned PKTCOMPISE:1;
  unsigned DMAEISE:1;
} __SQI1INTSIGENbits_t;*/
volatile __SQI1INTSIGENbits_t SQI1INTSIGENbits ;//__asm__ ("SQI1INTSIGEN") ;//__attribute__((section("sfrs")));
volatile unsigned int        SQI1TAPCON ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned CLKOUTDLY:4;
  unsigned DATAOUTDLY:4;
  unsigned SDRCLKINDLY:6;
} __SQI1TAPCONbits_t;*/
volatile __SQI1TAPCONbits_t SQI1TAPCONbits ;//__asm__ ("SQI1TAPCON") ;//__attribute__((section("sfrs")));
volatile unsigned int        SQI1MEMSTAT ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned STATCMD:16;
  unsigned STATBYTES:2;
  unsigned STATTYPE:2;
  unsigned STATPOS:1;
} __SQI1MEMSTATbits_t;*/
volatile __SQI1MEMSTATbits_t SQI1MEMSTATbits ;//__asm__ ("SQI1MEMSTAT") ;//__attribute__((section("sfrs")));
volatile unsigned int        SQI1XCON3 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned INIT1CMD1:8;
  unsigned INIT1CMD2:8;
  unsigned INIT1CMD3:8;
  unsigned INIT1TYPE:2;
  unsigned INIT1COUNT:2;
  unsigned INIT1SCHECK:1;
} __SQI1XCON3bits_t;*/
volatile __SQI1XCON3bits_t SQI1XCON3bits ;//__asm__ ("SQI1XCON3") ;//__attribute__((section("sfrs")));
volatile unsigned int        SQI1XCON4 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned INIT2CMD1:8;
  unsigned INIT2CMD2:8;
  unsigned INIT2CMD3:8;
  unsigned INIT2TYPE:2;
  unsigned INIT2COUNT:2;
  unsigned INIT2SCHECK:1;
} __SQI1XCON4bits_t;*/
volatile __SQI1XCON4bits_t SQI1XCON4bits ;//__asm__ ("SQI1XCON4") ;//__attribute__((section("sfrs")));
volatile unsigned int        USBCSR0 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned FUNC:7;
  unsigned :1;
  unsigned SUSPEN:1;
  unsigned SUSPMODE:1;
  unsigned RESUME:1;
  unsigned RESET:1;
  unsigned HSMODE:1;
  unsigned HSEN:1;
  unsigned SOFTCONN:1;
  unsigned ISOUPD:1;
  unsigned EP0IF:1;
  unsigned EP1TXIF:1;
  unsigned EP2TXIF:1;
  unsigned EP3TXIF:1;
  unsigned EP4TXIF:1;
  unsigned EP5TXIF:1;
  unsigned EP6TXIF:1;
  unsigned EP7TXIF:1;
} __USBCSR0bits_t;*/
volatile __USBCSR0bits_t USBCSR0bits ;//__asm__ ("USBCSR0") ;//__attribute__((section("sfrs")));
volatile unsigned int        USBCSR1 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned :1;
  unsigned EP1RXIF:1;
  unsigned EP2RXIF:1;
  unsigned EP3RXIF:1;
  unsigned EP4RXIF:1;
  unsigned EP5RXIF:1;
  unsigned EP6RXIF:1;
  unsigned EP7RXIF:1;
  unsigned :8;
  unsigned EP0IE:1;
  unsigned EP1TXIE:1;
  unsigned EP2TXIE:1;
  unsigned EP3TXIE:1;
  unsigned EP4TXIE:1;
  unsigned EP5TXIE:1;
  unsigned EP6TXIE:1;
  unsigned EP7TXIE:1;
} __USBCSR1bits_t;*/
volatile __USBCSR1bits_t USBCSR1bits ;//__asm__ ("USBCSR1") ;//__attribute__((section("sfrs")));
volatile unsigned int        USBCSR2 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned :1;
  unsigned EP1RXIE:1;
  unsigned EP2RXIE:1;
  unsigned EP3RXIE:1;
  unsigned EP4RXIE:1;
  unsigned EP5RXIE:1;
  unsigned EP6RXIE:1;
  unsigned EP7RXIE:1;
  unsigned :8;
  unsigned SUSPIF:1;
  unsigned RESUMEIF:1;
  unsigned RESETIF:1;
  unsigned SOFIF:1;
  unsigned CONNIF:1;
  unsigned DISCONIF:1;
  unsigned SESSRQIF:1;
  unsigned VBUSERRIF:1;
  unsigned SUSPIE:1;
  unsigned RESUMEIE:1;
  unsigned RESETIE:1;
  unsigned SOFIE:1;
  unsigned CONNIE:1;
  unsigned DISCONIE:1;
  unsigned SESSRQIE:1;
  unsigned VBUSERRIE:1;
} __USBCSR2bits_t;*/
volatile __USBCSR2bits_t USBCSR2bits ;//__asm__ ("USBCSR2") ;//__attribute__((section("sfrs")));
volatile unsigned int        USBCSR3 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned RFRMNUM:11;
  unsigned :5;
  unsigned ENDPOINT:4;
  unsigned :4;
  unsigned NAK:1;
  unsigned TESTJ:1;
  unsigned TESTK:1;
  unsigned PACKET:1;
  unsigned FORCEHS:1;
  unsigned FORCEFS:1;
  unsigned FIFOACC:1;
  unsigned FORCEHST:1;
} __USBCSR3bits_t;*/
volatile __USBCSR3bits_t USBCSR3bits ;//__asm__ ("USBCSR3") ;//__attribute__((section("sfrs")));
volatile unsigned int        USBIENCSR0 ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned TXMAXP:11;
    unsigned MULT:5;
    unsigned TXPKTRDY:1;
    unsigned FIFONE:1;
    unsigned ERROR:1;
    unsigned FLUSH:1;
    unsigned SETUPPKT:1;
    unsigned RXSTALL:1;
    unsigned CLRDT:1;
    unsigned NAKTMOUT:1;
    unsigned DATATGGL:1;
    unsigned DTWREN:1;
    unsigned DMAREQMD:1;
    unsigned FRCDATTG:1;
    unsigned DMAREQEN:1;
    unsigned MODE:1;
    unsigned :1;
    unsigned AUTOSET:1;
  };
  struct {
    unsigned :18;
    unsigned UNDERRUN:1;
    unsigned :1;
    unsigned SENDSTALL:1;
    unsigned SENTSTALL:1;
    unsigned :1;
    unsigned INCOMPTX:1;
    unsigned :6;
    unsigned ISO:1;
  };
} __USBIENCSR0bits_t;*/
volatile __USBIENCSR0bits_t USBIENCSR0bits ;//__asm__ ("USBIENCSR0") ;//__attribute__((section("sfrs")));
volatile unsigned int        USBIENCSR1 ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned RXMAXP:11;
    unsigned MULT:5;
    unsigned RXPKTRDY:1;
    unsigned FIFOFULL:1;
    unsigned ERROR:1;
    unsigned DERRNAKT:1;
    unsigned FLUSH:1;
    unsigned REQPKT:1;
    unsigned RXSTALL:1;
    unsigned CLRDT:1;
    unsigned INCOMPRX:1;
    unsigned DATATGGL:1;
    unsigned DATATWEN:1;
    unsigned DMAREQMD:1;
    unsigned PIDERR:1;
    unsigned DMAREQEN:1;
    unsigned AUTORQ:1;
    unsigned AUTOCLR:1;
  };
  struct {
    unsigned :18;
    unsigned OVERRUN:1;
    unsigned DATAERR:1;
    unsigned :1;
    unsigned SENDSTALL:1;
    unsigned SENTSTALL:1;
    unsigned :5;
    unsigned DISNYET:1;
    unsigned :1;
    unsigned ISO:1;
  };
} __USBIENCSR1bits_t;*/
volatile __USBIENCSR1bits_t USBIENCSR1bits ;//__asm__ ("USBIENCSR1") ;//__attribute__((section("sfrs")));
volatile unsigned int        USBIENCSR2 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned RXCNT:14;
  unsigned :2;
  unsigned TEP:4;
  unsigned PROTOCOL:2;
  unsigned SPEED:2;
  unsigned TXINTERV:8;
} __USBIENCSR2bits_t;*/
volatile __USBIENCSR2bits_t USBIENCSR2bits ;//__asm__ ("USBIENCSR2") ;//__attribute__((section("sfrs")));
volatile unsigned int        USBIENCSR3 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned TEP:4;
  unsigned PROTOCOL:2;
  unsigned SPEED:2;
  unsigned RXINTERV:8;
  unsigned :8;
  unsigned TXFIFOSZ:4;
  unsigned RXFIFOSZ:4;
} __USBIENCSR3bits_t;*/
volatile __USBIENCSR3bits_t USBIENCSR3bits ;//__asm__ ("USBIENCSR3") ;//__attribute__((section("sfrs")));
volatile unsigned int        USBFIFO0 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned DATA:32;
} __USBFIFO0bits_t;*/
volatile __USBFIFO0bits_t USBFIFO0bits ;//__asm__ ("USBFIFO0") ;//__attribute__((section("sfrs")));
volatile unsigned int        USBFIFO1 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned DATA:32;
} __USBFIFO1bits_t;*/
