HomuraVehicle/homuraLib_v2/machine/device/p32mz2048efg100_forVC.c
volatile __USBFIFO1bits_t USBFIFO1bits ;//__asm__ ("USBFIFO1") ;//__attribute__((section("sfrs")));
volatile unsigned int        USBFIFO2 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned DATA:32;
} __USBFIFO2bits_t;*/
volatile __USBFIFO2bits_t USBFIFO2bits ;//__asm__ ("USBFIFO2") ;//__attribute__((section("sfrs")));
volatile unsigned int        USBFIFO3 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned DATA:32;
} __USBFIFO3bits_t;*/
volatile __USBFIFO3bits_t USBFIFO3bits ;//__asm__ ("USBFIFO3") ;//__attribute__((section("sfrs")));
volatile unsigned int        USBFIFO4 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned DATA:32;
} __USBFIFO4bits_t;*/
volatile __USBFIFO4bits_t USBFIFO4bits ;//__asm__ ("USBFIFO4") ;//__attribute__((section("sfrs")));
volatile unsigned int        USBFIFO5 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned DATA:32;
} __USBFIFO5bits_t;*/
volatile __USBFIFO5bits_t USBFIFO5bits ;//__asm__ ("USBFIFO5") ;//__attribute__((section("sfrs")));
volatile unsigned int        USBFIFO6 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned DATA:32;
} __USBFIFO6bits_t;*/
volatile __USBFIFO6bits_t USBFIFO6bits ;//__asm__ ("USBFIFO6") ;//__attribute__((section("sfrs")));
volatile unsigned int        USBFIFO7 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned DATA:32;
} __USBFIFO7bits_t;*/
volatile __USBFIFO7bits_t USBFIFO7bits ;//__asm__ ("USBFIFO7") ;//__attribute__((section("sfrs")));
volatile unsigned int        USBOTG ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned SESSION:1;
  unsigned HOSTREQ:1;
  unsigned HOSTMODE:1;
  unsigned VBUS:2;
  unsigned LSDEV:1;
  unsigned FSDEV:1;
  unsigned BDEV:1;
  unsigned RXEDMA:1;
  unsigned TXEDMA:1;
  unsigned :6;
  unsigned TXFIFOSZ:4;
  unsigned TXDPB:1;
  unsigned :3;
  unsigned RXFIFOSZ:4;
  unsigned RXDPB:1;
} __USBOTGbits_t;*/
volatile __USBOTGbits_t USBOTGbits ;//__asm__ ("USBOTG") ;//__attribute__((section("sfrs")));
volatile unsigned int        USBFIFOA ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned TXFIFOAD:13;
  unsigned :3;
  unsigned RXFIFOAD:13;
} __USBFIFOAbits_t;*/
volatile __USBFIFOAbits_t USBFIFOAbits ;//__asm__ ("USBFIFOA") ;//__attribute__((section("sfrs")));
volatile unsigned int        USBHWVER ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned VERMINOR:10;
  unsigned VERMAJOR:5;
  unsigned RC:1;
} __USBHWVERbits_t;*/
volatile __USBHWVERbits_t USBHWVERbits ;//__asm__ ("USBHWVER") ;//__attribute__((section("sfrs")));
volatile unsigned int        USBINFO ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned TXENDPTS:4;
  unsigned RXENDPTS:4;
  unsigned RAMBITS:4;
  unsigned DMACHANS:4;
  unsigned WTID:4;
  unsigned WTCON:4;
  unsigned VPLEN:8;
} __USBINFObits_t;*/
volatile __USBINFObits_t USBINFObits ;//__asm__ ("USBINFO") ;//__attribute__((section("sfrs")));
volatile unsigned int        USBEOFRST ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned HSEOF:8;
  unsigned FSEOF:8;
  unsigned LSEOF:8;
  unsigned SOFRST:8;
} __USBEOFRSTbits_t;*/
volatile __USBEOFRSTbits_t USBEOFRSTbits ;//__asm__ ("USBEOFRST") ;//__attribute__((section("sfrs")));
volatile unsigned int        USBE0TXA ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned TXFADDR:7;
  unsigned :9;
  unsigned TXHUBADD:7;
  unsigned MULTTRAN:1;
  unsigned TXHUBPRT:7;
} __USBE0TXAbits_t;*/
volatile __USBE0TXAbits_t USBE0TXAbits ;//__asm__ ("USBE0TXA") ;//__attribute__((section("sfrs")));
volatile unsigned int        USBE0RXA ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned :16;
  unsigned RXHUBADD:7;
  unsigned MULTTRAN:1;
  unsigned RXHUBPRT:7;
} __USBE0RXAbits_t;*/
volatile __USBE0RXAbits_t USBE0RXAbits ;//__asm__ ("USBE0RXA") ;//__attribute__((section("sfrs")));
volatile unsigned int        USBE1TXA ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned TXFADDR:7;
  unsigned :9;
  unsigned TXHUBADD:7;
  unsigned MULTTRAN:1;
  unsigned TXHUBPRT:7;
} __USBE1TXAbits_t;*/
volatile __USBE1TXAbits_t USBE1TXAbits ;//__asm__ ("USBE1TXA") ;//__attribute__((section("sfrs")));
volatile unsigned int        USBE1RXA ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned RXFADDR:7;
  unsigned :9;
  unsigned RXHUBADD:7;
  unsigned MULTTRAN:1;
  unsigned RXHUBPRT:7;
} __USBE1RXAbits_t;*/
volatile __USBE1RXAbits_t USBE1RXAbits ;//__asm__ ("USBE1RXA") ;//__attribute__((section("sfrs")));
volatile unsigned int        USBE2TXA ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned TXFADDR:7;
  unsigned :9;
  unsigned TXHUBADD:7;
  unsigned MULTTRAN:1;
  unsigned TXHUBPRT:7;
} __USBE2TXAbits_t;*/
volatile __USBE2TXAbits_t USBE2TXAbits ;//__asm__ ("USBE2TXA") ;//__attribute__((section("sfrs")));
volatile unsigned int        USBE2RXA ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned RXFADDR:7;
  unsigned :9;
  unsigned RXHUBADD:7;
  unsigned MULTTRAN:1;
  unsigned RXHUBPRT:7;
} __USBE2RXAbits_t;*/
volatile __USBE2RXAbits_t USBE2RXAbits ;//__asm__ ("USBE2RXA") ;//__attribute__((section("sfrs")));
volatile unsigned int        USBE3TXA ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned TXFADDR:7;
  unsigned :9;
  unsigned TXHUBADD:7;
  unsigned MULTTRAN:1;
  unsigned TXHUBPRT:7;
} __USBE3TXAbits_t;*/
volatile __USBE3TXAbits_t USBE3TXAbits ;//__asm__ ("USBE3TXA") ;//__attribute__((section("sfrs")));
volatile unsigned int        USBE3RXA ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned RXFADDR:7;
  unsigned :9;
  unsigned RXHUBADD:7;
  unsigned MULTTRAN:1;
  unsigned RXHUBPRT:7;
} __USBE3RXAbits_t;*/
volatile __USBE3RXAbits_t USBE3RXAbits ;//__asm__ ("USBE3RXA") ;//__attribute__((section("sfrs")));
volatile unsigned int        USBE4TXA ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned TXFADDR:7;
  unsigned :9;
  unsigned TXHUBADD:7;
  unsigned MULTTRAN:1;
  unsigned TXHUBPRT:7;
} __USBE4TXAbits_t;*/
