HomuraVehicle/homuraLib_v2/machine/device/p32mz2048efg100_forVC.c
volatile __USBE4TXAbits_t USBE4TXAbits ;//__asm__ ("USBE4TXA") ;//__attribute__((section("sfrs")));
volatile unsigned int        USBE4RXA ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned RXFADDR:7;
  unsigned :9;
  unsigned RXHUBADD:7;
  unsigned MULTTRAN:1;
  unsigned RXHUBPRT:7;
} __USBE4RXAbits_t;*/
volatile __USBE4RXAbits_t USBE4RXAbits ;//__asm__ ("USBE4RXA") ;//__attribute__((section("sfrs")));
volatile unsigned int        USBE5TXA ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned TXFADDR:7;
  unsigned :9;
  unsigned TXHUBADD:7;
  unsigned MULTTRAN:1;
  unsigned TXHUBPRT:7;
} __USBE5TXAbits_t;*/
volatile __USBE5TXAbits_t USBE5TXAbits ;//__asm__ ("USBE5TXA") ;//__attribute__((section("sfrs")));
volatile unsigned int        USBE5RXA ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned RXFADDR:7;
  unsigned :9;
  unsigned RXHUBADD:7;
  unsigned MULTTRAN:1;
  unsigned RXHUBPRT:7;
} __USBE5RXAbits_t;*/
volatile __USBE5RXAbits_t USBE5RXAbits ;//__asm__ ("USBE5RXA") ;//__attribute__((section("sfrs")));
volatile unsigned int        USBE6TXA ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned TXFADDR:7;
  unsigned :9;
  unsigned TXHUBADD:7;
  unsigned MULTTRAN:1;
  unsigned TXHUBPRT:7;
} __USBE6TXAbits_t;*/
volatile __USBE6TXAbits_t USBE6TXAbits ;//__asm__ ("USBE6TXA") ;//__attribute__((section("sfrs")));
volatile unsigned int        USBE6RXA ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned RXFADDR:7;
  unsigned :9;
  unsigned RXHUBADD:7;
  unsigned MULTTRAN:1;
  unsigned RXHUBPRT:7;
} __USBE6RXAbits_t;*/
volatile __USBE6RXAbits_t USBE6RXAbits ;//__asm__ ("USBE6RXA") ;//__attribute__((section("sfrs")));
volatile unsigned int        USBE7TXA ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned TXFADDR:7;
  unsigned :9;
  unsigned TXHUBADD:7;
  unsigned MULTTRAN:1;
  unsigned TXHUBPRT:7;
} __USBE7TXAbits_t;*/
volatile __USBE7TXAbits_t USBE7TXAbits ;//__asm__ ("USBE7TXA") ;//__attribute__((section("sfrs")));
volatile unsigned int        USBE7RXA ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned RXFADDR:7;
  unsigned :9;
  unsigned RXHUBADD:7;
  unsigned MULTTRAN:1;
  unsigned RXHUBPRT:7;
} __USBE7RXAbits_t;*/
volatile __USBE7RXAbits_t USBE7RXAbits ;//__asm__ ("USBE7RXA") ;//__attribute__((section("sfrs")));
volatile unsigned int        USBE0CSR0 ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned TXMAXP:11;
    unsigned :5;
    unsigned RXRDY:1;
    unsigned TXRDY:1;
    unsigned STALLED:1;
    unsigned SETUP:1;
    unsigned ERROR:1;
    unsigned REQPKT:1;
    unsigned STATUS:1;
    unsigned NAKTO:1;
    unsigned FLUSH:1;
    unsigned DT:1;
    unsigned DTWE:1;
  };
  struct {
    unsigned :19;
    unsigned DATAEND:1;
    unsigned SETEND:1;
    unsigned STALL:1;
    unsigned RXRDYC:1;
    unsigned SETENDC:1;
  };
} __USBE0CSR0bits_t;*/
volatile __USBE0CSR0bits_t USBE0CSR0bits ;//__asm__ ("USBE0CSR0") ;//__attribute__((section("sfrs")));
volatile unsigned int        USBE0CSR2 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned RXCNT:7;
  unsigned :15;
  unsigned SPEED:2;
  unsigned NAKLIM:4;
} __USBE0CSR2bits_t;*/
volatile __USBE0CSR2bits_t USBE0CSR2bits ;//__asm__ ("USBE0CSR2") ;//__attribute__((section("sfrs")));
volatile unsigned int        USBE0CSR3 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned :24;
  unsigned UTMIDWID:1;
  unsigned SOFTCONE:1;
  unsigned DYNFIFOS:1;
  unsigned HBTXEN:1;
  unsigned HBRXEN:1;
  unsigned BIGEND:1;
  unsigned MPTXEN:1;
  unsigned MPRXEN:1;
} __USBE0CSR3bits_t;*/
volatile __USBE0CSR3bits_t USBE0CSR3bits ;//__asm__ ("USBE0CSR3") ;//__attribute__((section("sfrs")));
volatile unsigned int        USBE1CSR0 ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned TXMAXP:11;
    unsigned MULT:5;
    unsigned TXPKTRDY:1;
    unsigned FIFONE:1;
    unsigned ERROR:1;
    unsigned FLUSH:1;
    unsigned SETUPPKT:1;
    unsigned RXSTALL:1;
    unsigned CLRDT:1;
    unsigned NAKTMOUT:1;
    unsigned DATATGGL:1;
    unsigned DTWREN:1;
    unsigned DMAREQMD:1;
    unsigned FRCDATTG:1;
    unsigned DMAREQEN:1;
    unsigned MODE:1;
    unsigned :1;
    unsigned AUTOSET:1;
  };
  struct {
    unsigned :18;
    unsigned UNDERRUN:1;
    unsigned :1;
    unsigned SENDSTALL:1;
    unsigned SENTSTALL:1;
    unsigned :1;
    unsigned INCOMPTX:1;
    unsigned :6;
    unsigned ISO:1;
  };
} __USBE1CSR0bits_t;*/
volatile __USBE1CSR0bits_t USBE1CSR0bits ;//__asm__ ("USBE1CSR0") ;//__attribute__((section("sfrs")));
volatile unsigned int        USBE1CSR1 ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned RXMAXP:11;
    unsigned MULT:5;
    unsigned RXPKTRDY:1;
    unsigned FIFOFULL:1;
    unsigned ERROR:1;
    unsigned DERRNAKT:1;
    unsigned FLUSH:1;
    unsigned REQPKT:1;
    unsigned RXSTALL:1;
    unsigned CLRDT:1;
    unsigned INCOMPRX:1;
    unsigned DATATGGL:1;
    unsigned DATATWEN:1;
    unsigned DMAREQMD:1;
    unsigned PIDERR:1;
    unsigned DMAREQEN:1;
    unsigned AUTORQ:1;
    unsigned AUTOCLR:1;
  };
  struct {
    unsigned :18;
    unsigned UNDERRUN:1;
    unsigned :1;
    unsigned SENDSTALL:1;
    unsigned SENTSTALL:1;
    unsigned :1;
    unsigned INCOMPTX:1;
    unsigned :6;
    unsigned ISO:1;
  };
} __USBE1CSR1bits_t;*/
volatile __USBE1CSR1bits_t USBE1CSR1bits ;//__asm__ ("USBE1CSR1") ;//__attribute__((section("sfrs")));
volatile unsigned int        USBE1CSR2 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned RXCNT:14;
  unsigned :2;
  unsigned TEP:4;
  unsigned PROTOCOL:2;
  unsigned SPEED:2;
  unsigned TXINTERV:8;
} __USBE1CSR2bits_t;*/
volatile __USBE1CSR2bits_t USBE1CSR2bits ;//__asm__ ("USBE1CSR2") ;//__attribute__((section("sfrs")));
volatile unsigned int        USBE1CSR3 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned TEP:4;
  unsigned PROTOCOL:2;
  unsigned SPEED:2;
  unsigned RXINTERV:8;
  unsigned :8;
  unsigned TXFIFOSZ:4;
  unsigned RXFIFOSZ:4;
} __USBE1CSR3bits_t;*/
volatile __USBE1CSR3bits_t USBE1CSR3bits ;//__asm__ ("USBE1CSR3") ;//__attribute__((section("sfrs")));
volatile unsigned int        USBE2CSR0 ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned TXMAXP:11;
    unsigned MULT:5;
    unsigned TXPKTRDY:1;
    unsigned FIFONE:1;
    unsigned ERROR:1;
    unsigned FLUSH:1;
    unsigned SETUPPKT:1;
    unsigned RXSTALL:1;
    unsigned CLRDT:1;
    unsigned NAKTMOUT:1;
    unsigned DATATGGL:1;
    unsigned DTWREN:1;
    unsigned DMAREQMD:1;
    unsigned FRCDATTG:1;
    unsigned DMAREQEN:1;
    unsigned MODE:1;
    unsigned :1;
    unsigned AUTOSET:1;
  };
  struct {
    unsigned :18;
    unsigned UNDERRUN:1;
    unsigned :1;
    unsigned SENDSTALL:1;
    unsigned SENTSTALL:1;
    unsigned :1;
    unsigned INCOMPTX:1;
    unsigned :6;
    unsigned ISO:1;
  };
} __USBE2CSR0bits_t;*/
volatile __USBE2CSR0bits_t USBE2CSR0bits ;//__asm__ ("USBE2CSR0") ;//__attribute__((section("sfrs")));
volatile unsigned int        USBE2CSR1 ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned RXMAXP:11;
    unsigned MULT:5;
    unsigned RXPKTRDY:1;
    unsigned FIFOFULL:1;
    unsigned ERROR:1;
    unsigned DERRNAKT:1;
    unsigned FLUSH:1;
    unsigned REQPKT:1;
    unsigned RXSTALL:1;
    unsigned CLRDT:1;
    unsigned INCOMPRX:1;
    unsigned DATATGGL:1;
    unsigned DATATWEN:1;
    unsigned DMAREQMD:1;
    unsigned PIDERR:1;
    unsigned DMAREQEN:1;
    unsigned AUTORQ:1;
    unsigned AUTOCLR:1;
  };
  struct {
    unsigned :18;
    unsigned UNDERRUN:1;
    unsigned :1;
    unsigned SENDSTALL:1;
    unsigned SENTSTALL:1;
    unsigned :1;
    unsigned INCOMPTX:1;
    unsigned :6;
    unsigned ISO:1;
  };
} __USBE2CSR1bits_t;*/
volatile __USBE2CSR1bits_t USBE2CSR1bits ;//__asm__ ("USBE2CSR1") ;//__attribute__((section("sfrs")));
volatile unsigned int        USBE2CSR2 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned RXCNT:14;
  unsigned :2;
  unsigned TEP:4;
  unsigned PROTOCOL:2;
  unsigned SPEED:2;
  unsigned TXINTERV:8;
} __USBE2CSR2bits_t;*/
volatile __USBE2CSR2bits_t USBE2CSR2bits ;//__asm__ ("USBE2CSR2") ;//__attribute__((section("sfrs")));
volatile unsigned int        USBE2CSR3 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned TEP:4;
  unsigned PROTOCOL:2;
  unsigned SPEED:2;
  unsigned RXINTERV:8;
  unsigned :8;
  unsigned TXFIFOSZ:4;
  unsigned RXFIFOSZ:4;
} __USBE2CSR3bits_t;*/
