HomuraVehicle/homuraLib_v2/machine/device/p32mz2048efg100_forVC.c
volatile __USBE6CSR2bits_t USBE6CSR2bits ;//__asm__ ("USBE6CSR2") ;//__attribute__((section("sfrs")));
volatile unsigned int        USBE6CSR3 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned TEP:4;
  unsigned PROTOCOL:2;
  unsigned SPEED:2;
  unsigned RXINTERV:8;
  unsigned :8;
  unsigned TXFIFOSZ:4;
  unsigned RXFIFOSZ:4;
} __USBE6CSR3bits_t;*/
volatile __USBE6CSR3bits_t USBE6CSR3bits ;//__asm__ ("USBE6CSR3") ;//__attribute__((section("sfrs")));
volatile unsigned int        USBE7CSR0 ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned TXMAXP:11;
    unsigned MULT:5;
    unsigned TXPKTRDY:1;
    unsigned FIFONE:1;
    unsigned ERROR:1;
    unsigned FLUSH:1;
    unsigned SETUPPKT:1;
    unsigned RXSTALL:1;
    unsigned CLRDT:1;
    unsigned NAKTMOUT:1;
    unsigned DATATGGL:1;
    unsigned DTWREN:1;
    unsigned DMAREQMD:1;
    unsigned FRCDATTG:1;
    unsigned DMAREQEN:1;
    unsigned MODE:1;
    unsigned :1;
    unsigned AUTOSET:1;
  };
  struct {
    unsigned :18;
    unsigned UNDERRUN:1;
    unsigned :1;
    unsigned SENDSTALL:1;
    unsigned SENTSTALL:1;
    unsigned :1;
    unsigned INCOMPTX:1;
    unsigned :6;
    unsigned ISO:1;
  };
} __USBE7CSR0bits_t;*/
volatile __USBE7CSR0bits_t USBE7CSR0bits ;//__asm__ ("USBE7CSR0") ;//__attribute__((section("sfrs")));
volatile unsigned int        USBE7CSR1 ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned RXMAXP:11;
    unsigned MULT:5;
    unsigned RXPKTRDY:1;
    unsigned FIFOFULL:1;
    unsigned ERROR:1;
    unsigned DERRNAKT:1;
    unsigned FLUSH:1;
    unsigned REQPKT:1;
    unsigned RXSTALL:1;
    unsigned CLRDT:1;
    unsigned INCOMPRX:1;
    unsigned DATATGGL:1;
    unsigned DATATWEN:1;
    unsigned DMAREQMD:1;
    unsigned PIDERR:1;
    unsigned DMAREQEN:1;
    unsigned AUTORQ:1;
    unsigned AUTOCLR:1;
  };
  struct {
    unsigned :18;
    unsigned UNDERRUN:1;
    unsigned :1;
    unsigned SENDSTALL:1;
    unsigned SENTSTALL:1;
    unsigned :1;
    unsigned INCOMPTX:1;
    unsigned :6;
    unsigned ISO:1;
  };
} __USBE7CSR1bits_t;*/
volatile __USBE7CSR1bits_t USBE7CSR1bits ;//__asm__ ("USBE7CSR1") ;//__attribute__((section("sfrs")));
volatile unsigned int        USBE7CSR2 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned RXCNT:14;
  unsigned :2;
  unsigned TEP:4;
  unsigned PROTOCOL:2;
  unsigned SPEED:2;
  unsigned TXINTERV:8;
} __USBE7CSR2bits_t;*/
volatile __USBE7CSR2bits_t USBE7CSR2bits ;//__asm__ ("USBE7CSR2") ;//__attribute__((section("sfrs")));
volatile unsigned int        USBE7CSR3 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned TEP:4;
  unsigned PROTOCOL:2;
  unsigned SPEED:2;
  unsigned RXINTERV:8;
  unsigned :8;
  unsigned TXFIFOSZ:4;
  unsigned RXFIFOSZ:4;
} __USBE7CSR3bits_t;*/
volatile __USBE7CSR3bits_t USBE7CSR3bits ;//__asm__ ("USBE7CSR3") ;//__attribute__((section("sfrs")));
volatile unsigned int        USBDMAINT ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned DMA1IF:1;
  unsigned DMA2IF:1;
  unsigned DMA3IF:1;
  unsigned DMA4IF:1;
  unsigned DMA5IF:1;
  unsigned DMA6IF:1;
  unsigned DMA7IF:1;
  unsigned DMA8IF:1;
} __USBDMAINTbits_t;*/
volatile __USBDMAINTbits_t USBDMAINTbits ;//__asm__ ("USBDMAINT") ;//__attribute__((section("sfrs")));
volatile unsigned int        USBDMA1C ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned DMAEN:1;
  unsigned DMADIR:1;
  unsigned DMAMODE:1;
  unsigned DMAIE:1;
  unsigned DMAEP:4;
  unsigned DMAERR:1;
  unsigned DMABRSTM:2;
} __USBDMA1Cbits_t;*/
volatile __USBDMA1Cbits_t USBDMA1Cbits ;//__asm__ ("USBDMA1C") ;//__attribute__((section("sfrs")));
volatile unsigned int        USBDMA1A ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned DMAADDR:32;
} __USBDMA1Abits_t;*/
volatile __USBDMA1Abits_t USBDMA1Abits ;//__asm__ ("USBDMA1A") ;//__attribute__((section("sfrs")));
volatile unsigned int        USBDMA1N ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned DMACOUNT:32;
} __USBDMA1Nbits_t;*/
volatile __USBDMA1Nbits_t USBDMA1Nbits ;//__asm__ ("USBDMA1N") ;//__attribute__((section("sfrs")));
volatile unsigned int        USBDMA2C ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned DMAEN:1;
  unsigned DMADIR:1;
  unsigned DMAMODE:1;
  unsigned DMAIE:1;
  unsigned DMAEP:4;
  unsigned DMAERR:1;
  unsigned DMABRSTM:2;
} __USBDMA2Cbits_t;*/
volatile __USBDMA2Cbits_t USBDMA2Cbits ;//__asm__ ("USBDMA2C") ;//__attribute__((section("sfrs")));
volatile unsigned int        USBDMA2A ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned DMAADDR:32;
} __USBDMA2Abits_t;*/
volatile __USBDMA2Abits_t USBDMA2Abits ;//__asm__ ("USBDMA2A") ;//__attribute__((section("sfrs")));
volatile unsigned int        USBDMA2N ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned DMACOUNT:32;
} __USBDMA2Nbits_t;*/
volatile __USBDMA2Nbits_t USBDMA2Nbits ;//__asm__ ("USBDMA2N") ;//__attribute__((section("sfrs")));
volatile unsigned int        USBDMA3C ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned DMAEN:1;
  unsigned DMADIR:1;
  unsigned DMAMODE:1;
  unsigned DMAIE:1;
  unsigned DMAEP:4;
  unsigned DMAERR:1;
  unsigned DMABRSTM:2;
} __USBDMA3Cbits_t;*/
volatile __USBDMA3Cbits_t USBDMA3Cbits ;//__asm__ ("USBDMA3C") ;//__attribute__((section("sfrs")));
volatile unsigned int        USBDMA3A ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned DMAADDR:32;
} __USBDMA3Abits_t;*/
volatile __USBDMA3Abits_t USBDMA3Abits ;//__asm__ ("USBDMA3A") ;//__attribute__((section("sfrs")));
volatile unsigned int        USBDMA3N ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned DMACOUNT:32;
} __USBDMA3Nbits_t;*/
volatile __USBDMA3Nbits_t USBDMA3Nbits ;//__asm__ ("USBDMA3N") ;//__attribute__((section("sfrs")));
volatile unsigned int        USBDMA4C ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned DMAEN:1;
  unsigned DMADIR:1;
  unsigned DMAMODE:1;
  unsigned DMAIE:1;
  unsigned DMAEP:4;
  unsigned DMAERR:1;
  unsigned DMABRSTM:2;
} __USBDMA4Cbits_t;*/
volatile __USBDMA4Cbits_t USBDMA4Cbits ;//__asm__ ("USBDMA4C") ;//__attribute__((section("sfrs")));
volatile unsigned int        USBDMA4A ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned DMAADDR:32;
} __USBDMA4Abits_t;*/
