HomuraVehicle/homuraLib_v2/machine/device/p32mz2048efg100_forVC.c
volatile __USBDMA4Abits_t USBDMA4Abits ;//__asm__ ("USBDMA4A") ;//__attribute__((section("sfrs")));
volatile unsigned int        USBDMA4N ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned DMACOUNT:32;
} __USBDMA4Nbits_t;*/
volatile __USBDMA4Nbits_t USBDMA4Nbits ;//__asm__ ("USBDMA4N") ;//__attribute__((section("sfrs")));
volatile unsigned int        USBDMA5C ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned DMAEN:1;
  unsigned DMADIR:1;
  unsigned DMAMODE:1;
  unsigned DMAIE:1;
  unsigned DMAEP:4;
  unsigned DMAERR:1;
  unsigned DMABRSTM:2;
} __USBDMA5Cbits_t;*/
volatile __USBDMA5Cbits_t USBDMA5Cbits ;//__asm__ ("USBDMA5C") ;//__attribute__((section("sfrs")));
volatile unsigned int        USBDMA5A ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned DMAADDR:32;
} __USBDMA5Abits_t;*/
volatile __USBDMA5Abits_t USBDMA5Abits ;//__asm__ ("USBDMA5A") ;//__attribute__((section("sfrs")));
volatile unsigned int        USBDMA5N ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned DMACOUNT:32;
} __USBDMA5Nbits_t;*/
volatile __USBDMA5Nbits_t USBDMA5Nbits ;//__asm__ ("USBDMA5N") ;//__attribute__((section("sfrs")));
volatile unsigned int        USBDMA6C ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned DMAEN:1;
  unsigned DMADIR:1;
  unsigned DMAMODE:1;
  unsigned DMAIE:1;
  unsigned DMAEP:4;
  unsigned DMAERR:1;
  unsigned DMABRSTM:2;
} __USBDMA6Cbits_t;*/
volatile __USBDMA6Cbits_t USBDMA6Cbits ;//__asm__ ("USBDMA6C") ;//__attribute__((section("sfrs")));
volatile unsigned int        USBDMA6A ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned DMAADDR:32;
} __USBDMA6Abits_t;*/
volatile __USBDMA6Abits_t USBDMA6Abits ;//__asm__ ("USBDMA6A") ;//__attribute__((section("sfrs")));
volatile unsigned int        USBDMA6N ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned DMACOUNT:32;
} __USBDMA6Nbits_t;*/
volatile __USBDMA6Nbits_t USBDMA6Nbits ;//__asm__ ("USBDMA6N") ;//__attribute__((section("sfrs")));
volatile unsigned int        USBDMA7C ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned DMAEN:1;
  unsigned DMADIR:1;
  unsigned DMAMODE:1;
  unsigned DMAIE:1;
  unsigned DMAEP:4;
  unsigned DMAERR:1;
  unsigned DMABRSTM:2;
} __USBDMA7Cbits_t;*/
volatile __USBDMA7Cbits_t USBDMA7Cbits ;//__asm__ ("USBDMA7C") ;//__attribute__((section("sfrs")));
volatile unsigned int        USBDMA7A ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned DMAADDR:32;
} __USBDMA7Abits_t;*/
volatile __USBDMA7Abits_t USBDMA7Abits ;//__asm__ ("USBDMA7A") ;//__attribute__((section("sfrs")));
volatile unsigned int        USBDMA7N ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned DMACOUNT:32;
} __USBDMA7Nbits_t;*/
volatile __USBDMA7Nbits_t USBDMA7Nbits ;//__asm__ ("USBDMA7N") ;//__attribute__((section("sfrs")));
volatile unsigned int        USBDMA8C ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned DMAEN:1;
  unsigned DMADIR:1;
  unsigned DMAMODE:1;
  unsigned DMAIE:1;
  unsigned DMAEP:4;
  unsigned DMAERR:1;
  unsigned DMABRSTM:2;
} __USBDMA8Cbits_t;*/
volatile __USBDMA8Cbits_t USBDMA8Cbits ;//__asm__ ("USBDMA8C") ;//__attribute__((section("sfrs")));
volatile unsigned int        USBDMA8A ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned DMAADDR:32;
} __USBDMA8Abits_t;*/
volatile __USBDMA8Abits_t USBDMA8Abits ;//__asm__ ("USBDMA8A") ;//__attribute__((section("sfrs")));
volatile unsigned int        USBDMA8N ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned DMACOUNT:32;
} __USBDMA8Nbits_t;*/
volatile __USBDMA8Nbits_t USBDMA8Nbits ;//__asm__ ("USBDMA8N") ;//__attribute__((section("sfrs")));
volatile unsigned int        USBE1RPC ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned RQPKTCNT:16;
} __USBE1RPCbits_t;*/
volatile __USBE1RPCbits_t USBE1RPCbits ;//__asm__ ("USBE1RPC") ;//__attribute__((section("sfrs")));
volatile unsigned int        USBE2RPC ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned RQPKTCNT:16;
} __USBE2RPCbits_t;*/
volatile __USBE2RPCbits_t USBE2RPCbits ;//__asm__ ("USBE2RPC") ;//__attribute__((section("sfrs")));
volatile unsigned int        USBE3RPC ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned RQPKTCNT:16;
} __USBE3RPCbits_t;*/
volatile __USBE3RPCbits_t USBE3RPCbits ;//__asm__ ("USBE3RPC") ;//__attribute__((section("sfrs")));
volatile unsigned int        USBE4RPC ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned RQPKTCNT:16;
} __USBE4RPCbits_t;*/
volatile __USBE4RPCbits_t USBE4RPCbits ;//__asm__ ("USBE4RPC") ;//__attribute__((section("sfrs")));
volatile unsigned int        USBE5RPC ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned RQPKTCNT:16;
} __USBE5RPCbits_t;*/
volatile __USBE5RPCbits_t USBE5RPCbits ;//__asm__ ("USBE5RPC") ;//__attribute__((section("sfrs")));
volatile unsigned int        USBE6RPC ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned RQPKTCNT:16;
} __USBE6RPCbits_t;*/
volatile __USBE6RPCbits_t USBE6RPCbits ;//__asm__ ("USBE6RPC") ;//__attribute__((section("sfrs")));
volatile unsigned int        USBE7RPC ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned RQPKTCNT:16;
} __USBE7RPCbits_t;*/
volatile __USBE7RPCbits_t USBE7RPCbits ;//__asm__ ("USBE7RPC") ;//__attribute__((section("sfrs")));
volatile unsigned int        USBDPBFD ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned :1;
  unsigned EP1RXD:1;
  unsigned EP2RXD:1;
  unsigned EP3RXD:1;
  unsigned EP4RXD:1;
  unsigned EP5RXD:1;
  unsigned EP6RXD:1;
  unsigned EP7RXD:1;
  unsigned :9;
  unsigned EP1TXD:1;
  unsigned EP2TXD:1;
  unsigned EP3TXD:1;
  unsigned EP4TXD:1;
  unsigned EP5TXD:1;
  unsigned EP6TXD:1;
  unsigned EP7TXD:1;
} __USBDPBFDbits_t;*/
volatile __USBDPBFDbits_t USBDPBFDbits ;//__asm__ ("USBDPBFD") ;//__attribute__((section("sfrs")));
volatile unsigned int        USBTMCON1 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned TUCH:16;
  unsigned THHSRTN:16;
} __USBTMCON1bits_t;*/
