HomuraVehicle/homuraLib_v2/machine/device/p32mz2048efg100_forVC.c
volatile __USBTMCON1bits_t USBTMCON1bits ;//__asm__ ("USBTMCON1") ;//__attribute__((section("sfrs")));
volatile unsigned int        USBTMCON2 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned THSBT:4;
} __USBTMCON2bits_t;*/
volatile __USBTMCON2bits_t USBTMCON2bits ;//__asm__ ("USBTMCON2") ;//__attribute__((section("sfrs")));
volatile unsigned int        USBLPMR1 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned LNKSTATE:4;
  unsigned HIRD:4;
  unsigned RMTWAK:1;
  unsigned :3;
  unsigned ENDPOINT:4;
  unsigned LPMXMT:1;
  unsigned LPMRES:1;
  unsigned LPMEN:2;
  unsigned LPMNAK:1;
  unsigned :3;
  unsigned LPMTOIE:1;
  unsigned LPMSTIE:1;
  unsigned LPMNYIE:1;
  unsigned LPMACKIE:1;
  unsigned LPMRESIE:1;
  unsigned LPMERRIE:1;
} __USBLPMR1bits_t;*/
volatile __USBLPMR1bits_t USBLPMR1bits ;//__asm__ ("USBLPMR1") ;//__attribute__((section("sfrs")));
volatile unsigned int        USBLMPR2 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned LPMST:1;
  unsigned LPMNY:1;
  unsigned LPMACK:1;
  unsigned LPMNC:1;
  unsigned LPMRES:1;
  unsigned LPMERR:1;
  unsigned :2;
  unsigned LPMFADDR:7;
} __USBLMPR2bits_t;*/
volatile __USBLMPR2bits_t USBLMPR2bits ;//__asm__ ("USBLMPR2") ;//__attribute__((section("sfrs")));
volatile unsigned int        USBLPMP2 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned LPMST:1;
  unsigned LPMNY:1;
  unsigned LPMACK:1;
  unsigned LPMNC:1;
  unsigned LPMRES:1;
  unsigned LPMERR:1;
  unsigned :2;
  unsigned LPMFADDR:7;
} __USBLPMP2bits_t;*/
volatile __USBLPMP2bits_t USBLPMP2bits ;//__asm__ ("USBLPMP2") ;//__attribute__((section("sfrs")));
volatile unsigned int        RNGVER ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned REVISION:7;
  unsigned VERSION:9;
  unsigned ID:16;
} __RNGVERbits_t;*/
volatile __RNGVERbits_t RNGVERbits ;//__asm__ ("RNGVER") ;//__attribute__((section("sfrs")));
volatile unsigned int        RNGCON ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned PLEN:8;
  unsigned TRNGEN:1;
  unsigned PRNGEN:1;
  unsigned CONT:1;
  unsigned TRNGMODE:1;
  unsigned LOAD:1;
} __RNGCONbits_t;*/
volatile __RNGCONbits_t RNGCONbits ;//__asm__ ("RNGCON") ;//__attribute__((section("sfrs")));
volatile unsigned int        RNGPOLY1 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned POLY:32;
} __RNGPOLY1bits_t;*/
volatile __RNGPOLY1bits_t RNGPOLY1bits ;//__asm__ ("RNGPOLY1") ;//__attribute__((section("sfrs")));
volatile unsigned int        RNGPOLY2 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned POLY:32;
} __RNGPOLY2bits_t;*/
volatile __RNGPOLY2bits_t RNGPOLY2bits ;//__asm__ ("RNGPOLY2") ;//__attribute__((section("sfrs")));
volatile unsigned int        RNGNUMGEN1 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned RNG:32;
} __RNGNUMGEN1bits_t;*/
volatile __RNGNUMGEN1bits_t RNGNUMGEN1bits ;//__asm__ ("RNGNUMGEN1") ;//__attribute__((section("sfrs")));
volatile unsigned int        RNGNUMGEN2 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned RNG:32;
} __RNGNUMGEN2bits_t;*/
volatile __RNGNUMGEN2bits_t RNGNUMGEN2bits ;//__asm__ ("RNGNUMGEN2") ;//__attribute__((section("sfrs")));
volatile unsigned int        RNGSEED1 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned SEED:32;
} __RNGSEED1bits_t;*/
volatile __RNGSEED1bits_t RNGSEED1bits ;//__asm__ ("RNGSEED1") ;//__attribute__((section("sfrs")));
volatile unsigned int        RNGSEED2 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned SEED:32;
} __RNGSEED2bits_t;*/
volatile __RNGSEED2bits_t RNGSEED2bits ;//__asm__ ("RNGSEED2") ;//__attribute__((section("sfrs")));
volatile unsigned int        RNGCNT ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned RCNT:7;
} __RNGCNTbits_t;*/
volatile __RNGCNTbits_t RNGCNTbits ;//__asm__ ("RNGCNT") ;//__attribute__((section("sfrs")));
volatile unsigned int        SBFLAG ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned T0PGV:1;
  unsigned T1PGV:1;
  unsigned T2PGV:1;
  unsigned T3PGV:1;
  unsigned T4PGV:1;
  unsigned T5PGV:1;
  unsigned T6PGV:1;
  unsigned T7PGV:1;
  unsigned T8PGV:1;
  unsigned T9PGV:1;
  unsigned T10PGV:1;
  unsigned T11PGV:1;
  unsigned T12PGV:1;
  unsigned T13PGV:1;
} __SBFLAGbits_t;*/
volatile __SBFLAGbits_t SBFLAGbits ;//__asm__ ("SBFLAG") ;//__attribute__((section("sfrs")));
volatile unsigned int        SBT0ELOG1 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned CMD:3;
  unsigned :1;
  unsigned REGION:4;
  unsigned INITID:8;
  unsigned :8;
  unsigned CODE:4;
  unsigned :3;
  unsigned MULTI:1;
} __SBT0ELOG1bits_t;*/
volatile __SBT0ELOG1bits_t SBT0ELOG1bits ;//__asm__ ("SBT0ELOG1") ;//__attribute__((section("sfrs")));
volatile unsigned int        SBT0ELOG2 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned GROUP:2;
} __SBT0ELOG2bits_t;*/
volatile __SBT0ELOG2bits_t SBT0ELOG2bits ;//__asm__ ("SBT0ELOG2") ;//__attribute__((section("sfrs")));
volatile unsigned int        SBT0ECON ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned :24;
  unsigned ERRP:1;
} __SBT0ECONbits_t;*/
volatile __SBT0ECONbits_t SBT0ECONbits ;//__asm__ ("SBT0ECON") ;//__attribute__((section("sfrs")));
volatile unsigned int        SBT0ECLRS ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned CLEAR:1;
} __SBT0ECLRSbits_t;*/
volatile __SBT0ECLRSbits_t SBT0ECLRSbits ;//__asm__ ("SBT0ECLRS") ;//__attribute__((section("sfrs")));
volatile unsigned int        SBT0ECLRM ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned CLEAR:1;
} __SBT0ECLRMbits_t;*/
volatile __SBT0ECLRMbits_t SBT0ECLRMbits ;//__asm__ ("SBT0ECLRM") ;//__attribute__((section("sfrs")));
volatile unsigned int        SBT0REG0 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned :3;
  unsigned SIZE:5;
  unsigned :1;
  unsigned PRI:1;
  unsigned BASE:22;
} __SBT0REG0bits_t;*/
volatile __SBT0REG0bits_t SBT0REG0bits ;//__asm__ ("SBT0REG0") ;//__attribute__((section("sfrs")));
volatile unsigned int        SBT0RD0 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned GROUP0:1;
  unsigned GROUP1:1;
  unsigned GROUP2:1;
  unsigned GROUP3:1;
} __SBT0RD0bits_t;*/
volatile __SBT0RD0bits_t SBT0RD0bits ;//__asm__ ("SBT0RD0") ;//__attribute__((section("sfrs")));
volatile unsigned int        SBT0WR0 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned GROUP0:1;
  unsigned GROUP1:1;
  unsigned GROUP2:1;
  unsigned GROUP3:1;
} __SBT0WR0bits_t;*/
volatile __SBT0WR0bits_t SBT0WR0bits ;//__asm__ ("SBT0WR0") ;//__attribute__((section("sfrs")));
volatile unsigned int        SBT0REG1 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned :3;
  unsigned SIZE:5;
  unsigned :1;
  unsigned PRI:1;
  unsigned BASE:22;
} __SBT0REG1bits_t;*/
volatile __SBT0REG1bits_t SBT0REG1bits ;//__asm__ ("SBT0REG1") ;//__attribute__((section("sfrs")));
volatile unsigned int        SBT0RD1 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned GROUP0:1;
  unsigned GROUP1:1;
  unsigned GROUP2:1;
  unsigned GROUP3:1;
} __SBT0RD1bits_t;*/
volatile __SBT0RD1bits_t SBT0RD1bits ;//__asm__ ("SBT0RD1") ;//__attribute__((section("sfrs")));
volatile unsigned int        SBT0WR1 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned GROUP0:1;
  unsigned GROUP1:1;
  unsigned GROUP2:1;
  unsigned GROUP3:1;
} __SBT0WR1bits_t;*/
volatile __SBT0WR1bits_t SBT0WR1bits ;//__asm__ ("SBT0WR1") ;//__attribute__((section("sfrs")));
volatile unsigned int        SBT1ELOG1 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned CMD:3;
  unsigned :1;
  unsigned REGION:4;
  unsigned INITID:8;
  unsigned :8;
  unsigned CODE:4;
  unsigned :3;
  unsigned MULTI:1;
} __SBT1ELOG1bits_t;*/
volatile __SBT1ELOG1bits_t SBT1ELOG1bits ;//__asm__ ("SBT1ELOG1") ;//__attribute__((section("sfrs")));
volatile unsigned int        SBT1ELOG2 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned GROUP:2;
} __SBT1ELOG2bits_t;*/
