HomuraVehicle/homuraLib_v2/machine/device/p32mz2048efg100_forVC.c
volatile __SBT1ELOG2bits_t SBT1ELOG2bits ;//__asm__ ("SBT1ELOG2") ;//__attribute__((section("sfrs")));
volatile unsigned int        SBT1ECON ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned :24;
  unsigned ERRP:1;
} __SBT1ECONbits_t;*/
volatile __SBT1ECONbits_t SBT1ECONbits ;//__asm__ ("SBT1ECON") ;//__attribute__((section("sfrs")));
volatile unsigned int        SBT1ECLRS ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned CLEAR:1;
} __SBT1ECLRSbits_t;*/
volatile __SBT1ECLRSbits_t SBT1ECLRSbits ;//__asm__ ("SBT1ECLRS") ;//__attribute__((section("sfrs")));
volatile unsigned int        SBT1ECLRM ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned CLEAR:1;
} __SBT1ECLRMbits_t;*/
volatile __SBT1ECLRMbits_t SBT1ECLRMbits ;//__asm__ ("SBT1ECLRM") ;//__attribute__((section("sfrs")));
volatile unsigned int        SBT1REG0 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned :3;
  unsigned SIZE:5;
  unsigned :1;
  unsigned PRI:1;
  unsigned BASE:22;
} __SBT1REG0bits_t;*/
volatile __SBT1REG0bits_t SBT1REG0bits ;//__asm__ ("SBT1REG0") ;//__attribute__((section("sfrs")));
volatile unsigned int        SBT1RD0 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned GROUP0:1;
  unsigned GROUP1:1;
  unsigned GROUP2:1;
  unsigned GROUP3:1;
} __SBT1RD0bits_t;*/
volatile __SBT1RD0bits_t SBT1RD0bits ;//__asm__ ("SBT1RD0") ;//__attribute__((section("sfrs")));
volatile unsigned int        SBT1WR0 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned GROUP0:1;
  unsigned GROUP1:1;
  unsigned GROUP2:1;
  unsigned GROUP3:1;
} __SBT1WR0bits_t;*/
volatile __SBT1WR0bits_t SBT1WR0bits ;//__asm__ ("SBT1WR0") ;//__attribute__((section("sfrs")));
volatile unsigned int        SBT1REG2 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned :3;
  unsigned SIZE:5;
  unsigned :1;
  unsigned PRI:1;
  unsigned BASE:22;
} __SBT1REG2bits_t;*/
volatile __SBT1REG2bits_t SBT1REG2bits ;//__asm__ ("SBT1REG2") ;//__attribute__((section("sfrs")));
volatile unsigned int        SBT1RD2 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned GROUP0:1;
  unsigned GROUP1:1;
  unsigned GROUP2:1;
  unsigned GROUP3:1;
} __SBT1RD2bits_t;*/
volatile __SBT1RD2bits_t SBT1RD2bits ;//__asm__ ("SBT1RD2") ;//__attribute__((section("sfrs")));
volatile unsigned int        SBT1WR2 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned GROUP0:1;
  unsigned GROUP1:1;
  unsigned GROUP2:1;
  unsigned GROUP3:1;
} __SBT1WR2bits_t;*/
volatile __SBT1WR2bits_t SBT1WR2bits ;//__asm__ ("SBT1WR2") ;//__attribute__((section("sfrs")));
volatile unsigned int        SBT1REG3 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned :3;
  unsigned SIZE:5;
  unsigned :1;
  unsigned PRI:1;
  unsigned BASE:22;
} __SBT1REG3bits_t;*/
volatile __SBT1REG3bits_t SBT1REG3bits ;//__asm__ ("SBT1REG3") ;//__attribute__((section("sfrs")));
volatile unsigned int        SBT1RD3 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned GROUP0:1;
  unsigned GROUP1:1;
  unsigned GROUP2:1;
  unsigned GROUP3:1;
} __SBT1RD3bits_t;*/
volatile __SBT1RD3bits_t SBT1RD3bits ;//__asm__ ("SBT1RD3") ;//__attribute__((section("sfrs")));
volatile unsigned int        SBT1WR3 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned GROUP0:1;
  unsigned GROUP1:1;
  unsigned GROUP2:1;
  unsigned GROUP3:1;
} __SBT1WR3bits_t;*/
volatile __SBT1WR3bits_t SBT1WR3bits ;//__asm__ ("SBT1WR3") ;//__attribute__((section("sfrs")));
volatile unsigned int        SBT1REG4 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned :3;
  unsigned SIZE:5;
  unsigned :1;
  unsigned PRI:1;
  unsigned BASE:22;
} __SBT1REG4bits_t;*/
volatile __SBT1REG4bits_t SBT1REG4bits ;//__asm__ ("SBT1REG4") ;//__attribute__((section("sfrs")));
volatile unsigned int        SBT1RD4 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned GROUP0:1;
  unsigned GROUP1:1;
  unsigned GROUP2:1;
  unsigned GROUP3:1;
} __SBT1RD4bits_t;*/
volatile __SBT1RD4bits_t SBT1RD4bits ;//__asm__ ("SBT1RD4") ;//__attribute__((section("sfrs")));
volatile unsigned int        SBT1WR4 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned GROUP0:1;
  unsigned GROUP1:1;
  unsigned GROUP2:1;
  unsigned GROUP3:1;
} __SBT1WR4bits_t;*/
volatile __SBT1WR4bits_t SBT1WR4bits ;//__asm__ ("SBT1WR4") ;//__attribute__((section("sfrs")));
volatile unsigned int        SBT1REG5 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned :3;
  unsigned SIZE:5;
  unsigned :1;
  unsigned PRI:1;
  unsigned BASE:22;
} __SBT1REG5bits_t;*/
volatile __SBT1REG5bits_t SBT1REG5bits ;//__asm__ ("SBT1REG5") ;//__attribute__((section("sfrs")));
volatile unsigned int        SBT1RD5 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned GROUP0:1;
  unsigned GROUP1:1;
  unsigned GROUP2:1;
  unsigned GROUP3:1;
} __SBT1RD5bits_t;*/
volatile __SBT1RD5bits_t SBT1RD5bits ;//__asm__ ("SBT1RD5") ;//__attribute__((section("sfrs")));
volatile unsigned int        SBT1WR5 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned GROUP0:1;
  unsigned GROUP1:1;
  unsigned GROUP2:1;
  unsigned GROUP3:1;
} __SBT1WR5bits_t;*/
volatile __SBT1WR5bits_t SBT1WR5bits ;//__asm__ ("SBT1WR5") ;//__attribute__((section("sfrs")));
volatile unsigned int        SBT1REG6 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned :3;
  unsigned SIZE:5;
  unsigned :1;
  unsigned PRI:1;
  unsigned BASE:22;
} __SBT1REG6bits_t;*/
volatile __SBT1REG6bits_t SBT1REG6bits ;//__asm__ ("SBT1REG6") ;//__attribute__((section("sfrs")));
volatile unsigned int        SBT1RD6 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned GROUP0:1;
  unsigned GROUP1:1;
  unsigned GROUP2:1;
  unsigned GROUP3:1;
} __SBT1RD6bits_t;*/
volatile __SBT1RD6bits_t SBT1RD6bits ;//__asm__ ("SBT1RD6") ;//__attribute__((section("sfrs")));
volatile unsigned int        SBT1WR6 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned GROUP0:1;
  unsigned GROUP1:1;
  unsigned GROUP2:1;
  unsigned GROUP3:1;
} __SBT1WR6bits_t;*/
volatile __SBT1WR6bits_t SBT1WR6bits ;//__asm__ ("SBT1WR6") ;//__attribute__((section("sfrs")));
volatile unsigned int        SBT1REG7 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned :3;
  unsigned SIZE:5;
  unsigned :1;
  unsigned PRI:1;
  unsigned BASE:22;
} __SBT1REG7bits_t;*/
volatile __SBT1REG7bits_t SBT1REG7bits ;//__asm__ ("SBT1REG7") ;//__attribute__((section("sfrs")));
volatile unsigned int        SBT1RD7 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned GROUP0:1;
  unsigned GROUP1:1;
  unsigned GROUP2:1;
  unsigned GROUP3:1;
} __SBT1RD7bits_t;*/
