HomuraVehicle/homuraLib_v2/machine/device/p32mz2048efg100_forVC.c
volatile __SBT1RD7bits_t SBT1RD7bits ;//__asm__ ("SBT1RD7") ;//__attribute__((section("sfrs")));
volatile unsigned int        SBT1WR7 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned GROUP0:1;
  unsigned GROUP1:1;
  unsigned GROUP2:1;
  unsigned GROUP3:1;
} __SBT1WR7bits_t;*/
volatile __SBT1WR7bits_t SBT1WR7bits ;//__asm__ ("SBT1WR7") ;//__attribute__((section("sfrs")));
volatile unsigned int        SBT1REG8 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned :3;
  unsigned SIZE:5;
  unsigned :1;
  unsigned PRI:1;
  unsigned BASE:22;
} __SBT1REG8bits_t;*/
volatile __SBT1REG8bits_t SBT1REG8bits ;//__asm__ ("SBT1REG8") ;//__attribute__((section("sfrs")));
volatile unsigned int        SBT1RD8 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned GROUP0:1;
  unsigned GROUP1:1;
  unsigned GROUP2:1;
  unsigned GROUP3:1;
} __SBT1RD8bits_t;*/
volatile __SBT1RD8bits_t SBT1RD8bits ;//__asm__ ("SBT1RD8") ;//__attribute__((section("sfrs")));
volatile unsigned int        SBT1WR8 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned GROUP0:1;
  unsigned GROUP1:1;
  unsigned GROUP2:1;
  unsigned GROUP3:1;
} __SBT1WR8bits_t;*/
volatile __SBT1WR8bits_t SBT1WR8bits ;//__asm__ ("SBT1WR8") ;//__attribute__((section("sfrs")));
volatile unsigned int        SBT2ELOG1 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned CMD:3;
  unsigned :1;
  unsigned REGION:4;
  unsigned INITID:8;
  unsigned :8;
  unsigned CODE:4;
  unsigned :3;
  unsigned MULTI:1;
} __SBT2ELOG1bits_t;*/
volatile __SBT2ELOG1bits_t SBT2ELOG1bits ;//__asm__ ("SBT2ELOG1") ;//__attribute__((section("sfrs")));
volatile unsigned int        SBT2ELOG2 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned GROUP:2;
} __SBT2ELOG2bits_t;*/
volatile __SBT2ELOG2bits_t SBT2ELOG2bits ;//__asm__ ("SBT2ELOG2") ;//__attribute__((section("sfrs")));
volatile unsigned int        SBT2ECON ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned :24;
  unsigned ERRP:1;
} __SBT2ECONbits_t;*/
volatile __SBT2ECONbits_t SBT2ECONbits ;//__asm__ ("SBT2ECON") ;//__attribute__((section("sfrs")));
volatile unsigned int        SBT2ECLRS ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned CLEAR:1;
} __SBT2ECLRSbits_t;*/
volatile __SBT2ECLRSbits_t SBT2ECLRSbits ;//__asm__ ("SBT2ECLRS") ;//__attribute__((section("sfrs")));
volatile unsigned int        SBT2ECLRM ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned CLEAR:1;
} __SBT2ECLRMbits_t;*/
volatile __SBT2ECLRMbits_t SBT2ECLRMbits ;//__asm__ ("SBT2ECLRM") ;//__attribute__((section("sfrs")));
volatile unsigned int        SBT2REG0 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned :3;
  unsigned SIZE:5;
  unsigned :1;
  unsigned PRI:1;
  unsigned BASE:22;
} __SBT2REG0bits_t;*/
volatile __SBT2REG0bits_t SBT2REG0bits ;//__asm__ ("SBT2REG0") ;//__attribute__((section("sfrs")));
volatile unsigned int        SBT2RD0 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned GROUP0:1;
  unsigned GROUP1:1;
  unsigned GROUP2:1;
  unsigned GROUP3:1;
} __SBT2RD0bits_t;*/
volatile __SBT2RD0bits_t SBT2RD0bits ;//__asm__ ("SBT2RD0") ;//__attribute__((section("sfrs")));
volatile unsigned int        SBT2WR0 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned GROUP0:1;
  unsigned GROUP1:1;
  unsigned GROUP2:1;
  unsigned GROUP3:1;
} __SBT2WR0bits_t;*/
volatile __SBT2WR0bits_t SBT2WR0bits ;//__asm__ ("SBT2WR0") ;//__attribute__((section("sfrs")));
volatile unsigned int        SBT2REG1 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned :3;
  unsigned SIZE:5;
  unsigned :1;
  unsigned PRI:1;
  unsigned BASE:22;
} __SBT2REG1bits_t;*/
volatile __SBT2REG1bits_t SBT2REG1bits ;//__asm__ ("SBT2REG1") ;//__attribute__((section("sfrs")));
volatile unsigned int        SBT2RD1 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned GROUP0:1;
  unsigned GROUP1:1;
  unsigned GROUP2:1;
  unsigned GROUP3:1;
} __SBT2RD1bits_t;*/
volatile __SBT2RD1bits_t SBT2RD1bits ;//__asm__ ("SBT2RD1") ;//__attribute__((section("sfrs")));
volatile unsigned int        SBT2WR1 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned GROUP0:1;
  unsigned GROUP1:1;
  unsigned GROUP2:1;
  unsigned GROUP3:1;
} __SBT2WR1bits_t;*/
volatile __SBT2WR1bits_t SBT2WR1bits ;//__asm__ ("SBT2WR1") ;//__attribute__((section("sfrs")));
volatile unsigned int        SBT2REG2 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned :3;
  unsigned SIZE:5;
  unsigned :1;
  unsigned PRI:1;
  unsigned BASE:22;
} __SBT2REG2bits_t;*/
volatile __SBT2REG2bits_t SBT2REG2bits ;//__asm__ ("SBT2REG2") ;//__attribute__((section("sfrs")));
volatile unsigned int        SBT2RD2 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned GROUP0:1;
  unsigned GROUP1:1;
  unsigned GROUP2:1;
  unsigned GROUP3:1;
} __SBT2RD2bits_t;*/
volatile __SBT2RD2bits_t SBT2RD2bits ;//__asm__ ("SBT2RD2") ;//__attribute__((section("sfrs")));
volatile unsigned int        SBT2WR2 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned GROUP0:1;
  unsigned GROUP1:1;
  unsigned GROUP2:1;
  unsigned GROUP3:1;
} __SBT2WR2bits_t;*/
volatile __SBT2WR2bits_t SBT2WR2bits ;//__asm__ ("SBT2WR2") ;//__attribute__((section("sfrs")));
volatile unsigned int        SBT3ELOG1 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned CMD:3;
  unsigned :1;
  unsigned REGION:4;
  unsigned INITID:8;
  unsigned :8;
  unsigned CODE:4;
  unsigned :3;
  unsigned MULTI:1;
} __SBT3ELOG1bits_t;*/
volatile __SBT3ELOG1bits_t SBT3ELOG1bits ;//__asm__ ("SBT3ELOG1") ;//__attribute__((section("sfrs")));
volatile unsigned int        SBT3ELOG2 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned GROUP:2;
} __SBT3ELOG2bits_t;*/
volatile __SBT3ELOG2bits_t SBT3ELOG2bits ;//__asm__ ("SBT3ELOG2") ;//__attribute__((section("sfrs")));
volatile unsigned int        SBT3ECON ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned :24;
  unsigned ERRP:1;
} __SBT3ECONbits_t;*/
volatile __SBT3ECONbits_t SBT3ECONbits ;//__asm__ ("SBT3ECON") ;//__attribute__((section("sfrs")));
volatile unsigned int        SBT3ECLRS ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned CLEAR:1;
} __SBT3ECLRSbits_t;*/
volatile __SBT3ECLRSbits_t SBT3ECLRSbits ;//__asm__ ("SBT3ECLRS") ;//__attribute__((section("sfrs")));
volatile unsigned int        SBT3ECLRM ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned CLEAR:1;
} __SBT3ECLRMbits_t;*/
volatile __SBT3ECLRMbits_t SBT3ECLRMbits ;//__asm__ ("SBT3ECLRM") ;//__attribute__((section("sfrs")));
volatile unsigned int        SBT3REG0 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned :3;
  unsigned SIZE:5;
  unsigned :1;
  unsigned PRI:1;
  unsigned BASE:22;
} __SBT3REG0bits_t;*/
volatile __SBT3REG0bits_t SBT3REG0bits ;//__asm__ ("SBT3REG0") ;//__attribute__((section("sfrs")));
volatile unsigned int        SBT3RD0 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned GROUP0:1;
  unsigned GROUP1:1;
  unsigned GROUP2:1;
  unsigned GROUP3:1;
} __SBT3RD0bits_t;*/
