HomuraVehicle/homuraLib_v2/machine/device/p32mz2048efg100_forVC.c
volatile __SBT5REG0bits_t SBT5REG0bits ;//__asm__ ("SBT5REG0") ;//__attribute__((section("sfrs")));
volatile unsigned int        SBT5RD0 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned GROUP0:1;
  unsigned GROUP1:1;
  unsigned GROUP2:1;
  unsigned GROUP3:1;
} __SBT5RD0bits_t;*/
volatile __SBT5RD0bits_t SBT5RD0bits ;//__asm__ ("SBT5RD0") ;//__attribute__((section("sfrs")));
volatile unsigned int        SBT5WR0 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned GROUP0:1;
  unsigned GROUP1:1;
  unsigned GROUP2:1;
  unsigned GROUP3:1;
} __SBT5WR0bits_t;*/
volatile __SBT5WR0bits_t SBT5WR0bits ;//__asm__ ("SBT5WR0") ;//__attribute__((section("sfrs")));
volatile unsigned int        SBT5REG1 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned :3;
  unsigned SIZE:5;
  unsigned :1;
  unsigned PRI:1;
  unsigned BASE:22;
} __SBT5REG1bits_t;*/
volatile __SBT5REG1bits_t SBT5REG1bits ;//__asm__ ("SBT5REG1") ;//__attribute__((section("sfrs")));
volatile unsigned int        SBT5RD1 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned GROUP0:1;
  unsigned GROUP1:1;
  unsigned GROUP2:1;
  unsigned GROUP3:1;
} __SBT5RD1bits_t;*/
volatile __SBT5RD1bits_t SBT5RD1bits ;//__asm__ ("SBT5RD1") ;//__attribute__((section("sfrs")));
volatile unsigned int        SBT5WR1 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned GROUP0:1;
  unsigned GROUP1:1;
  unsigned GROUP2:1;
  unsigned GROUP3:1;
} __SBT5WR1bits_t;*/
volatile __SBT5WR1bits_t SBT5WR1bits ;//__asm__ ("SBT5WR1") ;//__attribute__((section("sfrs")));
volatile unsigned int        SBT5REG2 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned :3;
  unsigned SIZE:5;
  unsigned :1;
  unsigned PRI:1;
  unsigned BASE:22;
} __SBT5REG2bits_t;*/
volatile __SBT5REG2bits_t SBT5REG2bits ;//__asm__ ("SBT5REG2") ;//__attribute__((section("sfrs")));
volatile unsigned int        SBT5RD2 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned GROUP0:1;
  unsigned GROUP1:1;
  unsigned GROUP2:1;
  unsigned GROUP3:1;
} __SBT5RD2bits_t;*/
volatile __SBT5RD2bits_t SBT5RD2bits ;//__asm__ ("SBT5RD2") ;//__attribute__((section("sfrs")));
volatile unsigned int        SBT5WR2 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned GROUP0:1;
  unsigned GROUP1:1;
  unsigned GROUP2:1;
  unsigned GROUP3:1;
} __SBT5WR2bits_t;*/
volatile __SBT5WR2bits_t SBT5WR2bits ;//__asm__ ("SBT5WR2") ;//__attribute__((section("sfrs")));
volatile unsigned int        SBT6ELOG1 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned CMD:3;
  unsigned :1;
  unsigned REGION:4;
  unsigned INITID:8;
  unsigned :8;
  unsigned CODE:4;
  unsigned :3;
  unsigned MULTI:1;
} __SBT6ELOG1bits_t;*/
volatile __SBT6ELOG1bits_t SBT6ELOG1bits ;//__asm__ ("SBT6ELOG1") ;//__attribute__((section("sfrs")));
volatile unsigned int        SBT6ELOG2 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned GROUP:2;
} __SBT6ELOG2bits_t;*/
volatile __SBT6ELOG2bits_t SBT6ELOG2bits ;//__asm__ ("SBT6ELOG2") ;//__attribute__((section("sfrs")));
volatile unsigned int        SBT6ECON ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned :24;
  unsigned ERRP:1;
} __SBT6ECONbits_t;*/
volatile __SBT6ECONbits_t SBT6ECONbits ;//__asm__ ("SBT6ECON") ;//__attribute__((section("sfrs")));
volatile unsigned int        SBT6ECLRS ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned CLEAR:1;
} __SBT6ECLRSbits_t;*/
volatile __SBT6ECLRSbits_t SBT6ECLRSbits ;//__asm__ ("SBT6ECLRS") ;//__attribute__((section("sfrs")));
volatile unsigned int        SBT6ECLRM ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned CLEAR:1;
} __SBT6ECLRMbits_t;*/
volatile __SBT6ECLRMbits_t SBT6ECLRMbits ;//__asm__ ("SBT6ECLRM") ;//__attribute__((section("sfrs")));
volatile unsigned int        SBT6REG0 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned :3;
  unsigned SIZE:5;
  unsigned :1;
  unsigned PRI:1;
  unsigned BASE:22;
} __SBT6REG0bits_t;*/
volatile __SBT6REG0bits_t SBT6REG0bits ;//__asm__ ("SBT6REG0") ;//__attribute__((section("sfrs")));
volatile unsigned int        SBT6RD0 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned GROUP0:1;
  unsigned GROUP1:1;
  unsigned GROUP2:1;
  unsigned GROUP3:1;
} __SBT6RD0bits_t;*/
volatile __SBT6RD0bits_t SBT6RD0bits ;//__asm__ ("SBT6RD0") ;//__attribute__((section("sfrs")));
volatile unsigned int        SBT6WR0 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned GROUP0:1;
  unsigned GROUP1:1;
  unsigned GROUP2:1;
  unsigned GROUP3:1;
} __SBT6WR0bits_t;*/
volatile __SBT6WR0bits_t SBT6WR0bits ;//__asm__ ("SBT6WR0") ;//__attribute__((section("sfrs")));
volatile unsigned int        SBT6REG1 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned :3;
  unsigned SIZE:5;
  unsigned :1;
  unsigned PRI:1;
  unsigned BASE:22;
} __SBT6REG1bits_t;*/
volatile __SBT6REG1bits_t SBT6REG1bits ;//__asm__ ("SBT6REG1") ;//__attribute__((section("sfrs")));
volatile unsigned int        SBT6RD1 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned GROUP0:1;
  unsigned GROUP1:1;
  unsigned GROUP2:1;
  unsigned GROUP3:1;
} __SBT6RD1bits_t;*/
volatile __SBT6RD1bits_t SBT6RD1bits ;//__asm__ ("SBT6RD1") ;//__attribute__((section("sfrs")));
volatile unsigned int        SBT6WR1 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned GROUP0:1;
  unsigned GROUP1:1;
  unsigned GROUP2:1;
  unsigned GROUP3:1;
} __SBT6WR1bits_t;*/
volatile __SBT6WR1bits_t SBT6WR1bits ;//__asm__ ("SBT6WR1") ;//__attribute__((section("sfrs")));
volatile unsigned int        SBT7ELOG1 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned CMD:3;
  unsigned :1;
  unsigned REGION:4;
  unsigned INITID:8;
  unsigned :8;
  unsigned CODE:4;
  unsigned :3;
  unsigned MULTI:1;
} __SBT7ELOG1bits_t;*/
volatile __SBT7ELOG1bits_t SBT7ELOG1bits ;//__asm__ ("SBT7ELOG1") ;//__attribute__((section("sfrs")));
volatile unsigned int        SBT7ELOG2 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned GROUP:2;
} __SBT7ELOG2bits_t;*/
volatile __SBT7ELOG2bits_t SBT7ELOG2bits ;//__asm__ ("SBT7ELOG2") ;//__attribute__((section("sfrs")));
volatile unsigned int        SBT7ECON ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned :24;
  unsigned ERRP:1;
} __SBT7ECONbits_t;*/
volatile __SBT7ECONbits_t SBT7ECONbits ;//__asm__ ("SBT7ECON") ;//__attribute__((section("sfrs")));
volatile unsigned int        SBT7ECLRS ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned CLEAR:1;
} __SBT7ECLRSbits_t;*/
volatile __SBT7ECLRSbits_t SBT7ECLRSbits ;//__asm__ ("SBT7ECLRS") ;//__attribute__((section("sfrs")));
volatile unsigned int        SBT7ECLRM ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned CLEAR:1;
} __SBT7ECLRMbits_t;*/
volatile __SBT7ECLRMbits_t SBT7ECLRMbits ;//__asm__ ("SBT7ECLRM") ;//__attribute__((section("sfrs")));
volatile unsigned int        SBT7REG0 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned :3;
  unsigned SIZE:5;
  unsigned :1;
  unsigned PRI:1;
  unsigned BASE:22;
} __SBT7REG0bits_t;*/
