HomuraVehicle/homuraLib_v2/machine/device/p32mz2048efg100_forVC.c
volatile __SBT7REG0bits_t SBT7REG0bits ;//__asm__ ("SBT7REG0") ;//__attribute__((section("sfrs")));
volatile unsigned int        SBT7RD0 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned GROUP0:1;
  unsigned GROUP1:1;
  unsigned GROUP2:1;
  unsigned GROUP3:1;
} __SBT7RD0bits_t;*/
volatile __SBT7RD0bits_t SBT7RD0bits ;//__asm__ ("SBT7RD0") ;//__attribute__((section("sfrs")));
volatile unsigned int        SBT7WR0 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned GROUP0:1;
  unsigned GROUP1:1;
  unsigned GROUP2:1;
  unsigned GROUP3:1;
} __SBT7WR0bits_t;*/
volatile __SBT7WR0bits_t SBT7WR0bits ;//__asm__ ("SBT7WR0") ;//__attribute__((section("sfrs")));
volatile unsigned int        SBT7REG1 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned :3;
  unsigned SIZE:5;
  unsigned :1;
  unsigned PRI:1;
  unsigned BASE:22;
} __SBT7REG1bits_t;*/
volatile __SBT7REG1bits_t SBT7REG1bits ;//__asm__ ("SBT7REG1") ;//__attribute__((section("sfrs")));
volatile unsigned int        SBT7RD1 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned GROUP0:1;
  unsigned GROUP1:1;
  unsigned GROUP2:1;
  unsigned GROUP3:1;
} __SBT7RD1bits_t;*/
volatile __SBT7RD1bits_t SBT7RD1bits ;//__asm__ ("SBT7RD1") ;//__attribute__((section("sfrs")));
volatile unsigned int        SBT7WR1 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned GROUP0:1;
  unsigned GROUP1:1;
  unsigned GROUP2:1;
  unsigned GROUP3:1;
} __SBT7WR1bits_t;*/
volatile __SBT7WR1bits_t SBT7WR1bits ;//__asm__ ("SBT7WR1") ;//__attribute__((section("sfrs")));
volatile unsigned int        SBT8ELOG1 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned CMD:3;
  unsigned :1;
  unsigned REGION:4;
  unsigned INITID:8;
  unsigned :8;
  unsigned CODE:4;
  unsigned :3;
  unsigned MULTI:1;
} __SBT8ELOG1bits_t;*/
volatile __SBT8ELOG1bits_t SBT8ELOG1bits ;//__asm__ ("SBT8ELOG1") ;//__attribute__((section("sfrs")));
volatile unsigned int        SBT8ELOG2 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned GROUP:2;
} __SBT8ELOG2bits_t;*/
volatile __SBT8ELOG2bits_t SBT8ELOG2bits ;//__asm__ ("SBT8ELOG2") ;//__attribute__((section("sfrs")));
volatile unsigned int        SBT8ECON ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned :24;
  unsigned ERRP:1;
} __SBT8ECONbits_t;*/
volatile __SBT8ECONbits_t SBT8ECONbits ;//__asm__ ("SBT8ECON") ;//__attribute__((section("sfrs")));
volatile unsigned int        SBT8ECLRS ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned CLEAR:1;
} __SBT8ECLRSbits_t;*/
volatile __SBT8ECLRSbits_t SBT8ECLRSbits ;//__asm__ ("SBT8ECLRS") ;//__attribute__((section("sfrs")));
volatile unsigned int        SBT8ECLRM ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned CLEAR:1;
} __SBT8ECLRMbits_t;*/
volatile __SBT8ECLRMbits_t SBT8ECLRMbits ;//__asm__ ("SBT8ECLRM") ;//__attribute__((section("sfrs")));
volatile unsigned int        SBT8REG0 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned :3;
  unsigned SIZE:5;
  unsigned :1;
  unsigned PRI:1;
  unsigned BASE:22;
} __SBT8REG0bits_t;*/
volatile __SBT8REG0bits_t SBT8REG0bits ;//__asm__ ("SBT8REG0") ;//__attribute__((section("sfrs")));
volatile unsigned int        SBT8RD0 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned GROUP0:1;
  unsigned GROUP1:1;
  unsigned GROUP2:1;
  unsigned GROUP3:1;
} __SBT8RD0bits_t;*/
volatile __SBT8RD0bits_t SBT8RD0bits ;//__asm__ ("SBT8RD0") ;//__attribute__((section("sfrs")));
volatile unsigned int        SBT8WR0 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned GROUP0:1;
  unsigned GROUP1:1;
  unsigned GROUP2:1;
  unsigned GROUP3:1;
} __SBT8WR0bits_t;*/
volatile __SBT8WR0bits_t SBT8WR0bits ;//__asm__ ("SBT8WR0") ;//__attribute__((section("sfrs")));
volatile unsigned int        SBT8REG1 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned :3;
  unsigned SIZE:5;
  unsigned :1;
  unsigned PRI:1;
  unsigned BASE:22;
} __SBT8REG1bits_t;*/
volatile __SBT8REG1bits_t SBT8REG1bits ;//__asm__ ("SBT8REG1") ;//__attribute__((section("sfrs")));
volatile unsigned int        SBT8RD1 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned GROUP0:1;
  unsigned GROUP1:1;
  unsigned GROUP2:1;
  unsigned GROUP3:1;
} __SBT8RD1bits_t;*/
volatile __SBT8RD1bits_t SBT8RD1bits ;//__asm__ ("SBT8RD1") ;//__attribute__((section("sfrs")));
volatile unsigned int        SBT8WR1 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned GROUP0:1;
  unsigned GROUP1:1;
  unsigned GROUP2:1;
  unsigned GROUP3:1;
} __SBT8WR1bits_t;*/
volatile __SBT8WR1bits_t SBT8WR1bits ;//__asm__ ("SBT8WR1") ;//__attribute__((section("sfrs")));
volatile unsigned int        SBT9ELOG1 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned CMD:3;
  unsigned :1;
  unsigned REGION:4;
  unsigned INITID:8;
  unsigned :8;
  unsigned CODE:4;
  unsigned :3;
  unsigned MULTI:1;
} __SBT9ELOG1bits_t;*/
volatile __SBT9ELOG1bits_t SBT9ELOG1bits ;//__asm__ ("SBT9ELOG1") ;//__attribute__((section("sfrs")));
volatile unsigned int        SBT9ELOG2 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned GROUP:2;
} __SBT9ELOG2bits_t;*/
volatile __SBT9ELOG2bits_t SBT9ELOG2bits ;//__asm__ ("SBT9ELOG2") ;//__attribute__((section("sfrs")));
volatile unsigned int        SBT9ECON ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned :24;
  unsigned ERRP:1;
} __SBT9ECONbits_t;*/
volatile __SBT9ECONbits_t SBT9ECONbits ;//__asm__ ("SBT9ECON") ;//__attribute__((section("sfrs")));
volatile unsigned int        SBT9ECLRS ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned CLEAR:1;
} __SBT9ECLRSbits_t;*/
volatile __SBT9ECLRSbits_t SBT9ECLRSbits ;//__asm__ ("SBT9ECLRS") ;//__attribute__((section("sfrs")));
volatile unsigned int        SBT9ECLRM ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned CLEAR:1;
} __SBT9ECLRMbits_t;*/
volatile __SBT9ECLRMbits_t SBT9ECLRMbits ;//__asm__ ("SBT9ECLRM") ;//__attribute__((section("sfrs")));
volatile unsigned int        SBT9REG0 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned :3;
  unsigned SIZE:5;
  unsigned :1;
  unsigned PRI:1;
  unsigned BASE:22;
} __SBT9REG0bits_t;*/
volatile __SBT9REG0bits_t SBT9REG0bits ;//__asm__ ("SBT9REG0") ;//__attribute__((section("sfrs")));
volatile unsigned int        SBT9RD0 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned GROUP0:1;
  unsigned GROUP1:1;
  unsigned GROUP2:1;
  unsigned GROUP3:1;
} __SBT9RD0bits_t;*/
volatile __SBT9RD0bits_t SBT9RD0bits ;//__asm__ ("SBT9RD0") ;//__attribute__((section("sfrs")));
volatile unsigned int        SBT9WR0 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned GROUP0:1;
  unsigned GROUP1:1;
  unsigned GROUP2:1;
  unsigned GROUP3:1;
} __SBT9WR0bits_t;*/
volatile __SBT9WR0bits_t SBT9WR0bits ;//__asm__ ("SBT9WR0") ;//__attribute__((section("sfrs")));
volatile unsigned int        SBT9REG1 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned :3;
  unsigned SIZE:5;
  unsigned :1;
  unsigned PRI:1;
  unsigned BASE:22;
} __SBT9REG1bits_t;*/
