HomuraVehicle/homuraLib_v2/machine/device/p32mz2048efg100_forVC.c
volatile __SBT12ELOG2bits_t SBT12ELOG2bits ;//__asm__ ("SBT12ELOG2") ;//__attribute__((section("sfrs")));
volatile unsigned int        SBT12ECON ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned :24;
  unsigned ERRP:1;
} __SBT12ECONbits_t;*/
volatile __SBT12ECONbits_t SBT12ECONbits ;//__asm__ ("SBT12ECON") ;//__attribute__((section("sfrs")));
volatile unsigned int        SBT12ECLRS ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned CLEAR:1;
} __SBT12ECLRSbits_t;*/
volatile __SBT12ECLRSbits_t SBT12ECLRSbits ;//__asm__ ("SBT12ECLRS") ;//__attribute__((section("sfrs")));
volatile unsigned int        SBT12ECLRM ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned CLEAR:1;
} __SBT12ECLRMbits_t;*/
volatile __SBT12ECLRMbits_t SBT12ECLRMbits ;//__asm__ ("SBT12ECLRM") ;//__attribute__((section("sfrs")));
volatile unsigned int        SBT12REG0 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned :3;
  unsigned SIZE:5;
  unsigned :1;
  unsigned PRI:1;
  unsigned BASE:22;
} __SBT12REG0bits_t;*/
volatile __SBT12REG0bits_t SBT12REG0bits ;//__asm__ ("SBT12REG0") ;//__attribute__((section("sfrs")));
volatile unsigned int        SBT12RD0 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned GROUP0:1;
  unsigned GROUP1:1;
  unsigned GROUP2:1;
  unsigned GROUP3:1;
} __SBT12RD0bits_t;*/
volatile __SBT12RD0bits_t SBT12RD0bits ;//__asm__ ("SBT12RD0") ;//__attribute__((section("sfrs")));
volatile unsigned int        SBT12WR0 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned GROUP0:1;
  unsigned GROUP1:1;
  unsigned GROUP2:1;
  unsigned GROUP3:1;
} __SBT12WR0bits_t;*/
volatile __SBT12WR0bits_t SBT12WR0bits ;//__asm__ ("SBT12WR0") ;//__attribute__((section("sfrs")));
volatile unsigned int        SBT13ELOG1 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned CMD:3;
  unsigned :1;
  unsigned REGION:4;
  unsigned INITID:8;
  unsigned :8;
  unsigned CODE:4;
  unsigned :3;
  unsigned MULTI:1;
} __SBT13ELOG1bits_t;*/
volatile __SBT13ELOG1bits_t SBT13ELOG1bits ;//__asm__ ("SBT13ELOG1") ;//__attribute__((section("sfrs")));
volatile unsigned int        SBT13ELOG2 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned GROUP:2;
} __SBT13ELOG2bits_t;*/
volatile __SBT13ELOG2bits_t SBT13ELOG2bits ;//__asm__ ("SBT13ELOG2") ;//__attribute__((section("sfrs")));
volatile unsigned int        SBT13ECON ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned :24;
  unsigned ERRP:1;
} __SBT13ECONbits_t;*/
volatile __SBT13ECONbits_t SBT13ECONbits ;//__asm__ ("SBT13ECON") ;//__attribute__((section("sfrs")));
volatile unsigned int        SBT13ECLRS ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned CLEAR:1;
} __SBT13ECLRSbits_t;*/
volatile __SBT13ECLRSbits_t SBT13ECLRSbits ;//__asm__ ("SBT13ECLRS") ;//__attribute__((section("sfrs")));
volatile unsigned int        SBT13ECLRM ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned CLEAR:1;
} __SBT13ECLRMbits_t;*/
volatile __SBT13ECLRMbits_t SBT13ECLRMbits ;//__asm__ ("SBT13ECLRM") ;//__attribute__((section("sfrs")));
volatile unsigned int        SBT13REG0 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned :3;
  unsigned SIZE:5;
  unsigned :1;
  unsigned PRI:1;
  unsigned BASE:22;
} __SBT13REG0bits_t;*/
volatile __SBT13REG0bits_t SBT13REG0bits ;//__asm__ ("SBT13REG0") ;//__attribute__((section("sfrs")));
volatile unsigned int        SBT13RD0 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned GROUP0:1;
  unsigned GROUP1:1;
  unsigned GROUP2:1;
  unsigned GROUP3:1;
} __SBT13RD0bits_t;*/
volatile __SBT13RD0bits_t SBT13RD0bits ;//__asm__ ("SBT13RD0") ;//__attribute__((section("sfrs")));
volatile unsigned int        SBT13WR0 ;//__attribute__((section("sfrs")));
/*typedef struct {
  unsigned GROUP0:1;
  unsigned GROUP1:1;
  unsigned GROUP2:1;
  unsigned GROUP3:1;
} __SBT13WR0bits_t;*/
volatile __SBT13WR0bits_t SBT13WR0bits ;//__asm__ ("SBT13WR0") ;//__attribute__((section("sfrs")));
volatile unsigned int        DEVCFG3 ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned USERID:16;
    unsigned :8;
    unsigned FMIIEN:1;
    unsigned FETHIO:1;
    unsigned :1;
    unsigned PGL1WAY:1;
    unsigned PMDL1WAY:1;
    unsigned IOL1WAY:1;
    unsigned FUSBIDIO:1;
  };
  struct {
    unsigned w:32;
  };
} __DEVCFG3bits_t;*/
volatile __DEVCFG3bits_t DEVCFG3bits ;//__asm__ ("DEVCFG3") ;//__attribute__((section("sfrs")));
volatile unsigned int        DEVCFG2 ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned FPLLIDIV:3;
    unsigned :1;
    unsigned FPLLRNG:3;
    unsigned FPLLICLK:1;
    unsigned FPLLMULT:7;
    unsigned :1;
    unsigned FPLLODIV:3;
    unsigned :11;
    unsigned UPLLFSEL:1;
  };
  struct {
    unsigned w:32;
  };
} __DEVCFG2bits_t;*/
volatile __DEVCFG2bits_t DEVCFG2bits ;//__asm__ ("DEVCFG2") ;//__attribute__((section("sfrs")));
volatile unsigned int        DEVCFG1 ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned FNOSC:3;
    unsigned DMTINTV:3;
    unsigned FSOSCEN:1;
    unsigned IESO:1;
    unsigned POSCMOD:2;
    unsigned OSCIOFNC:1;
    unsigned :3;
    unsigned FCKSM:2;
    unsigned WDTPS:5;
    unsigned WDTSPGM:1;
    unsigned WINDIS:1;
    unsigned FWDTEN:1;
    unsigned FWDTWINSZ:2;
    unsigned DMTCNT:5;
    unsigned FDMTEN:1;
  };
  struct {
    unsigned w:32;
  };
} __DEVCFG1bits_t;*/
volatile __DEVCFG1bits_t DEVCFG1bits ;//__asm__ ("DEVCFG1") ;//__attribute__((section("sfrs")));
volatile unsigned int        DEVCFG0 ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned DEBUG:2;
    unsigned JTAGEN:1;
    unsigned ICESEL:2;
    unsigned TRCEN:1;
    unsigned BOOTISA:1;
    unsigned :1;
    unsigned FECCCON:2;
    unsigned FSLEEP:1;
    unsigned :1;
    unsigned DBGPER:3;
    unsigned SMCLR:1;
    unsigned SOSCGAIN:2;
    unsigned SOSCBOOST:1;
    unsigned POSCGAIN:2;
    unsigned POSCBOOST:1;
    unsigned :8;
    unsigned EJTAGBEN:1;
  };
  struct {
    unsigned FDEBUG:2;
  };
  struct {
    unsigned w:32;
  };
} __DEVCFG0bits_t;*/
volatile __DEVCFG0bits_t DEVCFG0bits ;//__asm__ ("DEVCFG0") ;//__attribute__((section("sfrs")));
volatile unsigned int        DEVCP3 ;//__attribute__((section("sfrs")));
volatile unsigned int        DEVCP2 ;//__attribute__((section("sfrs")));
volatile unsigned int        DEVCP1 ;//__attribute__((section("sfrs")));
volatile unsigned int        DEVCP0 ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned :28;
    unsigned CP:1;
  };
  struct {
    unsigned w:32;
  };
} __DEVCP0bits_t;*/
volatile __DEVCP0bits_t DEVCP0bits ;//__asm__ ("DEVCP0") ;//__attribute__((section("sfrs")));
volatile unsigned int        DEVSIGN3 ;//__attribute__((section("sfrs")));
volatile unsigned int        DEVSIGN2 ;//__attribute__((section("sfrs")));
volatile unsigned int        DEVSIGN1 ;//__attribute__((section("sfrs")));
volatile unsigned int        DEVSIGN0 ;//__attribute__((section("sfrs")));
volatile unsigned int        SEQ3 ;//__attribute__((section("sfrs")));
volatile unsigned int        SEQ2 ;//__attribute__((section("sfrs")));
volatile unsigned int        SEQ1 ;//__attribute__((section("sfrs")));
volatile unsigned int        SEQ0 ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned TSEQ:16;
    unsigned CSEQ:16;
  };
  struct {
    unsigned w:32;
  };
} __SEQ0bits_t;*/
