HomuraVehicle/homuraLib_v2/machine/device/p32mz2048efg100_forVC.c
volatile __SEQ0bits_t SEQ0bits ;//__asm__ ("SEQ0") ;//__attribute__((section("sfrs")));
volatile unsigned int        DEVSN0 ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned SN:32;
  };
  struct {
    unsigned w:32;
  };
} __DEVSN0bits_t;*/
volatile __DEVSN0bits_t DEVSN0bits ;//__asm__ ("DEVSN0") ;//__attribute__((section("sfrs")));
volatile unsigned int        DEVSN1 ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned SN:32;
  };
  struct {
    unsigned w:32;
  };
} __DEVSN1bits_t;*/
volatile __DEVSN1bits_t DEVSN1bits ;//__asm__ ("DEVSN1") ;//__attribute__((section("sfrs")));
volatile unsigned int        ADEVCFG3 ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned USERID:16;
    unsigned :8;
    unsigned FMIIEN:1;
    unsigned FETHIO:1;
    unsigned :1;
    unsigned PGL1WAY:1;
    unsigned PMDL1WAY:1;
    unsigned IOL1WAY:1;
    unsigned FUSBIDIO:1;
  };
  struct {
    unsigned w:32;
  };
} __ADEVCFG3bits_t;*/
volatile __ADEVCFG3bits_t ADEVCFG3bits ;//__asm__ ("ADEVCFG3") ;//__attribute__((section("sfrs")));
volatile unsigned int        ADEVCFG2 ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned FPLLIDIV:3;
    unsigned :1;
    unsigned FPLLRNG:3;
    unsigned FPLLICLK:1;
    unsigned FPLLMULT:7;
    unsigned :1;
    unsigned FPLLODIV:3;
    unsigned :11;
    unsigned UPLLFSEL:1;
  };
  struct {
    unsigned w:32;
  };
} __ADEVCFG2bits_t;*/
volatile __ADEVCFG2bits_t ADEVCFG2bits ;//__asm__ ("ADEVCFG2") ;//__attribute__((section("sfrs")));
volatile unsigned int        ADEVCFG1 ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned FNOSC:3;
    unsigned DMTINTV:3;
    unsigned FSOSCEN:1;
    unsigned IESO:1;
    unsigned POSCMOD:2;
    unsigned OSCIOFNC:1;
    unsigned :3;
    unsigned FCKSM:2;
    unsigned WDTPS:5;
    unsigned WDTSPGM:1;
    unsigned WINDIS:1;
    unsigned FWDTEN:1;
    unsigned FWDTWINSZ:2;
    unsigned DMTCNT:5;
    unsigned FDMTEN:1;
  };
  struct {
    unsigned w:32;
  };
} __ADEVCFG1bits_t;*/
volatile __ADEVCFG1bits_t ADEVCFG1bits ;//__asm__ ("ADEVCFG1") ;//__attribute__((section("sfrs")));
volatile unsigned int        ADEVCFG0 ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned DEBUG:2;
    unsigned JTAGEN:1;
    unsigned ICESEL:2;
    unsigned TRCEN:1;
    unsigned BOOTISA:1;
    unsigned :1;
    unsigned FECCCON:2;
    unsigned FSLEEP:1;
    unsigned :1;
    unsigned DBGPER:3;
    unsigned SMCLR:1;
    unsigned SOSCGAIN:2;
    unsigned SOSCBOOST:1;
    unsigned POSCGAIN:2;
    unsigned POSCBOOST:1;
    unsigned :8;
    unsigned EJTAGBEN:1;
  };
  struct {
    unsigned FDEBUG:2;
  };
  struct {
    unsigned w:32;
  };
} __ADEVCFG0bits_t;*/
volatile __ADEVCFG0bits_t ADEVCFG0bits ;//__asm__ ("ADEVCFG0") ;//__attribute__((section("sfrs")));
volatile unsigned int        ADEVCP3 ;//__attribute__((section("sfrs")));
volatile unsigned int        ADEVCP2 ;//__attribute__((section("sfrs")));
volatile unsigned int        ADEVCP1 ;//__attribute__((section("sfrs")));
volatile unsigned int        ADEVCP0 ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned :28;
    unsigned CP:1;
  };
  struct {
    unsigned w:32;
  };
} __ADEVCP0bits_t;*/
volatile __ADEVCP0bits_t ADEVCP0bits ;//__asm__ ("ADEVCP0") ;//__attribute__((section("sfrs")));
volatile unsigned int        ADEVSIGN3 ;//__attribute__((section("sfrs")));
volatile unsigned int        ADEVSIGN2 ;//__attribute__((section("sfrs")));
volatile unsigned int        ADEVSIGN1 ;//__attribute__((section("sfrs")));
volatile unsigned int        ADEVSIGN0 ;//__attribute__((section("sfrs")));
volatile unsigned int        ASEQ3 ;//__attribute__((section("sfrs")));
volatile unsigned int        ASEQ2 ;//__attribute__((section("sfrs")));
volatile unsigned int        ASEQ1 ;//__attribute__((section("sfrs")));
volatile unsigned int        ASEQ0 ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned TSEQ:16;
    unsigned CSEQ:16;
  };
  struct {
    unsigned w:32;
  };
} __ASEQ0bits_t;*/
volatile __ASEQ0bits_t ASEQ0bits ;//__asm__ ("ASEQ0") ;//__attribute__((section("sfrs")));
volatile unsigned int        AUBADEVCFG3 ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned USERID:16;
    unsigned :8;
    unsigned FMIIEN:1;
    unsigned FETHIO:1;
    unsigned :1;
    unsigned PGL1WAY:1;
    unsigned PMDL1WAY:1;
    unsigned IOL1WAY:1;
    unsigned FUSBIDIO:1;
  };
  struct {
    unsigned w:32;
  };
} __AUBADEVCFG3bits_t;*/
volatile __AUBADEVCFG3bits_t AUBADEVCFG3bits ;//__asm__ ("AUBADEVCFG3") ;//__attribute__((section("sfrs")));
volatile unsigned int        AUBADEVCFG2 ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned FPLLIDIV:3;
    unsigned :1;
    unsigned FPLLRNG:3;
    unsigned FPLLICLK:1;
    unsigned FPLLMULT:7;
    unsigned :1;
    unsigned FPLLODIV:3;
    unsigned :11;
    unsigned UPLLFSEL:1;
  };
  struct {
    unsigned w:32;
  };
} __AUBADEVCFG2bits_t;*/
volatile __AUBADEVCFG2bits_t AUBADEVCFG2bits ;//__asm__ ("AUBADEVCFG2") ;//__attribute__((section("sfrs")));
volatile unsigned int        AUBADEVCFG1 ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned FNOSC:3;
    unsigned DMTINTV:3;
    unsigned FSOSCEN:1;
    unsigned IESO:1;
    unsigned POSCMOD:2;
    unsigned OSCIOFNC:1;
    unsigned :3;
    unsigned FCKSM:2;
    unsigned WDTPS:5;
    unsigned WDTSPGM:1;
    unsigned WINDIS:1;
    unsigned FWDTEN:1;
    unsigned FWDTWINSZ:2;
    unsigned DMTCNT:5;
    unsigned FDMTEN:1;
  };
  struct {
    unsigned w:32;
  };
} __AUBADEVCFG1bits_t;*/
volatile __AUBADEVCFG1bits_t AUBADEVCFG1bits ;//__asm__ ("AUBADEVCFG1") ;//__attribute__((section("sfrs")));
volatile unsigned int        AUBADEVCFG0 ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned DEBUG:2;
    unsigned JTAGEN:1;
    unsigned ICESEL:2;
    unsigned TRCEN:1;
    unsigned BOOTISA:1;
    unsigned :1;
    unsigned FECCCON:2;
    unsigned FSLEEP:1;
    unsigned :1;
    unsigned DBGPER:3;
    unsigned SMCLR:1;
    unsigned SOSCGAIN:2;
    unsigned SOSCBOOST:1;
    unsigned POSCGAIN:2;
    unsigned POSCBOOST:1;
    unsigned :8;
    unsigned EJTAGBEN:1;
  };
  struct {
    unsigned FDEBUG:2;
  };
  struct {
    unsigned w:32;
  };
} __AUBADEVCFG0bits_t;*/
volatile __AUBADEVCFG0bits_t AUBADEVCFG0bits ;//__asm__ ("AUBADEVCFG0") ;//__attribute__((section("sfrs")));
volatile unsigned int        AUBADEVCP3 ;//__attribute__((section("sfrs")));
volatile unsigned int        AUBADEVCP2 ;//__attribute__((section("sfrs")));
volatile unsigned int        AUBADEVCP1 ;//__attribute__((section("sfrs")));
volatile unsigned int        AUBADEVCP0 ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned :28;
    unsigned CP:1;
  };
  struct {
    unsigned w:32;
  };
} __AUBADEVCP0bits_t;*/
volatile __AUBADEVCP0bits_t AUBADEVCP0bits ;//__asm__ ("AUBADEVCP0") ;//__attribute__((section("sfrs")));
volatile unsigned int        AUBADEVSIGN3 ;//__attribute__((section("sfrs")));
volatile unsigned int        AUBADEVSIGN2 ;//__attribute__((section("sfrs")));
volatile unsigned int        AUBADEVSIGN1 ;//__attribute__((section("sfrs")));
volatile unsigned int        AUBADEVSIGN0 ;//__attribute__((section("sfrs")));
volatile unsigned int        AUBASEQ3 ;//__attribute__((section("sfrs")));
volatile unsigned int        AUBASEQ2 ;//__attribute__((section("sfrs")));
volatile unsigned int        AUBASEQ1 ;//__attribute__((section("sfrs")));
volatile unsigned int        AUBASEQ0 ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned TSEQ:16;
    unsigned CSEQ:16;
  };
  struct {
    unsigned w:32;
  };
} __AUBASEQ0bits_t;*/
volatile __AUBASEQ0bits_t AUBASEQ0bits ;//__asm__ ("AUBASEQ0") ;//__attribute__((section("sfrs")));
volatile unsigned int        UBADEVCFG3 ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned USERID:16;
    unsigned :8;
    unsigned FMIIEN:1;
    unsigned FETHIO:1;
    unsigned :1;
    unsigned PGL1WAY:1;
    unsigned PMDL1WAY:1;
    unsigned IOL1WAY:1;
    unsigned FUSBIDIO:1;
  };
  struct {
    unsigned w:32;
  };
} __UBADEVCFG3bits_t;*/
volatile __UBADEVCFG3bits_t UBADEVCFG3bits ;//__asm__ ("UBADEVCFG3") ;//__attribute__((section("sfrs")));
volatile unsigned int        UBADEVCFG2 ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned FPLLIDIV:3;
    unsigned :1;
    unsigned FPLLRNG:3;
    unsigned FPLLICLK:1;
    unsigned FPLLMULT:7;
    unsigned :1;
    unsigned FPLLODIV:3;
    unsigned :11;
    unsigned UPLLFSEL:1;
  };
  struct {
    unsigned w:32;
  };
} __UBADEVCFG2bits_t;*/
volatile __UBADEVCFG2bits_t UBADEVCFG2bits ;//__asm__ ("UBADEVCFG2") ;//__attribute__((section("sfrs")));
volatile unsigned int        UBADEVCFG1 ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned FNOSC:3;
    unsigned DMTINTV:3;
    unsigned FSOSCEN:1;
    unsigned IESO:1;
    unsigned POSCMOD:2;
    unsigned OSCIOFNC:1;
    unsigned :3;
    unsigned FCKSM:2;
    unsigned WDTPS:5;
    unsigned WDTSPGM:1;
    unsigned WINDIS:1;
    unsigned FWDTEN:1;
    unsigned FWDTWINSZ:2;
    unsigned DMTCNT:5;
    unsigned FDMTEN:1;
  };
  struct {
    unsigned w:32;
  };
} __UBADEVCFG1bits_t;*/
volatile __UBADEVCFG1bits_t UBADEVCFG1bits ;//__asm__ ("UBADEVCFG1") ;//__attribute__((section("sfrs")));
volatile unsigned int        UBADEVCFG0 ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned DEBUG:2;
    unsigned JTAGEN:1;
    unsigned ICESEL:2;
    unsigned TRCEN:1;
    unsigned BOOTISA:1;
    unsigned :1;
    unsigned FECCCON:2;
    unsigned FSLEEP:1;
    unsigned :1;
    unsigned DBGPER:3;
    unsigned SMCLR:1;
    unsigned SOSCGAIN:2;
    unsigned SOSCBOOST:1;
    unsigned POSCGAIN:2;
    unsigned POSCBOOST:1;
    unsigned :8;
    unsigned EJTAGBEN:1;
  };
  struct {
    unsigned FDEBUG:2;
  };
  struct {
    unsigned w:32;
  };
} __UBADEVCFG0bits_t;*/
volatile __UBADEVCFG0bits_t UBADEVCFG0bits ;//__asm__ ("UBADEVCFG0") ;//__attribute__((section("sfrs")));
volatile unsigned int        UBADEVCP3 ;//__attribute__((section("sfrs")));
volatile unsigned int        UBADEVCP2 ;//__attribute__((section("sfrs")));
volatile unsigned int        UBADEVCP1 ;//__attribute__((section("sfrs")));
volatile unsigned int        UBADEVCP0 ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned :28;
    unsigned CP:1;
  };
  struct {
    unsigned w:32;
  };
} __UBADEVCP0bits_t;*/
