HomuraVehicle/homuraLib_v2/machine/device/p32mz2048efg100_forVC.c
volatile __UBADEVCP0bits_t UBADEVCP0bits ;//__asm__ ("UBADEVCP0") ;//__attribute__((section("sfrs")));
volatile unsigned int        UBADEVSIGN3 ;//__attribute__((section("sfrs")));
volatile unsigned int        UBADEVSIGN2 ;//__attribute__((section("sfrs")));
volatile unsigned int        UBADEVSIGN1 ;//__attribute__((section("sfrs")));
volatile unsigned int        UBADEVSIGN0 ;//__attribute__((section("sfrs")));
volatile unsigned int        UBASEQ3 ;//__attribute__((section("sfrs")));
volatile unsigned int        UBASEQ2 ;//__attribute__((section("sfrs")));
volatile unsigned int        UBASEQ1 ;//__attribute__((section("sfrs")));
volatile unsigned int        UBASEQ0 ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned TSEQ:16;
    unsigned CSEQ:16;
  };
  struct {
    unsigned w:32;
  };
} __UBASEQ0bits_t;*/
volatile __UBASEQ0bits_t UBASEQ0bits ;//__asm__ ("UBASEQ0") ;//__attribute__((section("sfrs")));
volatile unsigned int        ABF1DEVCFG3 ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned USERID:16;
    unsigned :8;
    unsigned FMIIEN:1;
    unsigned FETHIO:1;
    unsigned :1;
    unsigned PGL1WAY:1;
    unsigned PMDL1WAY:1;
    unsigned IOL1WAY:1;
    unsigned FUSBIDIO:1;
  };
  struct {
    unsigned w:32;
  };
} __ABF1DEVCFG3bits_t;*/
volatile __ABF1DEVCFG3bits_t ABF1DEVCFG3bits ;//__asm__ ("ABF1DEVCFG3") ;//__attribute__((section("sfrs")));
volatile unsigned int        ABF1DEVCFG2 ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned FPLLIDIV:3;
    unsigned :1;
    unsigned FPLLRNG:3;
    unsigned FPLLICLK:1;
    unsigned FPLLMULT:7;
    unsigned :1;
    unsigned FPLLODIV:3;
    unsigned :11;
    unsigned UPLLFSEL:1;
  };
  struct {
    unsigned w:32;
  };
} __ABF1DEVCFG2bits_t;*/
volatile __ABF1DEVCFG2bits_t ABF1DEVCFG2bits ;//__asm__ ("ABF1DEVCFG2") ;//__attribute__((section("sfrs")));
volatile unsigned int        ABF1DEVCFG1 ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned FNOSC:3;
    unsigned DMTINTV:3;
    unsigned FSOSCEN:1;
    unsigned IESO:1;
    unsigned POSCMOD:2;
    unsigned OSCIOFNC:1;
    unsigned :3;
    unsigned FCKSM:2;
    unsigned WDTPS:5;
    unsigned WDTSPGM:1;
    unsigned WINDIS:1;
    unsigned FWDTEN:1;
    unsigned FWDTWINSZ:2;
    unsigned DMTCNT:5;
    unsigned FDMTEN:1;
  };
  struct {
    unsigned w:32;
  };
} __ABF1DEVCFG1bits_t;*/
volatile __ABF1DEVCFG1bits_t ABF1DEVCFG1bits ;//__asm__ ("ABF1DEVCFG1") ;//__attribute__((section("sfrs")));
volatile unsigned int        ABF1DEVCFG0 ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned DEBUG:2;
    unsigned JTAGEN:1;
    unsigned ICESEL:2;
    unsigned TRCEN:1;
    unsigned BOOTISA:1;
    unsigned :1;
    unsigned FECCCON:2;
    unsigned FSLEEP:1;
    unsigned :1;
    unsigned DBGPER:3;
    unsigned SMCLR:1;
    unsigned SOSCGAIN:2;
    unsigned SOSCBOOST:1;
    unsigned POSCGAIN:2;
    unsigned POSCBOOST:1;
    unsigned :8;
    unsigned EJTAGBEN:1;
  };
  struct {
    unsigned FDEBUG:2;
  };
  struct {
    unsigned w:32;
  };
} __ABF1DEVCFG0bits_t;*/
volatile __ABF1DEVCFG0bits_t ABF1DEVCFG0bits ;//__asm__ ("ABF1DEVCFG0") ;//__attribute__((section("sfrs")));
volatile unsigned int        ABF1DEVCP3 ;//__attribute__((section("sfrs")));
volatile unsigned int        ABF1DEVCP2 ;//__attribute__((section("sfrs")));
volatile unsigned int        ABF1DEVCP1 ;//__attribute__((section("sfrs")));
volatile unsigned int        ABF1DEVCP0 ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned :28;
    unsigned CP:1;
  };
  struct {
    unsigned w:32;
  };
} __ABF1DEVCP0bits_t;*/
volatile __ABF1DEVCP0bits_t ABF1DEVCP0bits ;//__asm__ ("ABF1DEVCP0") ;//__attribute__((section("sfrs")));
volatile unsigned int        ABF1DEVSIGN3 ;//__attribute__((section("sfrs")));
volatile unsigned int        ABF1DEVSIGN2 ;//__attribute__((section("sfrs")));
volatile unsigned int        ABF1DEVSIGN1 ;//__attribute__((section("sfrs")));
volatile unsigned int        ABF1DEVSIGN0 ;//__attribute__((section("sfrs")));
volatile unsigned int        ABF1SEQ3 ;//__attribute__((section("sfrs")));
volatile unsigned int        ABF1SEQ2 ;//__attribute__((section("sfrs")));
volatile unsigned int        ABF1SEQ1 ;//__attribute__((section("sfrs")));
volatile unsigned int        ABF1SEQ0 ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned TSEQ:16;
    unsigned CSEQ:16;
  };
  struct {
    unsigned w:32;
  };
} __ABF1SEQ0bits_t;*/
volatile __ABF1SEQ0bits_t ABF1SEQ0bits ;//__asm__ ("ABF1SEQ0") ;//__attribute__((section("sfrs")));
volatile unsigned int        BF1DEVCFG3 ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned USERID:16;
    unsigned :8;
    unsigned FMIIEN:1;
    unsigned FETHIO:1;
    unsigned :1;
    unsigned PGL1WAY:1;
    unsigned PMDL1WAY:1;
    unsigned IOL1WAY:1;
    unsigned FUSBIDIO:1;
  };
  struct {
    unsigned w:32;
  };
} __BF1DEVCFG3bits_t;*/
volatile __BF1DEVCFG3bits_t BF1DEVCFG3bits ;//__asm__ ("BF1DEVCFG3") ;//__attribute__((section("sfrs")));
volatile unsigned int        BF1DEVCFG2 ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned FPLLIDIV:3;
    unsigned :1;
    unsigned FPLLRNG:3;
    unsigned FPLLICLK:1;
    unsigned FPLLMULT:7;
    unsigned :1;
    unsigned FPLLODIV:3;
    unsigned :11;
    unsigned UPLLFSEL:1;
  };
  struct {
    unsigned w:32;
  };
} __BF1DEVCFG2bits_t;*/
volatile __BF1DEVCFG2bits_t BF1DEVCFG2bits ;//__asm__ ("BF1DEVCFG2") ;//__attribute__((section("sfrs")));
volatile unsigned int        BF1DEVCFG1 ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned FNOSC:3;
    unsigned DMTINTV:3;
    unsigned FSOSCEN:1;
    unsigned IESO:1;
    unsigned POSCMOD:2;
    unsigned OSCIOFNC:1;
    unsigned :3;
    unsigned FCKSM:2;
    unsigned WDTPS:5;
    unsigned WDTSPGM:1;
    unsigned WINDIS:1;
    unsigned FWDTEN:1;
    unsigned FWDTWINSZ:2;
    unsigned DMTCNT:5;
    unsigned FDMTEN:1;
  };
  struct {
    unsigned w:32;
  };
} __BF1DEVCFG1bits_t;*/
