HomuraVehicle/homuraLib_v2/machine/device/p32mz2048efg100_forVC.c
volatile __BF1DEVCFG1bits_t BF1DEVCFG1bits ;//__asm__ ("BF1DEVCFG1") ;//__attribute__((section("sfrs")));
volatile unsigned int        BF1DEVCFG0 ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned DEBUG:2;
    unsigned JTAGEN:1;
    unsigned ICESEL:2;
    unsigned TRCEN:1;
    unsigned BOOTISA:1;
    unsigned :1;
    unsigned FECCCON:2;
    unsigned FSLEEP:1;
    unsigned :1;
    unsigned DBGPER:3;
    unsigned SMCLR:1;
    unsigned SOSCGAIN:2;
    unsigned SOSCBOOST:1;
    unsigned POSCGAIN:2;
    unsigned POSCBOOST:1;
    unsigned :8;
    unsigned EJTAGBEN:1;
  };
  struct {
    unsigned FDEBUG:2;
  };
  struct {
    unsigned w:32;
  };
} __BF1DEVCFG0bits_t;*/
volatile __BF1DEVCFG0bits_t BF1DEVCFG0bits ;//__asm__ ("BF1DEVCFG0") ;//__attribute__((section("sfrs")));
volatile unsigned int        BF1DEVCP3 ;//__attribute__((section("sfrs")));
volatile unsigned int        BF1DEVCP2 ;//__attribute__((section("sfrs")));
volatile unsigned int        BF1DEVCP1 ;//__attribute__((section("sfrs")));
volatile unsigned int        BF1DEVCP0 ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned :28;
    unsigned CP:1;
  };
  struct {
    unsigned w:32;
  };
} __BF1DEVCP0bits_t;*/
volatile __BF1DEVCP0bits_t BF1DEVCP0bits ;//__asm__ ("BF1DEVCP0") ;//__attribute__((section("sfrs")));
volatile unsigned int        BF1DEVSIGN3 ;//__attribute__((section("sfrs")));
volatile unsigned int        BF1DEVSIGN2 ;//__attribute__((section("sfrs")));
volatile unsigned int        BF1DEVSIGN1 ;//__attribute__((section("sfrs")));
volatile unsigned int        BF1DEVSIGN0 ;//__attribute__((section("sfrs")));
volatile unsigned int        BF1SEQ3 ;//__attribute__((section("sfrs")));
volatile unsigned int        BF1SEQ2 ;//__attribute__((section("sfrs")));
volatile unsigned int        BF1SEQ1 ;//__attribute__((section("sfrs")));
volatile unsigned int        BF1SEQ0 ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned TSEQ:16;
    unsigned CSEQ:16;
  };
  struct {
    unsigned w:32;
  };
} __BF1SEQ0bits_t;*/
volatile __BF1SEQ0bits_t BF1SEQ0bits ;//__asm__ ("BF1SEQ0") ;//__attribute__((section("sfrs")));
volatile unsigned int        ABF2DEVCFG3 ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned USERID:16;
    unsigned :8;
    unsigned FMIIEN:1;
    unsigned FETHIO:1;
    unsigned :1;
    unsigned PGL1WAY:1;
    unsigned PMDL1WAY:1;
    unsigned IOL1WAY:1;
    unsigned FUSBIDIO:1;
  };
  struct {
    unsigned w:32;
  };
} __ABF2DEVCFG3bits_t;*/
volatile __ABF2DEVCFG3bits_t ABF2DEVCFG3bits ;//__asm__ ("ABF2DEVCFG3") ;//__attribute__((section("sfrs")));
volatile unsigned int        ABF2DEVCFG2 ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned FPLLIDIV:3;
    unsigned :1;
    unsigned FPLLRNG:3;
    unsigned FPLLICLK:1;
    unsigned FPLLMULT:7;
    unsigned :1;
    unsigned FPLLODIV:3;
    unsigned :11;
    unsigned UPLLFSEL:1;
  };
  struct {
    unsigned w:32;
  };
} __ABF2DEVCFG2bits_t;*/
volatile __ABF2DEVCFG2bits_t ABF2DEVCFG2bits ;//__asm__ ("ABF2DEVCFG2") ;//__attribute__((section("sfrs")));
volatile unsigned int        ABF2DEVCFG1 ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned FNOSC:3;
    unsigned DMTINTV:3;
    unsigned FSOSCEN:1;
    unsigned IESO:1;
    unsigned POSCMOD:2;
    unsigned OSCIOFNC:1;
    unsigned :3;
    unsigned FCKSM:2;
    unsigned WDTPS:5;
    unsigned WDTSPGM:1;
    unsigned WINDIS:1;
    unsigned FWDTEN:1;
    unsigned FWDTWINSZ:2;
    unsigned DMTCNT:5;
    unsigned FDMTEN:1;
  };
  struct {
    unsigned w:32;
  };
} __ABF2DEVCFG1bits_t;*/
volatile __ABF2DEVCFG1bits_t ABF2DEVCFG1bits ;//__asm__ ("ABF2DEVCFG1") ;//__attribute__((section("sfrs")));
volatile unsigned int        ABF2DEVCFG0 ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned DEBUG:2;
    unsigned JTAGEN:1;
    unsigned ICESEL:2;
    unsigned TRCEN:1;
    unsigned BOOTISA:1;
    unsigned :1;
    unsigned FECCCON:2;
    unsigned FSLEEP:1;
    unsigned :1;
    unsigned DBGPER:3;
    unsigned SMCLR:1;
    unsigned SOSCGAIN:2;
    unsigned SOSCBOOST:1;
    unsigned POSCGAIN:2;
    unsigned POSCBOOST:1;
    unsigned :8;
    unsigned EJTAGBEN:1;
  };
  struct {
    unsigned FDEBUG:2;
  };
  struct {
    unsigned w:32;
  };
} __ABF2DEVCFG0bits_t;*/
volatile __ABF2DEVCFG0bits_t ABF2DEVCFG0bits ;//__asm__ ("ABF2DEVCFG0") ;//__attribute__((section("sfrs")));
volatile unsigned int        ABF2DEVCP3 ;//__attribute__((section("sfrs")));
volatile unsigned int        ABF2DEVCP2 ;//__attribute__((section("sfrs")));
volatile unsigned int        ABF2DEVCP1 ;//__attribute__((section("sfrs")));
volatile unsigned int        ABF2DEVCP0 ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned :28;
    unsigned CP:1;
  };
  struct {
    unsigned w:32;
  };
} __ABF2DEVCP0bits_t;*/
volatile __ABF2DEVCP0bits_t ABF2DEVCP0bits ;//__asm__ ("ABF2DEVCP0") ;//__attribute__((section("sfrs")));
volatile unsigned int        ABF2DEVSIGN3 ;//__attribute__((section("sfrs")));
volatile unsigned int        ABF2DEVSIGN2 ;//__attribute__((section("sfrs")));
volatile unsigned int        ABF2DEVSIGN1 ;//__attribute__((section("sfrs")));
volatile unsigned int        ABF2DEVSIGN0 ;//__attribute__((section("sfrs")));
volatile unsigned int        ABF2SEQ3 ;//__attribute__((section("sfrs")));
volatile unsigned int        ABF2SEQ2 ;//__attribute__((section("sfrs")));
volatile unsigned int        ABF2SEQ1 ;//__attribute__((section("sfrs")));
volatile unsigned int        ABF2SEQ0 ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned TSEQ:16;
    unsigned CSEQ:16;
  };
  struct {
    unsigned w:32;
  };
} __ABF2SEQ0bits_t;*/
volatile __ABF2SEQ0bits_t ABF2SEQ0bits ;//__asm__ ("ABF2SEQ0") ;//__attribute__((section("sfrs")));
volatile unsigned int        BF2DEVCFG3 ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned USERID:16;
    unsigned :8;
    unsigned FMIIEN:1;
    unsigned FETHIO:1;
    unsigned :1;
    unsigned PGL1WAY:1;
    unsigned PMDL1WAY:1;
    unsigned IOL1WAY:1;
    unsigned FUSBIDIO:1;
  };
  struct {
    unsigned w:32;
  };
} __BF2DEVCFG3bits_t;*/
volatile __BF2DEVCFG3bits_t BF2DEVCFG3bits ;//__asm__ ("BF2DEVCFG3") ;//__attribute__((section("sfrs")));
volatile unsigned int        BF2DEVCFG2 ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned FPLLIDIV:3;
    unsigned :1;
    unsigned FPLLRNG:3;
    unsigned FPLLICLK:1;
    unsigned FPLLMULT:7;
    unsigned :1;
    unsigned FPLLODIV:3;
    unsigned :11;
    unsigned UPLLFSEL:1;
  };
  struct {
    unsigned w:32;
  };
} __BF2DEVCFG2bits_t;*/
volatile __BF2DEVCFG2bits_t BF2DEVCFG2bits ;//__asm__ ("BF2DEVCFG2") ;//__attribute__((section("sfrs")));
volatile unsigned int        BF2DEVCFG1 ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned FNOSC:3;
    unsigned DMTINTV:3;
    unsigned FSOSCEN:1;
    unsigned IESO:1;
    unsigned POSCMOD:2;
    unsigned OSCIOFNC:1;
    unsigned :3;
    unsigned FCKSM:2;
    unsigned WDTPS:5;
    unsigned WDTSPGM:1;
    unsigned WINDIS:1;
    unsigned FWDTEN:1;
    unsigned FWDTWINSZ:2;
    unsigned DMTCNT:5;
    unsigned FDMTEN:1;
  };
  struct {
    unsigned w:32;
  };
} __BF2DEVCFG1bits_t;*/
volatile __BF2DEVCFG1bits_t BF2DEVCFG1bits ;//__asm__ ("BF2DEVCFG1") ;//__attribute__((section("sfrs")));
volatile unsigned int        BF2DEVCFG0 ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned DEBUG:2;
    unsigned JTAGEN:1;
    unsigned ICESEL:2;
    unsigned TRCEN:1;
    unsigned BOOTISA:1;
    unsigned :1;
    unsigned FECCCON:2;
    unsigned FSLEEP:1;
    unsigned :1;
    unsigned DBGPER:3;
    unsigned SMCLR:1;
    unsigned SOSCGAIN:2;
    unsigned SOSCBOOST:1;
    unsigned POSCGAIN:2;
    unsigned POSCBOOST:1;
    unsigned :8;
    unsigned EJTAGBEN:1;
  };
  struct {
    unsigned FDEBUG:2;
  };
  struct {
    unsigned w:32;
  };
} __BF2DEVCFG0bits_t;*/
volatile __BF2DEVCFG0bits_t BF2DEVCFG0bits ;//__asm__ ("BF2DEVCFG0") ;//__attribute__((section("sfrs")));
volatile unsigned int        BF2DEVCP3 ;//__attribute__((section("sfrs")));
volatile unsigned int        BF2DEVCP2 ;//__attribute__((section("sfrs")));
volatile unsigned int        BF2DEVCP1 ;//__attribute__((section("sfrs")));
volatile unsigned int        BF2DEVCP0 ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned :28;
    unsigned CP:1;
  };
  struct {
    unsigned w:32;
  };
} __BF2DEVCP0bits_t;*/
volatile __BF2DEVCP0bits_t BF2DEVCP0bits ;//__asm__ ("BF2DEVCP0") ;//__attribute__((section("sfrs")));
volatile unsigned int        BF2DEVSIGN3 ;//__attribute__((section("sfrs")));
volatile unsigned int        BF2DEVSIGN2 ;//__attribute__((section("sfrs")));
volatile unsigned int        BF2DEVSIGN1 ;//__attribute__((section("sfrs")));
volatile unsigned int        BF2DEVSIGN0 ;//__attribute__((section("sfrs")));
volatile unsigned int        BF2SEQ3 ;//__attribute__((section("sfrs")));
volatile unsigned int        BF2SEQ2 ;//__attribute__((section("sfrs")));
volatile unsigned int        BF2SEQ1 ;//__attribute__((section("sfrs")));
volatile unsigned int        BF2SEQ0 ;//__attribute__((section("sfrs")));
/*typedef union {
  struct {
    unsigned TSEQ:16;
    unsigned CSEQ:16;
  };
  struct {
    unsigned w:32;
  };
} __BF2SEQ0bits_t;*/
volatile __BF2SEQ0bits_t BF2SEQ0bits ;//__asm__ ("BF2SEQ0") ;//__attribute__((section("sfrs")));
#ifdef __cplusplus
}
#endif

