HomuraVehicle/homuraLib_v2/machine/device/p32mz2048efg100_forVC.c
#elif defined (__LANGUAGE_ASSEMBLY__)
  .CFGCON           /* 0xBF800000 */
  .DEVID            /* 0xBF800020 */
  .SYSKEY           /* 0xBF800030 */
  .PMD1             /* 0xBF800040 */
  .PMD1CLR          /* 0xBF800044 */
  .PMD1SET          /* 0xBF800048 */
  .PMD1INV          /* 0xBF80004C */
  .PMD2             /* 0xBF800050 */
  .PMD2CLR          /* 0xBF800054 */
  .PMD2SET          /* 0xBF800058 */
  .PMD2INV          /* 0xBF80005C */
  .PMD3             /* 0xBF800060 */
  .PMD3CLR          /* 0xBF800064 */
  .PMD3SET          /* 0xBF800068 */
  .PMD3INV          /* 0xBF80006C */
  .PMD4             /* 0xBF800070 */
  .PMD4CLR          /* 0xBF800074 */
  .PMD4SET          /* 0xBF800078 */
  .PMD4INV          /* 0xBF80007C */
  .PMD5             /* 0xBF800080 */
  .PMD5CLR          /* 0xBF800084 */
  .PMD5SET          /* 0xBF800088 */
  .PMD5INV          /* 0xBF80008C */
  .PMD6             /* 0xBF800090 */
  .PMD6CLR          /* 0xBF800094 */
  .PMD6SET          /* 0xBF800098 */
  .PMD6INV          /* 0xBF80009C */
  .PMD7             /* 0xBF8000A0 */
  .PMD7CLR          /* 0xBF8000A4 */
  .PMD7SET          /* 0xBF8000A8 */
  .PMD7INV          /* 0xBF8000AC */
  .CFGEBIA          /* 0xBF8000C0 */
  .CFGEBIACLR       /* 0xBF8000C4 */
  .CFGEBIASET       /* 0xBF8000C8 */
  .CFGEBIAINV       /* 0xBF8000CC */
  .CFGEBIC          /* 0xBF8000D0 */
  .CFGEBICCLR       /* 0xBF8000D4 */
  .CFGEBICSET       /* 0xBF8000D8 */
  .CFGEBICINV       /* 0xBF8000DC */
  .CFGPG            /* 0xBF8000E0 */
  .CFGPGCLR         /* 0xBF8000E4 */
  .CFGPGSET         /* 0xBF8000E8 */
  .CFGPGINV         /* 0xBF8000EC */
  .NVMCON           /* 0xBF800600 */
  .NVMCONCLR        /* 0xBF800604 */
  .NVMCONSET        /* 0xBF800608 */
  .NVMCONINV        /* 0xBF80060C */
  .NVMKEY           /* 0xBF800610 */
  .NVMADDR          /* 0xBF800620 */
  .NVMADDRCLR       /* 0xBF800624 */
  .NVMADDRSET       /* 0xBF800628 */
  .NVMADDRINV       /* 0xBF80062C */
  .NVMDATA0         /* 0xBF800630 */
  .NVMDATA1         /* 0xBF800640 */
  .NVMDATA2         /* 0xBF800650 */
  .NVMDATA3         /* 0xBF800660 */
  .NVMSRCADDR       /* 0xBF800670 */
  .NVMPWP           /* 0xBF800680 */
  .NVMBWP           /* 0xBF800690 */
  .NVMBWPCLR        /* 0xBF800694 */
  .NVMBWPSET        /* 0xBF800698 */
  .NVMBWPINV        /* 0xBF80069C */
  .NVMCON2          /* 0xBF8006A0 */
  .WDTCON           /* 0xBF800800 */
  .WDTCONCLR        /* 0xBF800804 */
  .WDTCONSET        /* 0xBF800808 */
  .WDTCONINV        /* 0xBF80080C */
  .DMTCON           /* 0xBF800A00 */
  .DMTPRECLR        /* 0xBF800A10 */
  .DMTCLR           /* 0xBF800A20 */
  .DMTSTAT          /* 0xBF800A30 */
  .DMTCNT           /* 0xBF800A40 */
  .DMTPSCNT         /* 0xBF800A60 */
  .DMTPSINTV        /* 0xBF800A70 */
  .RTCCON           /* 0xBF800C00 */
  .RTCCONCLR        /* 0xBF800C04 */
  .RTCCONSET        /* 0xBF800C08 */
  .RTCCONINV        /* 0xBF800C0C */
  .RTCALRM          /* 0xBF800C10 */
  .RTCALRMCLR       /* 0xBF800C14 */
  .RTCALRMSET       /* 0xBF800C18 */
  .RTCALRMINV       /* 0xBF800C1C */
  .RTCTIME          /* 0xBF800C20 */
  .RTCTIMECLR       /* 0xBF800C24 */
  .RTCTIMESET       /* 0xBF800C28 */
  .RTCTIMEINV       /* 0xBF800C2C */
  .RTCDATE          /* 0xBF800C30 */
  .RTCDATECLR       /* 0xBF800C34 */
  .RTCDATESET       /* 0xBF800C38 */
  .RTCDATEINV       /* 0xBF800C3C */
  .ALRMTIME         /* 0xBF800C40 */
  .ALRMTIMECLR      /* 0xBF800C44 */
  .ALRMTIMESET      /* 0xBF800C48 */
  .ALRMTIMEINV      /* 0xBF800C4C */
  .ALRMDATE         /* 0xBF800C50 */
  .ALRMDATECLR      /* 0xBF800C54 */
  .ALRMDATESET      /* 0xBF800C58 */
  .ALRMDATEINV      /* 0xBF800C5C */
  .CVRCON           /* 0xBF800E00 */
  .CVRCONCLR        /* 0xBF800E04 */
  .CVRCONSET        /* 0xBF800E08 */
  .CVRCONINV        /* 0xBF800E0C */
  ._ICDCON          /* 0xBF801130 */
  ._ICDSTAT         /* 0xBF801140 */
  .OSCCON           /* 0xBF801200 */
  .OSCCONCLR        /* 0xBF801204 */
  .OSCCONSET        /* 0xBF801208 */
  .OSCCONINV        /* 0xBF80120C */
  .OSCTUN           /* 0xBF801210 */
  .OSCTUNCLR        /* 0xBF801214 */
  .OSCTUNSET        /* 0xBF801218 */
  .OSCTUNINV        /* 0xBF80121C */
  .SPLLCON          /* 0xBF801220 */
  .SPLLCONCLR       /* 0xBF801224 */
  .SPLLCONSET       /* 0xBF801228 */
  .SPLLCONINV       /* 0xBF80122C */
  .RCON             /* 0xBF801240 */
  .RCONCLR          /* 0xBF801244 */
  .RCONSET          /* 0xBF801248 */
  .RCONINV          /* 0xBF80124C */
  .RSWRST           /* 0xBF801250 */
  .RSWRSTCLR        /* 0xBF801254 */
  .RSWRSTSET        /* 0xBF801258 */
  .RSWRSTINV        /* 0xBF80125C */
  .RNMICON          /* 0xBF801260 */
  .RNMICONCLR       /* 0xBF801264 */
  .RNMICONSET       /* 0xBF801268 */
  .RNMICONINV       /* 0xBF80126C */
  .PWRCON           /* 0xBF801270 */
  .PWRCONCLR        /* 0xBF801274 */
  .PWRCONSET        /* 0xBF801278 */
  .PWRCONINV        /* 0xBF80127C */
  .REFO1CON         /* 0xBF801280 */
  .REFO1CONCLR      /* 0xBF801284 */
  .REFO1CONSET      /* 0xBF801288 */
  .REFO1CONINV      /* 0xBF80128C */
  .REFO1TRIM        /* 0xBF801290 */
  .REFO1TRIMCLR     /* 0xBF801294 */
  .REFO1TRIMSET     /* 0xBF801298 */
  .REFO1TRIMINV     /* 0xBF80129C */
  .REFO2CON         /* 0xBF8012A0 */
  .REFO2CONCLR      /* 0xBF8012A4 */
  .REFO2CONSET      /* 0xBF8012A8 */
  .REFO2CONINV      /* 0xBF8012AC */
  .REFO2TRIM        /* 0xBF8012B0 */
  .REFO2TRIMCLR     /* 0xBF8012B4 */
  .REFO2TRIMSET     /* 0xBF8012B8 */
  .REFO2TRIMINV     /* 0xBF8012BC */
  .REFO3CON         /* 0xBF8012C0 */
  .REFO3CONCLR      /* 0xBF8012C4 */
  .REFO3CONSET      /* 0xBF8012C8 */
  .REFO3CONINV      /* 0xBF8012CC */
  .REFO3TRIM        /* 0xBF8012D0 */
  .REFO3TRIMCLR     /* 0xBF8012D4 */
  .REFO3TRIMSET     /* 0xBF8012D8 */
  .REFO3TRIMINV     /* 0xBF8012DC */
  .REFO4CON         /* 0xBF8012E0 */
  .REFO4CONCLR      /* 0xBF8012E4 */
  .REFO4CONSET      /* 0xBF8012E8 */
  .REFO4CONINV      /* 0xBF8012EC */
  .REFO4TRIM        /* 0xBF8012F0 */
  .REFO4TRIMCLR     /* 0xBF8012F4 */
  .REFO4TRIMSET     /* 0xBF8012F8 */
  .REFO4TRIMINV     /* 0xBF8012FC */
  .PB1DIV           /* 0xBF801300 */
  .PB1DIVCLR        /* 0xBF801304 */
  .PB1DIVSET        /* 0xBF801308 */
  .PB1DIVINV        /* 0xBF80130C */
  .PB2DIV           /* 0xBF801310 */
  .PB2DIVCLR        /* 0xBF801314 */
  .PB2DIVSET        /* 0xBF801318 */
  .PB2DIVINV        /* 0xBF80131C */
  .PB3DIV           /* 0xBF801320 */
  .PB3DIVCLR        /* 0xBF801324 */
  .PB3DIVSET        /* 0xBF801328 */
  .PB3DIVINV        /* 0xBF80132C */
  .PB4DIV           /* 0xBF801330 */
  .PB4DIVCLR        /* 0xBF801334 */
  .PB4DIVSET        /* 0xBF801338 */
  .PB4DIVINV        /* 0xBF80133C */
  .PB5DIV           /* 0xBF801340 */
  .PB5DIVCLR        /* 0xBF801344 */
  .PB5DIVSET        /* 0xBF801348 */
  .PB5DIVINV        /* 0xBF80134C */
  .PB7DIV           /* 0xBF801360 */
  .PB7DIVCLR        /* 0xBF801364 */
  .PB7DIVSET        /* 0xBF801368 */
  .PB7DIVINV        /* 0xBF80136C */
  .PB8DIV           /* 0xBF801370 */
  .PB8DIVCLR        /* 0xBF801374 */
  .PB8DIVSET        /* 0xBF801378 */
  .PB8DIVINV        /* 0xBF80137C */
  .SLEWCON          /* 0xBF8013C0 */
  .SLEWCONCLR       /* 0xBF8013C4 */
  .SLEWCONSET       /* 0xBF8013C8 */
  .SLEWCONINV       /* 0xBF8013CC */
  .CLKSTAT          /* 0xBF8013D0 */
  .CLKSTATCLR       /* 0xBF8013D4 */
  .CLKSTATSET       /* 0xBF8013D8 */
  .CLKSTATINV       /* 0xBF8013DC */
  .INT1R            /* 0xBF801404 */
  .INT2R            /* 0xBF801408 */
  .INT3R            /* 0xBF80140C */
  .INT4R            /* 0xBF801410 */
  .T2CKR            /* 0xBF801418 */
  .T3CKR            /* 0xBF80141C */
  .T4CKR            /* 0xBF801420 */
  .T5CKR            /* 0xBF801424 */
  .T6CKR            /* 0xBF801428 */
  .T7CKR            /* 0xBF80142C */
  .T8CKR            /* 0xBF801430 */
  .T9CKR            /* 0xBF801434 */
  .IC1R             /* 0xBF801438 */
  .IC2R             /* 0xBF80143C */
  .IC3R             /* 0xBF801440 */
  .IC4R             /* 0xBF801444 */
  .IC5R             /* 0xBF801448 */
  .IC6R             /* 0xBF80144C */
  .IC7R             /* 0xBF801450 */
  .IC8R             /* 0xBF801454 */
  .IC9R             /* 0xBF801458 */
  .OCFAR            /* 0xBF801460 */
  .U1RXR            /* 0xBF801468 */
  .U1CTSR           /* 0xBF80146C */
  .U2RXR            /* 0xBF801470 */
  .U2CTSR           /* 0xBF801474 */
  .U3RXR            /* 0xBF801478 */
  .U3CTSR           /* 0xBF80147C */
  .U4RXR            /* 0xBF801480 */
  .U4CTSR           /* 0xBF801484 */
  .U5RXR            /* 0xBF801488 */
  .U5CTSR           /* 0xBF80148C */
  .U6RXR            /* 0xBF801490 */
  .U6CTSR           /* 0xBF801494 */
  .SDI1R            /* 0xBF80149C */
  .SS1R             /* 0xBF8014A0 */
  .SDI2R            /* 0xBF8014A8 */
  .SS2R             /* 0xBF8014AC */
  .SDI3R            /* 0xBF8014B4 */
  .SS3R             /* 0xBF8014B8 */
  .SDI4R            /* 0xBF8014C0 */
  .SS4R             /* 0xBF8014C4 */
  .SDI5R            /* 0xBF8014CC */
  .SS5R             /* 0xBF8014D0 */
  .SDI6R            /* 0xBF8014D8 */
  .SS6R             /* 0xBF8014DC */
  .C1RXR            /* 0xBF8014E0 */
  .C2RXR            /* 0xBF8014E4 */
  .REFCLKI1R        /* 0xBF8014E8 */
  .REFCLKI3R        /* 0xBF8014F0 */
  .REFCLKI4R        /* 0xBF8014F4 */
  .RPA14R           /* 0xBF801538 */
  .RPA15R           /* 0xBF80153C */
  .RPB0R            /* 0xBF801540 */
  .RPB1R            /* 0xBF801544 */
  .RPB2R            /* 0xBF801548 */
  .RPB3R            /* 0xBF80154C */
  .RPB5R            /* 0xBF801554 */
  .RPB6R            /* 0xBF801558 */
  .RPB7R            /* 0xBF80155C */
  .RPB8R            /* 0xBF801560 */
  .RPB9R            /* 0xBF801564 */
  .RPB10R           /* 0xBF801568 */
  .RPB14R           /* 0xBF801578 */
  .RPB15R           /* 0xBF80157C */
  .RPC1R            /* 0xBF801584 */
  .RPC2R            /* 0xBF801588 */
  .RPC3R            /* 0xBF80158C */
  .RPC4R            /* 0xBF801590 */
  .RPC13R           /* 0xBF8015B4 */
  .RPC14R           /* 0xBF8015B8 */
  .RPD0R            /* 0xBF8015C0 */
  .RPD1R            /* 0xBF8015C4 */
  .RPD2R            /* 0xBF8015C8 */
  .RPD3R            /* 0xBF8015CC */
  .RPD4R            /* 0xBF8015D0 */
  .RPD5R            /* 0xBF8015D4 */
  .RPD9R            /* 0xBF8015E4 */
  .RPD10R           /* 0xBF8015E8 */
  .RPD11R           /* 0xBF8015EC */
  .RPD12R           /* 0xBF8015F0 */
  .RPD14R           /* 0xBF8015F8 */
  .RPD15R           /* 0xBF8015FC */
  .RPE3R            /* 0xBF80160C */
  .RPE5R            /* 0xBF801614 */
  .RPE8R            /* 0xBF801620 */
  .RPE9R            /* 0xBF801624 */
  .RPF0R            /* 0xBF801640 */
  .RPF1R            /* 0xBF801644 */
  .RPF2R            /* 0xBF801648 */
  .RPF3R            /* 0xBF80164C */
  .RPF4R            /* 0xBF801650 */
  .RPF5R            /* 0xBF801654 */
  .RPF8R            /* 0xBF801660 */
  .RPF12R           /* 0xBF801670 */
  .RPF13R           /* 0xBF801674 */
  .RPG0R            /* 0xBF801680 */
  .RPG1R            /* 0xBF801684 */
  .RPG6R            /* 0xBF801698 */
  .RPG7R            /* 0xBF80169C */
  .RPG8R            /* 0xBF8016A0 */
  .RPG9R            /* 0xBF8016A4 */
  .INTCON           /* 0xBF810000 */
  .INTCONCLR        /* 0xBF810004 */
  .INTCONSET        /* 0xBF810008 */
  .INTCONINV        /* 0xBF81000C */
  .PRISS            /* 0xBF810010 */
  .PRISSCLR         /* 0xBF810014 */
  .PRISSSET         /* 0xBF810018 */
  .PRISSINV         /* 0xBF81001C */
  .INTSTAT          /* 0xBF810020 */
  .INTSTATCLR       /* 0xBF810024 */
  .INTSTATSET       /* 0xBF810028 */
  .INTSTATINV       /* 0xBF81002C */
  .IPTMR            /* 0xBF810030 */
  .IPTMRCLR         /* 0xBF810034 */
  .IPTMRSET         /* 0xBF810038 */
  .IPTMRINV         /* 0xBF81003C */
  .IFS0             /* 0xBF810040 */
  .IFS0CLR          /* 0xBF810044 */
  .IFS0SET          /* 0xBF810048 */
  .IFS0INV          /* 0xBF81004C */
  .IFS1             /* 0xBF810050 */
  .IFS1CLR          /* 0xBF810054 */
  .IFS1SET          /* 0xBF810058 */
  .IFS1INV          /* 0xBF81005C */
  .IFS2             /* 0xBF810060 */
  .IFS2CLR          /* 0xBF810064 */
  .IFS2SET          /* 0xBF810068 */
  .IFS2INV          /* 0xBF81006C */
  .IFS3             /* 0xBF810070 */
  .IFS3CLR          /* 0xBF810074 */
  .IFS3SET          /* 0xBF810078 */
  .IFS3INV          /* 0xBF81007C */
  .IFS4             /* 0xBF810080 */
  .IFS4CLR          /* 0xBF810084 */
  .IFS4SET          /* 0xBF810088 */
  .IFS4INV          /* 0xBF81008C */
  .IFS5             /* 0xBF810090 */
  .IFS5CLR          /* 0xBF810094 */
  .IFS5SET          /* 0xBF810098 */
  .IFS5INV          /* 0xBF81009C */
  .IFS6             /* 0xBF8100A0 */
  .IFS6CLR          /* 0xBF8100A4 */
  .IFS6SET          /* 0xBF8100A8 */
  .IFS6INV          /* 0xBF8100AC */
  .IEC0             /* 0xBF8100C0 */
  .IEC0CLR          /* 0xBF8100C4 */
  .IEC0SET          /* 0xBF8100C8 */
  .IEC0INV          /* 0xBF8100CC */
  .IEC1             /* 0xBF8100D0 */
  .IEC1CLR          /* 0xBF8100D4 */
  .IEC1SET          /* 0xBF8100D8 */
  .IEC1INV          /* 0xBF8100DC */
  .IEC2             /* 0xBF8100E0 */
  .IEC2CLR          /* 0xBF8100E4 */
  .IEC2SET          /* 0xBF8100E8 */
  .IEC2INV          /* 0xBF8100EC */
  .IEC3             /* 0xBF8100F0 */
  .IEC3CLR          /* 0xBF8100F4 */
  .IEC3SET          /* 0xBF8100F8 */
  .IEC3INV          /* 0xBF8100FC */
  .IEC4             /* 0xBF810100 */
  .IEC4CLR          /* 0xBF810104 */
  .IEC4SET          /* 0xBF810108 */
  .IEC4INV          /* 0xBF81010C */
  .IEC5             /* 0xBF810110 */
  .IEC5CLR          /* 0xBF810114 */
  .IEC5SET          /* 0xBF810118 */
  .IEC5INV          /* 0xBF81011C */
  .IEC6             /* 0xBF810120 */
  .IEC6CLR          /* 0xBF810124 */
  .IEC6SET          /* 0xBF810128 */
  .IEC6INV          /* 0xBF81012C */
  .IPC0             /* 0xBF810140 */
  .IPC0CLR          /* 0xBF810144 */
  .IPC0SET          /* 0xBF810148 */
  .IPC0INV          /* 0xBF81014C */
  .IPC1             /* 0xBF810150 */
  .IPC1CLR          /* 0xBF810154 */
  .IPC1SET          /* 0xBF810158 */
  .IPC1INV          /* 0xBF81015C */
  .IPC2             /* 0xBF810160 */
  .IPC2CLR          /* 0xBF810164 */
  .IPC2SET          /* 0xBF810168 */
  .IPC2INV          /* 0xBF81016C */
  .IPC3             /* 0xBF810170 */
  .IPC3CLR          /* 0xBF810174 */
  .IPC3SET          /* 0xBF810178 */
  .IPC3INV          /* 0xBF81017C */
  .IPC4             /* 0xBF810180 */
  .IPC4CLR          /* 0xBF810184 */
  .IPC4SET          /* 0xBF810188 */
  .IPC4INV          /* 0xBF81018C */
  .IPC5             /* 0xBF810190 */
  .IPC5CLR          /* 0xBF810194 */
  .IPC5SET          /* 0xBF810198 */
  .IPC5INV          /* 0xBF81019C */
  .IPC6             /* 0xBF8101A0 */
  .IPC6CLR          /* 0xBF8101A4 */
  .IPC6SET          /* 0xBF8101A8 */
  .IPC6INV          /* 0xBF8101AC */
  .IPC7             /* 0xBF8101B0 */
  .IPC7CLR          /* 0xBF8101B4 */
  .IPC7SET          /* 0xBF8101B8 */
  .IPC7INV          /* 0xBF8101BC */
  .IPC8             /* 0xBF8101C0 */
  .IPC8CLR          /* 0xBF8101C4 */
  .IPC8SET          /* 0xBF8101C8 */
  .IPC8INV          /* 0xBF8101CC */
  .IPC9             /* 0xBF8101D0 */
  .IPC9CLR          /* 0xBF8101D4 */
  .IPC9SET          /* 0xBF8101D8 */
  .IPC9INV          /* 0xBF8101DC */
  .IPC10            /* 0xBF8101E0 */
  .IPC10CLR         /* 0xBF8101E4 */
  .IPC10SET         /* 0xBF8101E8 */
  .IPC10INV         /* 0xBF8101EC */
  .IPC11            /* 0xBF8101F0 */
  .IPC11CLR         /* 0xBF8101F4 */
  .IPC11SET         /* 0xBF8101F8 */
  .IPC11INV         /* 0xBF8101FC */
  .IPC12            /* 0xBF810200 */
  .IPC12CLR         /* 0xBF810204 */
  .IPC12SET         /* 0xBF810208 */
  .IPC12INV         /* 0xBF81020C */
  .IPC13            /* 0xBF810210 */
  .IPC13CLR         /* 0xBF810214 */
  .IPC13SET         /* 0xBF810218 */
  .IPC13INV         /* 0xBF81021C */
  .IPC14            /* 0xBF810220 */
  .IPC14CLR         /* 0xBF810224 */
  .IPC14SET         /* 0xBF810228 */
  .IPC14INV         /* 0xBF81022C */
  .IPC15            /* 0xBF810230 */
  .IPC15CLR         /* 0xBF810234 */
  .IPC15SET         /* 0xBF810238 */
  .IPC15INV         /* 0xBF81023C */
  .IPC16            /* 0xBF810240 */
  .IPC16CLR         /* 0xBF810244 */
  .IPC16SET         /* 0xBF810248 */
  .IPC16INV         /* 0xBF81024C */
  .IPC17            /* 0xBF810250 */
  .IPC17CLR         /* 0xBF810254 */
  .IPC17SET         /* 0xBF810258 */
  .IPC17INV         /* 0xBF81025C */
  .IPC18            /* 0xBF810260 */
  .IPC18CLR         /* 0xBF810264 */
  .IPC18SET         /* 0xBF810268 */
  .IPC18INV         /* 0xBF81026C */
  .IPC19            /* 0xBF810270 */
  .IPC19CLR         /* 0xBF810274 */
  .IPC19SET         /* 0xBF810278 */
  .IPC19INV         /* 0xBF81027C */
  .IPC20            /* 0xBF810280 */
  .IPC20CLR         /* 0xBF810284 */
  .IPC20SET         /* 0xBF810288 */
  .IPC20INV         /* 0xBF81028C */
  .IPC21            /* 0xBF810290 */
  .IPC21CLR         /* 0xBF810294 */
  .IPC21SET         /* 0xBF810298 */
  .IPC21INV         /* 0xBF81029C */
  .IPC22            /* 0xBF8102A0 */
  .IPC22CLR         /* 0xBF8102A4 */
  .IPC22SET         /* 0xBF8102A8 */
  .IPC22INV         /* 0xBF8102AC */
  .IPC23            /* 0xBF8102B0 */
  .IPC23CLR         /* 0xBF8102B4 */
  .IPC23SET         /* 0xBF8102B8 */
  .IPC23INV         /* 0xBF8102BC */
  .IPC25            /* 0xBF8102D0 */
  .IPC25CLR         /* 0xBF8102D4 */
  .IPC25SET         /* 0xBF8102D8 */
  .IPC25INV         /* 0xBF8102DC */
  .IPC26            /* 0xBF8102E0 */
  .IPC26CLR         /* 0xBF8102E4 */
  .IPC26SET         /* 0xBF8102E8 */
  .IPC26INV         /* 0xBF8102EC */
  .IPC27            /* 0xBF8102F0 */
  .IPC27CLR         /* 0xBF8102F4 */
  .IPC27SET         /* 0xBF8102F8 */
  .IPC27INV         /* 0xBF8102FC */
  .IPC28            /* 0xBF810300 */
  .IPC28CLR         /* 0xBF810304 */
  .IPC28SET         /* 0xBF810308 */
  .IPC28INV         /* 0xBF81030C */
  .IPC29            /* 0xBF810310 */
  .IPC29CLR         /* 0xBF810314 */
  .IPC29SET         /* 0xBF810318 */
  .IPC29INV         /* 0xBF81031C */
  .IPC30            /* 0xBF810320 */
  .IPC30CLR         /* 0xBF810324 */
  .IPC30SET         /* 0xBF810328 */
  .IPC30INV         /* 0xBF81032C */
  .IPC31            /* 0xBF810330 */
  .IPC31CLR         /* 0xBF810334 */
  .IPC31SET         /* 0xBF810338 */
  .IPC31INV         /* 0xBF81033C */
  .IPC32            /* 0xBF810340 */
  .IPC32CLR         /* 0xBF810344 */
  .IPC32SET         /* 0xBF810348 */
  .IPC32INV         /* 0xBF81034C */
  .IPC33            /* 0xBF810350 */
  .IPC33CLR         /* 0xBF810354 */
  .IPC33SET         /* 0xBF810358 */
  .IPC33INV         /* 0xBF81035C */
  .IPC34            /* 0xBF810360 */
  .IPC34CLR         /* 0xBF810364 */
  .IPC34SET         /* 0xBF810368 */
  .IPC34INV         /* 0xBF81036C */
  .IPC35            /* 0xBF810370 */
  .IPC35CLR         /* 0xBF810374 */
  .IPC35SET         /* 0xBF810378 */
  .IPC35INV         /* 0xBF81037C */
  .IPC36            /* 0xBF810380 */
  .IPC36CLR         /* 0xBF810384 */
  .IPC36SET         /* 0xBF810388 */
  .IPC36INV         /* 0xBF81038C */
  .IPC37            /* 0xBF810390 */
  .IPC37CLR         /* 0xBF810394 */
  .IPC37SET         /* 0xBF810398 */
  .IPC37INV         /* 0xBF81039C */
  .IPC38            /* 0xBF8103A0 */
  .IPC38CLR         /* 0xBF8103A4 */
  .IPC38SET         /* 0xBF8103A8 */
  .IPC38INV         /* 0xBF8103AC */
  .IPC39            /* 0xBF8103B0 */
  .IPC39CLR         /* 0xBF8103B4 */
  .IPC39SET         /* 0xBF8103B8 */
  .IPC39INV         /* 0xBF8103BC */
  .IPC40            /* 0xBF8103C0 */
  .IPC40CLR         /* 0xBF8103C4 */
  .IPC40SET         /* 0xBF8103C8 */
  .IPC40INV         /* 0xBF8103CC */
  .IPC41            /* 0xBF8103D0 */
  .IPC41CLR         /* 0xBF8103D4 */
  .IPC41SET         /* 0xBF8103D8 */
  .IPC41INV         /* 0xBF8103DC */
  .IPC42            /* 0xBF8103E0 */
  .IPC42CLR         /* 0xBF8103E4 */
  .IPC42SET         /* 0xBF8103E8 */
  .IPC42INV         /* 0xBF8103EC */
  .IPC43            /* 0xBF8103F0 */
  .IPC43CLR         /* 0xBF8103F4 */
  .IPC43SET         /* 0xBF8103F8 */
  .IPC43INV         /* 0xBF8103FC */
  .IPC44            /* 0xBF810400 */
  .IPC44CLR         /* 0xBF810404 */
  .IPC44SET         /* 0xBF810408 */
  .IPC44INV         /* 0xBF81040C */
  .IPC45            /* 0xBF810410 */
  .IPC45CLR         /* 0xBF810414 */
  .IPC45SET         /* 0xBF810418 */
  .IPC45INV         /* 0xBF81041C */
  .IPC46            /* 0xBF810420 */
  .IPC46CLR         /* 0xBF810424 */
  .IPC46SET         /* 0xBF810428 */
  .IPC46INV         /* 0xBF81042C */
  .IPC47            /* 0xBF810430 */
  .IPC47CLR         /* 0xBF810434 */
  .IPC47SET         /* 0xBF810438 */
  .IPC47INV         /* 0xBF81043C */
  .IPC48            /* 0xBF810440 */
  .IPC48CLR         /* 0xBF810444 */
  .IPC48SET         /* 0xBF810448 */
  .IPC48INV         /* 0xBF81044C */
  .IPC49            /* 0xBF810450 */
  .IPC49CLR         /* 0xBF810454 */
  .IPC49SET         /* 0xBF810458 */
  .IPC49INV         /* 0xBF81045C */
  .IPC50            /* 0xBF810460 */
  .IPC50CLR         /* 0xBF810464 */
  .IPC50SET         /* 0xBF810468 */
  .IPC50INV         /* 0xBF81046C */
  .IPC51            /* 0xBF810470 */
  .IPC51CLR         /* 0xBF810474 */
  .IPC51SET         /* 0xBF810478 */
  .IPC51INV         /* 0xBF81047C */
  .IPC52            /* 0xBF810480 */
  .IPC52CLR         /* 0xBF810484 */
  .IPC52SET         /* 0xBF810488 */
  .IPC52INV         /* 0xBF81048C */
  .IPC53            /* 0xBF810490 */
  .IPC53CLR         /* 0xBF810494 */
  .IPC53SET         /* 0xBF810498 */
  .IPC53INV         /* 0xBF81049C */
  .OFF000           /* 0xBF810540 */
  .OFF001           /* 0xBF810544 */
  .OFF002           /* 0xBF810548 */
  .OFF003           /* 0xBF81054C */
  .OFF004           /* 0xBF810550 */
  .OFF005           /* 0xBF810554 */
  .OFF006           /* 0xBF810558 */
  .OFF007           /* 0xBF81055C */
  .OFF008           /* 0xBF810560 */
  .OFF009           /* 0xBF810564 */
  .OFF010           /* 0xBF810568 */
  .OFF011           /* 0xBF81056C */
  .OFF012           /* 0xBF810570 */
  .OFF013           /* 0xBF810574 */
  .OFF014           /* 0xBF810578 */
  .OFF015           /* 0xBF81057C */
  .OFF016           /* 0xBF810580 */
  .OFF017           /* 0xBF810584 */
  .OFF018           /* 0xBF810588 */
  .OFF019           /* 0xBF81058C */
  .OFF020           /* 0xBF810590 */
  .OFF021           /* 0xBF810594 */
  .OFF022           /* 0xBF810598 */
  .OFF023           /* 0xBF81059C */
  .OFF024           /* 0xBF8105A0 */
  .OFF025           /* 0xBF8105A4 */
  .OFF026           /* 0xBF8105A8 */
  .OFF027           /* 0xBF8105AC */
  .OFF028           /* 0xBF8105B0 */
  .OFF029           /* 0xBF8105B4 */
  .OFF030           /* 0xBF8105B8 */
  .OFF031           /* 0xBF8105BC */
  .OFF032           /* 0xBF8105C0 */
  .OFF033           /* 0xBF8105C4 */
  .OFF034           /* 0xBF8105C8 */
  .OFF035           /* 0xBF8105CC */
  .OFF036           /* 0xBF8105D0 */
  .OFF037           /* 0xBF8105D4 */
  .OFF038           /* 0xBF8105D8 */
  .OFF039           /* 0xBF8105DC */
  .OFF040           /* 0xBF8105E0 */
  .OFF041           /* 0xBF8105E4 */
  .OFF042           /* 0xBF8105E8 */
  .OFF043           /* 0xBF8105EC */
  .OFF044           /* 0xBF8105F0 */
  .OFF046           /* 0xBF8105F8 */
  .OFF047           /* 0xBF8105FC */
  .OFF048           /* 0xBF810600 */
  .OFF049           /* 0xBF810604 */
  .OFF050           /* 0xBF810608 */
  .OFF051           /* 0xBF81060C */
  .OFF052           /* 0xBF810610 */
  .OFF053           /* 0xBF810614 */
  .OFF054           /* 0xBF810618 */
  .OFF055           /* 0xBF81061C */
  .OFF056           /* 0xBF810620 */
  .OFF057           /* 0xBF810624 */
  .OFF058           /* 0xBF810628 */
  .OFF059           /* 0xBF81062C */
  .OFF060           /* 0xBF810630 */
  .OFF061           /* 0xBF810634 */
