HomuraVehicle/homuraLib_v2/machine/device/p32mz2048efg100_forVC.c
  .OFF062           /* 0xBF810638 */
  .OFF063           /* 0xBF81063C */
  .OFF064           /* 0xBF810640 */
  .OFF065           /* 0xBF810644 */
  .OFF066           /* 0xBF810648 */
  .OFF067           /* 0xBF81064C */
  .OFF068           /* 0xBF810650 */
  .OFF069           /* 0xBF810654 */
  .OFF070           /* 0xBF810658 */
  .OFF071           /* 0xBF81065C */
  .OFF072           /* 0xBF810660 */
  .OFF073           /* 0xBF810664 */
  .OFF074           /* 0xBF810668 */
  .OFF075           /* 0xBF81066C */
  .OFF076           /* 0xBF810670 */
  .OFF077           /* 0xBF810674 */
  .OFF078           /* 0xBF810678 */
  .OFF079           /* 0xBF81067C */
  .OFF080           /* 0xBF810680 */
  .OFF081           /* 0xBF810684 */
  .OFF082           /* 0xBF810688 */
  .OFF083           /* 0xBF81068C */
  .OFF084           /* 0xBF810690 */
  .OFF085           /* 0xBF810694 */
  .OFF086           /* 0xBF810698 */
  .OFF087           /* 0xBF81069C */
  .OFF088           /* 0xBF8106A0 */
  .OFF089           /* 0xBF8106A4 */
  .OFF090           /* 0xBF8106A8 */
  .OFF091           /* 0xBF8106AC */
  .OFF092           /* 0xBF8106B0 */
  .OFF093           /* 0xBF8106B4 */
  .OFF102           /* 0xBF8106D8 */
  .OFF103           /* 0xBF8106DC */
  .OFF104           /* 0xBF8106E0 */
  .OFF105           /* 0xBF8106E4 */
  .OFF106           /* 0xBF8106E8 */
  .OFF109           /* 0xBF8106F4 */
  .OFF110           /* 0xBF8106F8 */
  .OFF111           /* 0xBF8106FC */
  .OFF112           /* 0xBF810700 */
  .OFF113           /* 0xBF810704 */
  .OFF114           /* 0xBF810708 */
  .OFF115           /* 0xBF81070C */
  .OFF116           /* 0xBF810710 */
  .OFF117           /* 0xBF810714 */
  .OFF118           /* 0xBF810718 */
  .OFF119           /* 0xBF81071C */
  .OFF120           /* 0xBF810720 */
  .OFF121           /* 0xBF810724 */
  .OFF122           /* 0xBF810728 */
  .OFF123           /* 0xBF81072C */
  .OFF124           /* 0xBF810730 */
  .OFF128           /* 0xBF810740 */
  .OFF129           /* 0xBF810744 */
  .OFF130           /* 0xBF810748 */
  .OFF131           /* 0xBF81074C */
  .OFF132           /* 0xBF810750 */
  .OFF133           /* 0xBF810754 */
  .OFF134           /* 0xBF810758 */
  .OFF135           /* 0xBF81075C */
  .OFF136           /* 0xBF810760 */
  .OFF137           /* 0xBF810764 */
  .OFF138           /* 0xBF810768 */
  .OFF139           /* 0xBF81076C */
  .OFF140           /* 0xBF810770 */
  .OFF141           /* 0xBF810774 */
  .OFF142           /* 0xBF810778 */
  .OFF143           /* 0xBF81077C */
  .OFF144           /* 0xBF810780 */
  .OFF145           /* 0xBF810784 */
  .OFF146           /* 0xBF810788 */
  .OFF147           /* 0xBF81078C */
  .OFF148           /* 0xBF810790 */
  .OFF149           /* 0xBF810794 */
  .OFF150           /* 0xBF810798 */
  .OFF153           /* 0xBF8107A4 */
  .OFF154           /* 0xBF8107A8 */
  .OFF155           /* 0xBF8107AC */
  .OFF156           /* 0xBF8107B0 */
  .OFF157           /* 0xBF8107B4 */
  .OFF158           /* 0xBF8107B8 */
  .OFF159           /* 0xBF8107BC */
  .OFF160           /* 0xBF8107C0 */
  .OFF161           /* 0xBF8107C4 */
  .OFF162           /* 0xBF8107C8 */
  .OFF163           /* 0xBF8107CC */
  .OFF164           /* 0xBF8107D0 */
  .OFF165           /* 0xBF8107D4 */
  .OFF166           /* 0xBF8107D8 */
  .OFF167           /* 0xBF8107DC */
  .OFF168           /* 0xBF8107E0 */
  .OFF169           /* 0xBF8107E4 */
  .OFF170           /* 0xBF8107E8 */
  .OFF171           /* 0xBF8107EC */
  .OFF172           /* 0xBF8107F0 */
  .OFF173           /* 0xBF8107F4 */
  .OFF174           /* 0xBF8107F8 */
  .OFF175           /* 0xBF8107FC */
  .OFF176           /* 0xBF810800 */
  .OFF177           /* 0xBF810804 */
  .OFF178           /* 0xBF810808 */
  .OFF179           /* 0xBF81080C */
  .OFF180           /* 0xBF810810 */
  .OFF181           /* 0xBF810814 */
  .OFF182           /* 0xBF810818 */
  .OFF183           /* 0xBF81081C */
  .OFF184           /* 0xBF810820 */
  .OFF185           /* 0xBF810824 */
  .OFF186           /* 0xBF810828 */
  .OFF187           /* 0xBF81082C */
  .OFF188           /* 0xBF810830 */
  .OFF189           /* 0xBF810834 */
  .OFF190           /* 0xBF810838 */
  .OFF192           /* 0xBF810840 */
  .OFF193           /* 0xBF810844 */
  .OFF194           /* 0xBF810848 */
  .OFF196           /* 0xBF810850 */
  .OFF198           /* 0xBF810858 */
  .OFF199           /* 0xBF81085C */
  .OFF200           /* 0xBF810860 */
  .OFF201           /* 0xBF810864 */
  .OFF202           /* 0xBF810868 */
  .OFF205           /* 0xBF810874 */
  .OFF206           /* 0xBF810878 */
  .OFF207           /* 0xBF81087C */
  .OFF208           /* 0xBF810880 */
  .OFF209           /* 0xBF810884 */
  .OFF210           /* 0xBF810888 */
  .OFF213           /* 0xBF810894 */
  .DMACON           /* 0xBF811000 */
  .DMACONCLR        /* 0xBF811004 */
  .DMACONSET        /* 0xBF811008 */
  .DMACONINV        /* 0xBF81100C */
  .DMASTAT          /* 0xBF811010 */
  .DMASTATCLR       /* 0xBF811014 */
  .DMASTATSET       /* 0xBF811018 */
  .DMASTATINV       /* 0xBF81101C */
  .DMAADDR          /* 0xBF811020 */
  .DMAADDRCLR       /* 0xBF811024 */
  .DMAADDRSET       /* 0xBF811028 */
  .DMAADDRINV       /* 0xBF81102C */
  .DCRCCON          /* 0xBF811030 */
  .DCRCCONCLR       /* 0xBF811034 */
  .DCRCCONSET       /* 0xBF811038 */
  .DCRCCONINV       /* 0xBF81103C */
  .DCRCDATA         /* 0xBF811040 */
  .DCRCDATACLR      /* 0xBF811044 */
  .DCRCDATASET      /* 0xBF811048 */
  .DCRCDATAINV      /* 0xBF81104C */
  .DCRCXOR          /* 0xBF811050 */
  .DCRCXORCLR       /* 0xBF811054 */
  .DCRCXORSET       /* 0xBF811058 */
  .DCRCXORINV       /* 0xBF81105C */
  .DCH0CON          /* 0xBF811060 */
  .DCH0CONCLR       /* 0xBF811064 */
  .DCH0CONSET       /* 0xBF811068 */
  .DCH0CONINV       /* 0xBF81106C */
  .DCH0ECON         /* 0xBF811070 */
  .DCH0ECONCLR      /* 0xBF811074 */
  .DCH0ECONSET      /* 0xBF811078 */
  .DCH0ECONINV      /* 0xBF81107C */
  .DCH0INT          /* 0xBF811080 */
  .DCH0INTCLR       /* 0xBF811084 */
  .DCH0INTSET       /* 0xBF811088 */
  .DCH0INTINV       /* 0xBF81108C */
  .DCH0SSA          /* 0xBF811090 */
  .DCH0SSACLR       /* 0xBF811094 */
  .DCH0SSASET       /* 0xBF811098 */
  .DCH0SSAINV       /* 0xBF81109C */
  .DCH0DSA          /* 0xBF8110A0 */
  .DCH0DSACLR       /* 0xBF8110A4 */
  .DCH0DSASET       /* 0xBF8110A8 */
  .DCH0DSAINV       /* 0xBF8110AC */
  .DCH0SSIZ         /* 0xBF8110B0 */
  .DCH0SSIZCLR      /* 0xBF8110B4 */
  .DCH0SSIZSET      /* 0xBF8110B8 */
  .DCH0SSIZINV      /* 0xBF8110BC */
  .DCH0DSIZ         /* 0xBF8110C0 */
  .DCH0DSIZCLR      /* 0xBF8110C4 */
  .DCH0DSIZSET      /* 0xBF8110C8 */
  .DCH0DSIZINV      /* 0xBF8110CC */
  .DCH0SPTR         /* 0xBF8110D0 */
  .DCH0SPTRCLR      /* 0xBF8110D4 */
  .DCH0SPTRSET      /* 0xBF8110D8 */
  .DCH0SPTRINV      /* 0xBF8110DC */
  .DCH0DPTR         /* 0xBF8110E0 */
  .DCH0DPTRCLR      /* 0xBF8110E4 */
  .DCH0DPTRSET      /* 0xBF8110E8 */
  .DCH0DPTRINV      /* 0xBF8110EC */
  .DCH0CSIZ         /* 0xBF8110F0 */
  .DCH0CSIZCLR      /* 0xBF8110F4 */
  .DCH0CSIZSET      /* 0xBF8110F8 */
  .DCH0CSIZINV      /* 0xBF8110FC */
  .DCH0CPTR         /* 0xBF811100 */
  .DCS0CPTR         /* 0xBF811100 */
  .DCH0CPTRCLR      /* 0xBF811104 */
  .DCS0CPTRCLR      /* 0xBF811104 */
  .DCH0CPTRSET      /* 0xBF811108 */
  .DCS0CPTRSET      /* 0xBF811108 */
  .DCH0CPTRINV      /* 0xBF81110C */
  .DCS0CPTRINV      /* 0xBF81110C */
  .DCH0DAT          /* 0xBF811110 */
  .DCH0DATCLR       /* 0xBF811114 */
  .DCH0DATSET       /* 0xBF811118 */
  .DCH0DATINV       /* 0xBF81111C */
  .DCH1CON          /* 0xBF811120 */
  .DCH1CONCLR       /* 0xBF811124 */
  .DCH1CONSET       /* 0xBF811128 */
  .DCH1CONINV       /* 0xBF81112C */
  .DCH1ECON         /* 0xBF811130 */
  .DCH1ECONCLR      /* 0xBF811134 */
  .DCH1ECONSET      /* 0xBF811138 */
  .DCH1ECONINV      /* 0xBF81113C */
  .DCH1INT          /* 0xBF811140 */
  .DCH1INTCLR       /* 0xBF811144 */
  .DCH1INTSET       /* 0xBF811148 */
  .DCH1INTINV       /* 0xBF81114C */
  .DCH1SSA          /* 0xBF811150 */
  .DCH1SSACLR       /* 0xBF811154 */
  .DCH1SSASET       /* 0xBF811158 */
  .DCH1SSAINV       /* 0xBF81115C */
  .DCH1DSA          /* 0xBF811160 */
  .DCH1DSACLR       /* 0xBF811164 */
  .DCH1DSASET       /* 0xBF811168 */
  .DCH1DSAINV       /* 0xBF81116C */
  .DCH1SSIZ         /* 0xBF811170 */
  .DCH1SSIZCLR      /* 0xBF811174 */
  .DCH1SSIZSET      /* 0xBF811178 */
  .DCH1SSIZINV      /* 0xBF81117C */
  .DCH1DSIZ         /* 0xBF811180 */
  .DCH1DSIZCLR      /* 0xBF811184 */
  .DCH1DSIZSET      /* 0xBF811188 */
  .DCH1DSIZINV      /* 0xBF81118C */
  .DCH1SPTR         /* 0xBF811190 */
  .DCH1SPTRCLR      /* 0xBF811194 */
  .DCH1SPTRSET      /* 0xBF811198 */
  .DCH1SPTRINV      /* 0xBF81119C */
  .DCH1DPTR         /* 0xBF8111A0 */
  .DCH1DPTRCLR      /* 0xBF8111A4 */
  .DCH1DPTRSET      /* 0xBF8111A8 */
  .DCH1DPTRINV      /* 0xBF8111AC */
  .DCH1CSIZ         /* 0xBF8111B0 */
  .DCH1CSIZCLR      /* 0xBF8111B4 */
  .DCH1CSIZSET      /* 0xBF8111B8 */
  .DCH1CSIZINV      /* 0xBF8111BC */
  .DCH1CPTR         /* 0xBF8111C0 */
  .DCS1CPTR         /* 0xBF8111C0 */
  .DCH1CPTRCLR      /* 0xBF8111C4 */
  .DCS1CPTRCLR      /* 0xBF8111C4 */
  .DCH1CPTRSET      /* 0xBF8111C8 */
  .DCS1CPTRSET      /* 0xBF8111C8 */
  .DCH1CPTRINV      /* 0xBF8111CC */
  .DCS1CPTRINV      /* 0xBF8111CC */
  .DCH1DAT          /* 0xBF8111D0 */
  .DCH1DATCLR       /* 0xBF8111D4 */
  .DCH1DATSET       /* 0xBF8111D8 */
  .DCH1DATINV       /* 0xBF8111DC */
  .DCH2CON          /* 0xBF8111E0 */
  .DCH2CONCLR       /* 0xBF8111E4 */
  .DCH2CONSET       /* 0xBF8111E8 */
  .DCH2CONINV       /* 0xBF8111EC */
  .DCH2ECON         /* 0xBF8111F0 */
  .DCH2ECONCLR      /* 0xBF8111F4 */
  .DCH2ECONSET      /* 0xBF8111F8 */
  .DCH2ECONINV      /* 0xBF8111FC */
  .DCH2INT          /* 0xBF811200 */
  .DCH2INTCLR       /* 0xBF811204 */
  .DCH2INTSET       /* 0xBF811208 */
  .DCH2INTINV       /* 0xBF81120C */
  .DCH2SSA          /* 0xBF811210 */
  .DCH2SSACLR       /* 0xBF811214 */
  .DCH2SSASET       /* 0xBF811218 */
  .DCH2SSAINV       /* 0xBF81121C */
  .DCH2DSA          /* 0xBF811220 */
  .DCH2DSACLR       /* 0xBF811224 */
  .DCH2DSASET       /* 0xBF811228 */
  .DCH2DSAINV       /* 0xBF81122C */
  .DCH2SSIZ         /* 0xBF811230 */
  .DCH2SSIZCLR      /* 0xBF811234 */
  .DCH2SSIZSET      /* 0xBF811238 */
  .DCH2SSIZINV      /* 0xBF81123C */
  .DCH2DSIZ         /* 0xBF811240 */
  .DCH2DSIZCLR      /* 0xBF811244 */
  .DCH2DSIZSET      /* 0xBF811248 */
  .DCH2DSIZINV      /* 0xBF81124C */
  .DCH2SPTR         /* 0xBF811250 */
  .DCH2SPTRCLR      /* 0xBF811254 */
  .DCH2SPTRSET      /* 0xBF811258 */
  .DCH2SPTRINV      /* 0xBF81125C */
  .DCH2DPTR         /* 0xBF811260 */
  .DCH2DPTRCLR      /* 0xBF811264 */
  .DCH2DPTRSET      /* 0xBF811268 */
  .DCH2DPTRINV      /* 0xBF81126C */
  .DCH2CSIZ         /* 0xBF811270 */
  .DCH2CSIZCLR      /* 0xBF811274 */
  .DCH2CSIZSET      /* 0xBF811278 */
  .DCH2CSIZINV      /* 0xBF81127C */
  .DCH2CPTR         /* 0xBF811280 */
  .DCS2CPTR         /* 0xBF811280 */
  .DCH2CPTRCLR      /* 0xBF811284 */
  .DCS2CPTRCLR      /* 0xBF811284 */
  .DCH2CPTRSET      /* 0xBF811288 */
  .DCS2CPTRSET      /* 0xBF811288 */
  .DCH2CPTRINV      /* 0xBF81128C */
  .DCS2CPTRINV      /* 0xBF81128C */
  .DCH2DAT          /* 0xBF811290 */
  .DCH2DATCLR       /* 0xBF811294 */
  .DCH2DATSET       /* 0xBF811298 */
  .DCH2DATINV       /* 0xBF81129C */
  .DCH3CON          /* 0xBF8112A0 */
  .DCH3CONCLR       /* 0xBF8112A4 */
  .DCH3CONSET       /* 0xBF8112A8 */
  .DCH3CONINV       /* 0xBF8112AC */
  .DCH3ECON         /* 0xBF8112B0 */
  .DCH3ECONCLR      /* 0xBF8112B4 */
  .DCH3ECONSET      /* 0xBF8112B8 */
  .DCH3ECONINV      /* 0xBF8112BC */
  .DCH3INT          /* 0xBF8112C0 */
  .DCH3INTCLR       /* 0xBF8112C4 */
  .DCH3INTSET       /* 0xBF8112C8 */
  .DCH3INTINV       /* 0xBF8112CC */
  .DCH3SSA          /* 0xBF8112D0 */
  .DCH3SSACLR       /* 0xBF8112D4 */
  .DCH3SSASET       /* 0xBF8112D8 */
  .DCH3SSAINV       /* 0xBF8112DC */
  .DCH3DSA          /* 0xBF8112E0 */
  .DCH3DSACLR       /* 0xBF8112E4 */
  .DCH3DSASET       /* 0xBF8112E8 */
  .DCH3DSAINV       /* 0xBF8112EC */
  .DCH3SSIZ         /* 0xBF8112F0 */
  .DCH3SSIZCLR      /* 0xBF8112F4 */
  .DCH3SSIZSET      /* 0xBF8112F8 */
  .DCH3SSIZINV      /* 0xBF8112FC */
  .DCH3DSIZ         /* 0xBF811300 */
  .DCH3DSIZCLR      /* 0xBF811304 */
  .DCH3DSIZSET      /* 0xBF811308 */
  .DCH3DSIZINV      /* 0xBF81130C */
  .DCH3SPTR         /* 0xBF811310 */
  .DCH3SPTRCLR      /* 0xBF811314 */
  .DCH3SPTRSET      /* 0xBF811318 */
  .DCH3SPTRINV      /* 0xBF81131C */
  .DCH3DPTR         /* 0xBF811320 */
  .DCH3DPTRCLR      /* 0xBF811324 */
  .DCH3DPTRSET      /* 0xBF811328 */
  .DCH3DPTRINV      /* 0xBF81132C */
  .DCH3CSIZ         /* 0xBF811330 */
  .DCH3CSIZCLR      /* 0xBF811334 */
  .DCH3CSIZSET      /* 0xBF811338 */
  .DCH3CSIZINV      /* 0xBF81133C */
  .DCH3CPTR         /* 0xBF811340 */
  .DCS3CPTR         /* 0xBF811340 */
  .DCH3CPTRCLR      /* 0xBF811344 */
  .DCS3CPTRCLR      /* 0xBF811344 */
  .DCH3CPTRSET      /* 0xBF811348 */
  .DCS3CPTRSET      /* 0xBF811348 */
  .DCH3CPTRINV      /* 0xBF81134C */
  .DCS3CPTRINV      /* 0xBF81134C */
  .DCH3DAT          /* 0xBF811350 */
  .DCH3DATCLR       /* 0xBF811354 */
  .DCH3DATSET       /* 0xBF811358 */
  .DCH3DATINV       /* 0xBF81135C */
  .DCH4CON          /* 0xBF811360 */
  .DCH4CONCLR       /* 0xBF811364 */
  .DCH4CONSET       /* 0xBF811368 */
  .DCH4CONINV       /* 0xBF81136C */
  .DCH4ECON         /* 0xBF811370 */
  .DCH4ECONCLR      /* 0xBF811374 */
  .DCH4ECONSET      /* 0xBF811378 */
  .DCH4ECONINV      /* 0xBF81137C */
  .DCH4INT          /* 0xBF811380 */
  .DCH4INTCLR       /* 0xBF811384 */
  .DCH4INTSET       /* 0xBF811388 */
  .DCH4INTINV       /* 0xBF81138C */
  .DCH4SSA          /* 0xBF811390 */
  .DCH4SSACLR       /* 0xBF811394 */
  .DCH4SSASET       /* 0xBF811398 */
  .DCH4SSAINV       /* 0xBF81139C */
  .DCH4DSA          /* 0xBF8113A0 */
  .DCH4DSACLR       /* 0xBF8113A4 */
  .DCH4DSASET       /* 0xBF8113A8 */
  .DCH4DSAINV       /* 0xBF8113AC */
  .DCH4SSIZ         /* 0xBF8113B0 */
  .DCH4SSIZCLR      /* 0xBF8113B4 */
  .DCH4SSIZSET      /* 0xBF8113B8 */
  .DCH4SSIZINV      /* 0xBF8113BC */
  .DCH4DSIZ         /* 0xBF8113C0 */
  .DCH4DSIZCLR      /* 0xBF8113C4 */
  .DCH4DSIZSET      /* 0xBF8113C8 */
  .DCH4DSIZINV      /* 0xBF8113CC */
  .DCH4SPTR         /* 0xBF8113D0 */
  .DCH4SPTRCLR      /* 0xBF8113D4 */
  .DCH4SPTRSET      /* 0xBF8113D8 */
  .DCH4SPTRINV      /* 0xBF8113DC */
  .DCH4DPTR         /* 0xBF8113E0 */
  .DCH4DPTRCLR      /* 0xBF8113E4 */
  .DCH4DPTRSET      /* 0xBF8113E8 */
  .DCH4DPTRINV      /* 0xBF8113EC */
  .DCH4CSIZ         /* 0xBF8113F0 */
  .DCH4CSIZCLR      /* 0xBF8113F4 */
  .DCH4CSIZSET      /* 0xBF8113F8 */
  .DCH4CSIZINV      /* 0xBF8113FC */
  .DCH4CPTR         /* 0xBF811400 */
  .DCS4CPTR         /* 0xBF811400 */
  .DCH4CPTRCLR      /* 0xBF811404 */
  .DCS4CPTRCLR      /* 0xBF811404 */
  .DCH4CPTRSET      /* 0xBF811408 */
  .DCS4CPTRSET      /* 0xBF811408 */
  .DCH4CPTRINV      /* 0xBF81140C */
  .DCS4CPTRINV      /* 0xBF81140C */
  .DCH4DAT          /* 0xBF811410 */
  .DCH4DATCLR       /* 0xBF811414 */
  .DCH4DATSET       /* 0xBF811418 */
  .DCH4DATINV       /* 0xBF81141C */
  .DCH5CON          /* 0xBF811420 */
  .DCH5CONCLR       /* 0xBF811424 */
  .DCH5CONSET       /* 0xBF811428 */
  .DCH5CONINV       /* 0xBF81142C */
  .DCH5ECON         /* 0xBF811430 */
  .DCH5ECONCLR      /* 0xBF811434 */
  .DCH5ECONSET      /* 0xBF811438 */
  .DCH5ECONINV      /* 0xBF81143C */
  .DCH5INT          /* 0xBF811440 */
  .DCH5INTCLR       /* 0xBF811444 */
  .DCH5INTSET       /* 0xBF811448 */
  .DCH5INTINV       /* 0xBF81144C */
  .DCH5SSA          /* 0xBF811450 */
  .DCH5SSACLR       /* 0xBF811454 */
  .DCH5SSASET       /* 0xBF811458 */
  .DCH5SSAINV       /* 0xBF81145C */
  .DCH5DSA          /* 0xBF811460 */
  .DCH5DSACLR       /* 0xBF811464 */
  .DCH5DSASET       /* 0xBF811468 */
  .DCH5DSAINV       /* 0xBF81146C */
  .DCH5SSIZ         /* 0xBF811470 */
  .DCH5SSIZCLR      /* 0xBF811474 */
  .DCH5SSIZSET      /* 0xBF811478 */
  .DCH5SSIZINV      /* 0xBF81147C */
  .DCH5DSIZ         /* 0xBF811480 */
  .DCH5DSIZCLR      /* 0xBF811484 */
  .DCH5DSIZSET      /* 0xBF811488 */
  .DCH5DSIZINV      /* 0xBF81148C */
  .DCH5SPTR         /* 0xBF811490 */
  .DCH5SPTRCLR      /* 0xBF811494 */
  .DCH5SPTRSET      /* 0xBF811498 */
  .DCH5SPTRINV      /* 0xBF81149C */
  .DCH5DPTR         /* 0xBF8114A0 */
  .DCH5DPTRCLR      /* 0xBF8114A4 */
  .DCH5DPTRSET      /* 0xBF8114A8 */
  .DCH5DPTRINV      /* 0xBF8114AC */
  .DCH5CSIZ         /* 0xBF8114B0 */
  .DCH5CSIZCLR      /* 0xBF8114B4 */
  .DCH5CSIZSET      /* 0xBF8114B8 */
  .DCH5CSIZINV      /* 0xBF8114BC */
  .DCH5CPTR         /* 0xBF8114C0 */
  .DCS5CPTR         /* 0xBF8114C0 */
  .DCH5CPTRCLR      /* 0xBF8114C4 */
  .DCS5CPTRCLR      /* 0xBF8114C4 */
  .DCH5CPTRSET      /* 0xBF8114C8 */
  .DCS5CPTRSET      /* 0xBF8114C8 */
  .DCH5CPTRINV      /* 0xBF8114CC */
  .DCS5CPTRINV      /* 0xBF8114CC */
  .DCH5DAT          /* 0xBF8114D0 */
  .DCH5DATCLR       /* 0xBF8114D4 */
  .DCH5DATSET       /* 0xBF8114D8 */
  .DCH5DATINV       /* 0xBF8114DC */
  .DCH6CON          /* 0xBF8114E0 */
  .DCH6CONCLR       /* 0xBF8114E4 */
  .DCH6CONSET       /* 0xBF8114E8 */
  .DCH6CONINV       /* 0xBF8114EC */
  .DCH6ECON         /* 0xBF8114F0 */
  .DCH6ECONCLR      /* 0xBF8114F4 */
  .DCH6ECONSET      /* 0xBF8114F8 */
  .DCH6ECONINV      /* 0xBF8114FC */
  .DCH6INT          /* 0xBF811500 */
  .DCH6INTCLR       /* 0xBF811504 */
  .DCH6INTSET       /* 0xBF811508 */
  .DCH6INTINV       /* 0xBF81150C */
  .DCH6SSA          /* 0xBF811510 */
  .DCH6SSACLR       /* 0xBF811514 */
  .DCH6SSASET       /* 0xBF811518 */
  .DCH6SSAINV       /* 0xBF81151C */
  .DCH6DSA          /* 0xBF811520 */
  .DCH6DSACLR       /* 0xBF811524 */
  .DCH6DSASET       /* 0xBF811528 */
  .DCH6DSAINV       /* 0xBF81152C */
  .DCH6SSIZ         /* 0xBF811530 */
  .DCH6SSIZCLR      /* 0xBF811534 */
  .DCH6SSIZSET      /* 0xBF811538 */
  .DCH6SSIZINV      /* 0xBF81153C */
  .DCH6DSIZ         /* 0xBF811540 */
  .DCH6DSIZCLR      /* 0xBF811544 */
  .DCH6DSIZSET      /* 0xBF811548 */
  .DCH6DSIZINV      /* 0xBF81154C */
  .DCH6SPTR         /* 0xBF811550 */
  .DCH6SPTRCLR      /* 0xBF811554 */
  .DCH6SPTRSET      /* 0xBF811558 */
  .DCH6SPTRINV      /* 0xBF81155C */
  .DCH6DPTR         /* 0xBF811560 */
  .DCH6DPTRCLR      /* 0xBF811564 */
  .DCH6DPTRSET      /* 0xBF811568 */
  .DCH6DPTRINV      /* 0xBF81156C */
  .DCH6CSIZ         /* 0xBF811570 */
  .DCH6CSIZCLR      /* 0xBF811574 */
  .DCH6CSIZSET      /* 0xBF811578 */
  .DCH6CSIZINV      /* 0xBF81157C */
  .DCH6CPTR         /* 0xBF811580 */
  .DCS6CPTR         /* 0xBF811580 */
  .DCH6CPTRCLR      /* 0xBF811584 */
  .DCS6CPTRCLR      /* 0xBF811584 */
  .DCH6CPTRSET      /* 0xBF811588 */
  .DCS6CPTRSET      /* 0xBF811588 */
  .DCH6CPTRINV      /* 0xBF81158C */
  .DCS6CPTRINV      /* 0xBF81158C */
  .DCH6DAT          /* 0xBF811590 */
  .DCH6DATCLR       /* 0xBF811594 */
  .DCH6DATSET       /* 0xBF811598 */
  .DCH6DATINV       /* 0xBF81159C */
  .DCH7CON          /* 0xBF8115A0 */
  .DCH7CONCLR       /* 0xBF8115A4 */
  .DCH7CONSET       /* 0xBF8115A8 */
  .DCH7CONINV       /* 0xBF8115AC */
  .DCH7ECON         /* 0xBF8115B0 */
  .DCH7ECONCLR      /* 0xBF8115B4 */
  .DCH7ECONSET      /* 0xBF8115B8 */
  .DCH7ECONINV      /* 0xBF8115BC */
  .DCH7INT          /* 0xBF8115C0 */
  .DCH7INTCLR       /* 0xBF8115C4 */
  .DCH7INTSET       /* 0xBF8115C8 */
  .DCH7INTINV       /* 0xBF8115CC */
  .DCH7SSA          /* 0xBF8115D0 */
  .DCH7SSACLR       /* 0xBF8115D4 */
  .DCH7SSASET       /* 0xBF8115D8 */
  .DCH7SSAINV       /* 0xBF8115DC */
  .DCH7DSA          /* 0xBF8115E0 */
  .DCH7DSACLR       /* 0xBF8115E4 */
  .DCH7DSASET       /* 0xBF8115E8 */
  .DCH7DSAINV       /* 0xBF8115EC */
  .DCH7SSIZ         /* 0xBF8115F0 */
  .DCH7SSIZCLR      /* 0xBF8115F4 */
  .DCH7SSIZSET      /* 0xBF8115F8 */
  .DCH7SSIZINV      /* 0xBF8115FC */
  .DCH7DSIZ         /* 0xBF811600 */
  .DCH7DSIZCLR      /* 0xBF811604 */
  .DCH7DSIZSET      /* 0xBF811608 */
  .DCH7DSIZINV      /* 0xBF81160C */
  .DCH7SPTR         /* 0xBF811610 */
  .DCH7SPTRCLR      /* 0xBF811614 */
  .DCH7SPTRSET      /* 0xBF811618 */
  .DCH7SPTRINV      /* 0xBF81161C */
  .DCH7DPTR         /* 0xBF811620 */
  .DCH7DPTRCLR      /* 0xBF811624 */
  .DCH7DPTRSET      /* 0xBF811628 */
  .DCH7DPTRINV      /* 0xBF81162C */
  .DCH7CSIZ         /* 0xBF811630 */
  .DCH7CSIZCLR      /* 0xBF811634 */
  .DCH7CSIZSET      /* 0xBF811638 */
  .DCH7CSIZINV      /* 0xBF81163C */
  .DCH7CPTR         /* 0xBF811640 */
  .DCS7CPTR         /* 0xBF811640 */
  .DCH7CPTRCLR      /* 0xBF811644 */
  .DCS7CPTRCLR      /* 0xBF811644 */
  .DCH7CPTRSET      /* 0xBF811648 */
  .DCS7CPTRSET      /* 0xBF811648 */
  .DCH7CPTRINV      /* 0xBF81164C */
  .DCS7CPTRINV      /* 0xBF81164C */
  .DCH7DAT          /* 0xBF811650 */
  .DCH7DATCLR       /* 0xBF811654 */
  .DCH7DATSET       /* 0xBF811658 */
  .DCH7DATINV       /* 0xBF81165C */
  .I2C1CON          /* 0xBF820000 */
  .I2C1CONCLR       /* 0xBF820004 */
  .I2C1CONSET       /* 0xBF820008 */
  .I2C1CONINV       /* 0xBF82000C */
  .I2C1STAT         /* 0xBF820010 */
  .I2C1STATCLR      /* 0xBF820014 */
  .I2C1STATSET      /* 0xBF820018 */
  .I2C1STATINV      /* 0xBF82001C */
  .I2C1ADD          /* 0xBF820020 */
  .I2C1ADDCLR       /* 0xBF820024 */
  .I2C1ADDSET       /* 0xBF820028 */
  .I2C1ADDINV       /* 0xBF82002C */
  .I2C1MSK          /* 0xBF820030 */
  .I2C1MSKCLR       /* 0xBF820034 */
  .I2C1MSKSET       /* 0xBF820038 */
  .I2C1MSKINV       /* 0xBF82003C */
  .I2C1BRG          /* 0xBF820040 */
  .I2C1BRGCLR       /* 0xBF820044 */
  .I2C1BRGSET       /* 0xBF820048 */
  .I2C1BRGINV       /* 0xBF82004C */
  .I2C1TRN          /* 0xBF820050 */
  .I2C1TRNCLR       /* 0xBF820054 */
  .I2C1TRNSET       /* 0xBF820058 */
  .I2C1TRNINV       /* 0xBF82005C */
  .I2C1RCV          /* 0xBF820060 */
  .I2C1RCVCLR       /* 0xBF820064 */
  .I2C1RCVSET       /* 0xBF820068 */
  .I2C1RCVINV       /* 0xBF82006C */
  .I2C2CON          /* 0xBF820200 */
  .I2C2CONCLR       /* 0xBF820204 */
  .I2C2CONSET       /* 0xBF820208 */
  .I2C2CONINV       /* 0xBF82020C */
  .I2C2STAT         /* 0xBF820210 */
  .I2C2STATCLR      /* 0xBF820214 */
  .I2C2STATSET      /* 0xBF820218 */
  .I2C2STATINV      /* 0xBF82021C */
  .I2C2ADD          /* 0xBF820220 */
  .I2C2ADDCLR       /* 0xBF820224 */
  .I2C2ADDSET       /* 0xBF820228 */
  .I2C2ADDINV       /* 0xBF82022C */
  .I2C2MSK          /* 0xBF820230 */
  .I2C2MSKCLR       /* 0xBF820234 */
  .I2C2MSKSET       /* 0xBF820238 */
  .I2C2MSKINV       /* 0xBF82023C */
  .I2C2BRG          /* 0xBF820240 */
  .I2C2BRGCLR       /* 0xBF820244 */
  .I2C2BRGSET       /* 0xBF820248 */
  .I2C2BRGINV       /* 0xBF82024C */
  .I2C2TRN          /* 0xBF820250 */
  .I2C2TRNCLR       /* 0xBF820254 */
  .I2C2TRNSET       /* 0xBF820258 */
  .I2C2TRNINV       /* 0xBF82025C */
  .I2C2RCV          /* 0xBF820260 */
  .I2C2RCVCLR       /* 0xBF820264 */
  .I2C2RCVSET       /* 0xBF820268 */
  .I2C2RCVINV       /* 0xBF82026C */
  .I2C3CON          /* 0xBF820400 */
  .I2C3CONCLR       /* 0xBF820404 */
  .I2C3CONSET       /* 0xBF820408 */
  .I2C3CONINV       /* 0xBF82040C */
  .I2C3STAT         /* 0xBF820410 */
  .I2C3STATCLR      /* 0xBF820414 */
  .I2C3STATSET      /* 0xBF820418 */
  .I2C3STATINV      /* 0xBF82041C */
  .I2C3ADD          /* 0xBF820420 */
  .I2C3ADDCLR       /* 0xBF820424 */
  .I2C3ADDSET       /* 0xBF820428 */
  .I2C3ADDINV       /* 0xBF82042C */
  .I2C3MSK          /* 0xBF820430 */
  .I2C3MSKCLR       /* 0xBF820434 */
  .I2C3MSKSET       /* 0xBF820438 */
  .I2C3MSKINV       /* 0xBF82043C */
  .I2C3BRG          /* 0xBF820440 */
  .I2C3BRGCLR       /* 0xBF820444 */
  .I2C3BRGSET       /* 0xBF820448 */
  .I2C3BRGINV       /* 0xBF82044C */
  .I2C3TRN          /* 0xBF820450 */
  .I2C3TRNCLR       /* 0xBF820454 */
