HomuraVehicle/homuraLib_v2/machine/device/p32mz2048efg100_forVC.c
  .I2C3TRNSET       /* 0xBF820458 */
  .I2C3TRNINV       /* 0xBF82045C */
  .I2C3RCV          /* 0xBF820460 */
  .I2C3RCVCLR       /* 0xBF820464 */
  .I2C3RCVSET       /* 0xBF820468 */
  .I2C3RCVINV       /* 0xBF82046C */
  .I2C4CON          /* 0xBF820600 */
  .I2C4CONCLR       /* 0xBF820604 */
  .I2C4CONSET       /* 0xBF820608 */
  .I2C4CONINV       /* 0xBF82060C */
  .I2C4STAT         /* 0xBF820610 */
  .I2C4STATCLR      /* 0xBF820614 */
  .I2C4STATSET      /* 0xBF820618 */
  .I2C4STATINV      /* 0xBF82061C */
  .I2C4ADD          /* 0xBF820620 */
  .I2C4ADDCLR       /* 0xBF820624 */
  .I2C4ADDSET       /* 0xBF820628 */
  .I2C4ADDINV       /* 0xBF82062C */
  .I2C4MSK          /* 0xBF820630 */
  .I2C4MSKCLR       /* 0xBF820634 */
  .I2C4MSKSET       /* 0xBF820638 */
  .I2C4MSKINV       /* 0xBF82063C */
  .I2C4BRG          /* 0xBF820640 */
  .I2C4BRGCLR       /* 0xBF820644 */
  .I2C4BRGSET       /* 0xBF820648 */
  .I2C4BRGINV       /* 0xBF82064C */
  .I2C4TRN          /* 0xBF820650 */
  .I2C4TRNCLR       /* 0xBF820654 */
  .I2C4TRNSET       /* 0xBF820658 */
  .I2C4TRNINV       /* 0xBF82065C */
  .I2C4RCV          /* 0xBF820660 */
  .I2C4RCVCLR       /* 0xBF820664 */
  .I2C4RCVSET       /* 0xBF820668 */
  .I2C4RCVINV       /* 0xBF82066C */
  .I2C5CON          /* 0xBF820800 */
  .I2C5CONCLR       /* 0xBF820804 */
  .I2C5CONSET       /* 0xBF820808 */
  .I2C5CONINV       /* 0xBF82080C */
  .I2C5STAT         /* 0xBF820810 */
  .I2C5STATCLR      /* 0xBF820814 */
  .I2C5STATSET      /* 0xBF820818 */
  .I2C5STATINV      /* 0xBF82081C */
  .I2C5ADD          /* 0xBF820820 */
  .I2C5ADDCLR       /* 0xBF820824 */
  .I2C5ADDSET       /* 0xBF820828 */
  .I2C5ADDINV       /* 0xBF82082C */
  .I2C5MSK          /* 0xBF820830 */
  .I2C5MSKCLR       /* 0xBF820834 */
  .I2C5MSKSET       /* 0xBF820838 */
  .I2C5MSKINV       /* 0xBF82083C */
  .I2C5BRG          /* 0xBF820840 */
  .I2C5BRGCLR       /* 0xBF820844 */
  .I2C5BRGSET       /* 0xBF820848 */
  .I2C5BRGINV       /* 0xBF82084C */
  .I2C5TRN          /* 0xBF820850 */
  .I2C5TRNCLR       /* 0xBF820854 */
  .I2C5TRNSET       /* 0xBF820858 */
  .I2C5TRNINV       /* 0xBF82085C */
  .I2C5RCV          /* 0xBF820860 */
  .I2C5RCVCLR       /* 0xBF820864 */
  .I2C5RCVSET       /* 0xBF820868 */
  .I2C5RCVINV       /* 0xBF82086C */
  .SPI1CON          /* 0xBF821000 */
  .SPI1CONCLR       /* 0xBF821004 */
  .SPI1CONSET       /* 0xBF821008 */
  .SPI1CONINV       /* 0xBF82100C */
  .SPI1STAT         /* 0xBF821010 */
  .SPI1STATCLR      /* 0xBF821014 */
  .SPI1STATSET      /* 0xBF821018 */
  .SPI1STATINV      /* 0xBF82101C */
  .SPI1BUF          /* 0xBF821020 */
  .SPI1BRG          /* 0xBF821030 */
  .SPI1BRGCLR       /* 0xBF821034 */
  .SPI1BRGSET       /* 0xBF821038 */
  .SPI1BRGINV       /* 0xBF82103C */
  .SPI1CON2         /* 0xBF821040 */
  .SPI1CON2CLR      /* 0xBF821044 */
  .SPI1CON2SET      /* 0xBF821048 */
  .SPI1CON2INV      /* 0xBF82104C */
  .SPI2CON          /* 0xBF821200 */
  .SPI2CONCLR       /* 0xBF821204 */
  .SPI2CONSET       /* 0xBF821208 */
  .SPI2CONINV       /* 0xBF82120C */
  .SPI2STAT         /* 0xBF821210 */
  .SPI2STATCLR      /* 0xBF821214 */
  .SPI2STATSET      /* 0xBF821218 */
  .SPI2STATINV      /* 0xBF82121C */
  .SPI2BUF          /* 0xBF821220 */
  .SPI2BRG          /* 0xBF821230 */
  .SPI2BRGCLR       /* 0xBF821234 */
  .SPI2BRGSET       /* 0xBF821238 */
  .SPI2BRGINV       /* 0xBF82123C */
  .SPI2CON2         /* 0xBF821240 */
  .SPI2CON2CLR      /* 0xBF821244 */
  .SPI2CON2SET      /* 0xBF821248 */
  .SPI2CON2INV      /* 0xBF82124C */
  .SPI3CON          /* 0xBF821400 */
  .SPI3CONCLR       /* 0xBF821404 */
  .SPI3CONSET       /* 0xBF821408 */
  .SPI3CONINV       /* 0xBF82140C */
  .SPI3STAT         /* 0xBF821410 */
  .SPI3STATCLR      /* 0xBF821414 */
  .SPI3STATSET      /* 0xBF821418 */
  .SPI3STATINV      /* 0xBF82141C */
  .SPI3BUF          /* 0xBF821420 */
  .SPI3BRG          /* 0xBF821430 */
  .SPI3BRGCLR       /* 0xBF821434 */
  .SPI3BRGSET       /* 0xBF821438 */
  .SPI3BRGINV       /* 0xBF82143C */
  .SPI3CON2         /* 0xBF821440 */
  .SPI3CON2CLR      /* 0xBF821444 */
  .SPI3CON2SET      /* 0xBF821448 */
  .SPI3CON2INV      /* 0xBF82144C */
  .SPI4CON          /* 0xBF821600 */
  .SPI4CONCLR       /* 0xBF821604 */
  .SPI4CONSET       /* 0xBF821608 */
  .SPI4CONINV       /* 0xBF82160C */
  .SPI4STAT         /* 0xBF821610 */
  .SPI4STATCLR      /* 0xBF821614 */
  .SPI4STATSET      /* 0xBF821618 */
  .SPI4STATINV      /* 0xBF82161C */
  .SPI4BUF          /* 0xBF821620 */
  .SPI4BRG          /* 0xBF821630 */
  .SPI4BRGCLR       /* 0xBF821634 */
  .SPI4BRGSET       /* 0xBF821638 */
  .SPI4BRGINV       /* 0xBF82163C */
  .SPI4CON2         /* 0xBF821640 */
  .SPI4CON2CLR      /* 0xBF821644 */
  .SPI4CON2SET      /* 0xBF821648 */
  .SPI4CON2INV      /* 0xBF82164C */
  .SPI5CON          /* 0xBF821800 */
  .SPI5CONCLR       /* 0xBF821804 */
  .SPI5CONSET       /* 0xBF821808 */
  .SPI5CONINV       /* 0xBF82180C */
  .SPI5STAT         /* 0xBF821810 */
  .SPI5STATCLR      /* 0xBF821814 */
  .SPI5STATSET      /* 0xBF821818 */
  .SPI5STATINV      /* 0xBF82181C */
  .SPI5BUF          /* 0xBF821820 */
  .SPI5BRG          /* 0xBF821830 */
  .SPI5BRGCLR       /* 0xBF821834 */
  .SPI5BRGSET       /* 0xBF821838 */
  .SPI5BRGINV       /* 0xBF82183C */
  .SPI5CON2         /* 0xBF821840 */
  .SPI5CON2CLR      /* 0xBF821844 */
  .SPI5CON2SET      /* 0xBF821848 */
  .SPI5CON2INV      /* 0xBF82184C */
  .SPI6CON          /* 0xBF821A00 */
  .SPI6CONCLR       /* 0xBF821A04 */
  .SPI6CONSET       /* 0xBF821A08 */
  .SPI6CONINV       /* 0xBF821A0C */
  .SPI6STAT         /* 0xBF821A10 */
  .SPI6STATCLR      /* 0xBF821A14 */
  .SPI6STATSET      /* 0xBF821A18 */
  .SPI6STATINV      /* 0xBF821A1C */
  .SPI6BUF          /* 0xBF821A20 */
  .SPI6BRG          /* 0xBF821A30 */
  .SPI6BRGCLR       /* 0xBF821A34 */
  .SPI6BRGSET       /* 0xBF821A38 */
  .SPI6BRGINV       /* 0xBF821A3C */
  .SPI6CON2         /* 0xBF821A40 */
  .SPI6CON2CLR      /* 0xBF821A44 */
  .SPI6CON2SET      /* 0xBF821A48 */
  .SPI6CON2INV      /* 0xBF821A4C */
  .U1MODE           /* 0xBF822000 */
  .UABMODE          /* 0xBF822000 */
  .U1MODECLR        /* 0xBF822004 */
  .UABMODECLR       /* 0xBF822004 */
  .U1MODESET        /* 0xBF822008 */
  .UABMODESET       /* 0xBF822008 */
  .U1MODEINV        /* 0xBF82200C */
  .UABMODEINV       /* 0xBF82200C */
  .U1STA            /* 0xBF822010 */
  .UABSTA           /* 0xBF822010 */
  .U1STACLR         /* 0xBF822014 */
  .UABSTACLR        /* 0xBF822014 */
  .U1STASET         /* 0xBF822018 */
  .UABSTASET        /* 0xBF822018 */
  .U1STAINV         /* 0xBF82201C */
  .UABSTAINV        /* 0xBF82201C */
  .U1TXREG          /* 0xBF822020 */
  .UABTXREG         /* 0xBF822020 */
  .U1RXREG          /* 0xBF822030 */
  .UABRXREG         /* 0xBF822030 */
  .U1BRG            /* 0xBF822040 */
  .UABBRG           /* 0xBF822040 */
  .U1BRGCLR         /* 0xBF822044 */
  .UABBRGCLR        /* 0xBF822044 */
  .U1BRGSET         /* 0xBF822048 */
  .UABBRGSET        /* 0xBF822048 */
  .U1BRGINV         /* 0xBF82204C */
  .UABBRGINV        /* 0xBF82204C */
  .U2MODE           /* 0xBF822200 */
  .UCDMODE          /* 0xBF822200 */
  .U2MODECLR        /* 0xBF822204 */
  .UCDMODECLR       /* 0xBF822204 */
  .U2MODESET        /* 0xBF822208 */
  .UCDMODESET       /* 0xBF822208 */
  .U2MODEINV        /* 0xBF82220C */
  .UCDMODEINV       /* 0xBF82220C */
  .U2STA            /* 0xBF822210 */
  .UCDSTA           /* 0xBF822210 */
  .U2STACLR         /* 0xBF822214 */
  .UCDSTACLR        /* 0xBF822214 */
  .U2STASET         /* 0xBF822218 */
  .UCDSTASET        /* 0xBF822218 */
  .U2STAINV         /* 0xBF82221C */
  .UCDSTAINV        /* 0xBF82221C */
  .U2TXREG          /* 0xBF822220 */
  .UCDTXREG         /* 0xBF822220 */
  .U2RXREG          /* 0xBF822230 */
  .UCDRXREG         /* 0xBF822230 */
  .U2BRG            /* 0xBF822240 */
  .UCDBRG           /* 0xBF822240 */
  .U2BRGCLR         /* 0xBF822244 */
  .UCDBRGCLR        /* 0xBF822244 */
  .U2BRGSET         /* 0xBF822248 */
  .UCDBRGSET        /* 0xBF822248 */
  .U2BRGINV         /* 0xBF82224C */
  .UCDBRGINV        /* 0xBF82224C */
  .U3MODE           /* 0xBF822400 */
  .UEFMODE          /* 0xBF822400 */
  .U3MODECLR        /* 0xBF822404 */
  .UEFMODECLR       /* 0xBF822404 */
  .U3MODESET        /* 0xBF822408 */
  .UEFMODESET       /* 0xBF822408 */
  .U3MODEINV        /* 0xBF82240C */
  .UEFMODEINV       /* 0xBF82240C */
  .U3STA            /* 0xBF822410 */
  .UEFSTA           /* 0xBF822410 */
  .U3STACLR         /* 0xBF822414 */
  .UEFSTACLR        /* 0xBF822414 */
  .U3STASET         /* 0xBF822418 */
  .UEFSTASET        /* 0xBF822418 */
  .U3STAINV         /* 0xBF82241C */
  .UEFSTAINV        /* 0xBF82241C */
  .U3TXREG          /* 0xBF822420 */
  .UEFTXREG         /* 0xBF822420 */
  .U3RXREG          /* 0xBF822430 */
  .UEFRXREG         /* 0xBF822430 */
  .U3BRG            /* 0xBF822440 */
  .UEFBRG           /* 0xBF822440 */
  .U3BRGCLR         /* 0xBF822444 */
  .UEFBRGCLR        /* 0xBF822444 */
  .U3BRGSET         /* 0xBF822448 */
  .UEFBRGSET        /* 0xBF822448 */
  .U3BRGINV         /* 0xBF82244C */
  .UEFBRGINV        /* 0xBF82244C */
  .U4MODE           /* 0xBF822600 */
  .UGHMODE          /* 0xBF822600 */
  .U4MODECLR        /* 0xBF822604 */
  .UGHMODECLR       /* 0xBF822604 */
  .U4MODESET        /* 0xBF822608 */
  .UGHMODESET       /* 0xBF822608 */
  .U4MODEINV        /* 0xBF82260C */
  .UGHMODEINV       /* 0xBF82260C */
  .U4STA            /* 0xBF822610 */
  .UGHSTA           /* 0xBF822610 */
  .U4STACLR         /* 0xBF822614 */
  .UGHSTACLR        /* 0xBF822614 */
  .U4STASET         /* 0xBF822618 */
  .UGHSTASET        /* 0xBF822618 */
  .U4STAINV         /* 0xBF82261C */
  .UGHSTAINV        /* 0xBF82261C */
  .U4TXREG          /* 0xBF822620 */
  .UGHTXREG         /* 0xBF822620 */
  .U4RXREG          /* 0xBF822630 */
  .UGHRXREG         /* 0xBF822630 */
  .U4BRG            /* 0xBF822640 */
  .UGHBRG           /* 0xBF822640 */
  .U4BRGCLR         /* 0xBF822644 */
  .UGHBRGCLR        /* 0xBF822644 */
  .U4BRGSET         /* 0xBF822648 */
  .UGHBRGSET        /* 0xBF822648 */
  .U4BRGINV         /* 0xBF82264C */
  .UGHBRGINV        /* 0xBF82264C */
  .U5MODE           /* 0xBF822800 */
  .UJKMODE          /* 0xBF822800 */
  .U5MODECLR        /* 0xBF822804 */
  .UJKMODECLR       /* 0xBF822804 */
  .U5MODESET        /* 0xBF822808 */
  .UJKMODESET       /* 0xBF822808 */
  .U5MODEINV        /* 0xBF82280C */
  .UJKMODEINV       /* 0xBF82280C */
  .U5STA            /* 0xBF822810 */
  .UJKSTA           /* 0xBF822810 */
  .U5STACLR         /* 0xBF822814 */
  .UJKSTACLR        /* 0xBF822814 */
  .U5STASET         /* 0xBF822818 */
  .UJKSTASET        /* 0xBF822818 */
  .U5STAINV         /* 0xBF82281C */
  .UJKSTAINV        /* 0xBF82281C */
  .U5TXREG          /* 0xBF822820 */
  .UJKTXREG         /* 0xBF822820 */
  .U5RXREG          /* 0xBF822830 */
  .UJKRXREG         /* 0xBF822830 */
  .U5BRG            /* 0xBF822840 */
  .UJKBRG           /* 0xBF822840 */
  .U5BRGCLR         /* 0xBF822844 */
  .UJKBRGCLR        /* 0xBF822844 */
  .U5BRGSET         /* 0xBF822848 */
  .UJKBRGSET        /* 0xBF822848 */
  .U5BRGINV         /* 0xBF82284C */
  .UJKBRGINV        /* 0xBF82284C */
  .U6MODE           /* 0xBF822A00 */
  .ULMMODE          /* 0xBF822A00 */
  .U6MODECLR        /* 0xBF822A04 */
  .ULMMODECLR       /* 0xBF822A04 */
  .U6MODESET        /* 0xBF822A08 */
  .ULMMODESET       /* 0xBF822A08 */
  .U6MODEINV        /* 0xBF822A0C */
  .ULMMODEINV       /* 0xBF822A0C */
  .U6STA            /* 0xBF822A10 */
  .ULMSTA           /* 0xBF822A10 */
  .U6STACLR         /* 0xBF822A14 */
  .ULMSTACLR        /* 0xBF822A14 */
  .U6STASET         /* 0xBF822A18 */
  .ULMSTASET        /* 0xBF822A18 */
  .U6STAINV         /* 0xBF822A1C */
  .ULMSTAINV        /* 0xBF822A1C */
  .U6TXREG          /* 0xBF822A20 */
  .ULMTXREG         /* 0xBF822A20 */
  .U6RXREG          /* 0xBF822A30 */
  .ULMRXREG         /* 0xBF822A30 */
  .U6BRG            /* 0xBF822A40 */
  .ULMBRG           /* 0xBF822A40 */
  .U6BRGCLR         /* 0xBF822A44 */
  .ULMBRGCLR        /* 0xBF822A44 */
  .U6BRGSET         /* 0xBF822A48 */
  .ULMBRGSET        /* 0xBF822A48 */
  .U6BRGINV         /* 0xBF822A4C */
  .ULMBRGINV        /* 0xBF822A4C */
  .PMCON            /* 0xBF82E000 */
  .PMCONCLR         /* 0xBF82E004 */
  .PMCONSET         /* 0xBF82E008 */
  .PMCONINV         /* 0xBF82E00C */
  .PMMODE           /* 0xBF82E010 */
  .PMMODECLR        /* 0xBF82E014 */
  .PMMODESET        /* 0xBF82E018 */
  .PMMODEINV        /* 0xBF82E01C */
  .PMADDR           /* 0xBF82E020 */
  .PMADDRCLR        /* 0xBF82E024 */
  .PMADDRSET        /* 0xBF82E028 */
  .PMADDRINV        /* 0xBF82E02C */
  .PMDOUT           /* 0xBF82E030 */
  .PMDOUTCLR        /* 0xBF82E034 */
  .PMDOUTSET        /* 0xBF82E038 */
  .PMDOUTINV        /* 0xBF82E03C */
  .PMDIN            /* 0xBF82E040 */
  .PMDINCLR         /* 0xBF82E044 */
  .PMDINSET         /* 0xBF82E048 */
  .PMDININV         /* 0xBF82E04C */
  .PMAEN            /* 0xBF82E050 */
  .PMAENCLR         /* 0xBF82E054 */
  .PMAENSET         /* 0xBF82E058 */
  .PMAENINV         /* 0xBF82E05C */
  .PMSTAT           /* 0xBF82E060 */
  .PMSTATCLR        /* 0xBF82E064 */
  .PMSTATSET        /* 0xBF82E068 */
  .PMSTATINV        /* 0xBF82E06C */
  .PMWADDR          /* 0xBF82E070 */
  .PMWADDRCLR       /* 0xBF82E074 */
  .PMWADDRSET       /* 0xBF82E078 */
  .PMWADDRINV       /* 0xBF82E07C */
  .PMRADDR          /* 0xBF82E080 */
  .PMRADDRCLR       /* 0xBF82E084 */
  .PMRADDRSET       /* 0xBF82E088 */
  .PMRADDRINV       /* 0xBF82E08C */
  .PMRDIN           /* 0xBF82E090 */
  .PMRDINCLR        /* 0xBF82E094 */
  .PMRDINSET        /* 0xBF82E098 */
  .PMRDININV        /* 0xBF82E09C */
  .T1CON            /* 0xBF840000 */
  .T1CONCLR         /* 0xBF840004 */
  .T1CONSET         /* 0xBF840008 */
  .T1CONINV         /* 0xBF84000C */
  .TMR1             /* 0xBF840010 */
  .TMR1CLR          /* 0xBF840014 */
  .TMR1SET          /* 0xBF840018 */
  .TMR1INV          /* 0xBF84001C */
  .PR1              /* 0xBF840020 */
  .PR1CLR           /* 0xBF840024 */
  .PR1SET           /* 0xBF840028 */
  .PR1INV           /* 0xBF84002C */
  .T2CON            /* 0xBF840200 */
  .T2CONCLR         /* 0xBF840204 */
  .T2CONSET         /* 0xBF840208 */
  .T2CONINV         /* 0xBF84020C */
  .TMR2             /* 0xBF840210 */
  .TMR2CLR          /* 0xBF840214 */
  .TMR2SET          /* 0xBF840218 */
  .TMR2INV          /* 0xBF84021C */
  .PR2              /* 0xBF840220 */
  .PR2CLR           /* 0xBF840224 */
  .PR2SET           /* 0xBF840228 */
  .PR2INV           /* 0xBF84022C */
  .T3CON            /* 0xBF840400 */
  .T3CONCLR         /* 0xBF840404 */
  .T3CONSET         /* 0xBF840408 */
  .T3CONINV         /* 0xBF84040C */
  .TMR3             /* 0xBF840410 */
  .TMR3CLR          /* 0xBF840414 */
  .TMR3SET          /* 0xBF840418 */
  .TMR3INV          /* 0xBF84041C */
  .PR3              /* 0xBF840420 */
  .PR3CLR           /* 0xBF840424 */
  .PR3SET           /* 0xBF840428 */
  .PR3INV           /* 0xBF84042C */
  .T4CON            /* 0xBF840600 */
  .T4CONCLR         /* 0xBF840604 */
  .T4CONSET         /* 0xBF840608 */
  .T4CONINV         /* 0xBF84060C */
  .TMR4             /* 0xBF840610 */
  .TMR4CLR          /* 0xBF840614 */
  .TMR4SET          /* 0xBF840618 */
  .TMR4INV          /* 0xBF84061C */
  .PR4              /* 0xBF840620 */
  .PR4CLR           /* 0xBF840624 */
  .PR4SET           /* 0xBF840628 */
  .PR4INV           /* 0xBF84062C */
  .T5CON            /* 0xBF840800 */
  .T5CONCLR         /* 0xBF840804 */
  .T5CONSET         /* 0xBF840808 */
  .T5CONINV         /* 0xBF84080C */
  .TMR5             /* 0xBF840810 */
  .TMR5CLR          /* 0xBF840814 */
  .TMR5SET          /* 0xBF840818 */
  .TMR5INV          /* 0xBF84081C */
  .PR5              /* 0xBF840820 */
  .PR5CLR           /* 0xBF840824 */
  .PR5SET           /* 0xBF840828 */
  .PR5INV           /* 0xBF84082C */
  .T6CON            /* 0xBF840A00 */
  .T6CONCLR         /* 0xBF840A04 */
  .T6CONSET         /* 0xBF840A08 */
  .T6CONINV         /* 0xBF840A0C */
  .TMR6             /* 0xBF840A10 */
  .TMR6CLR          /* 0xBF840A14 */
  .TMR6SET          /* 0xBF840A18 */
  .TMR6INV          /* 0xBF840A1C */
  .PR6              /* 0xBF840A20 */
  .PR6CLR           /* 0xBF840A24 */
  .PR6SET           /* 0xBF840A28 */
  .PR6INV           /* 0xBF840A2C */
  .T7CON            /* 0xBF840C00 */
  .T7CONCLR         /* 0xBF840C04 */
  .T7CONSET         /* 0xBF840C08 */
  .T7CONINV         /* 0xBF840C0C */
  .TMR7             /* 0xBF840C10 */
  .TMR7CLR          /* 0xBF840C14 */
  .TMR7SET          /* 0xBF840C18 */
  .TMR7INV          /* 0xBF840C1C */
  .PR7              /* 0xBF840C20 */
  .PR7CLR           /* 0xBF840C24 */
  .PR7SET           /* 0xBF840C28 */
  .PR7INV           /* 0xBF840C2C */
  .T8CON            /* 0xBF840E00 */
  .T8CONCLR         /* 0xBF840E04 */
  .T8CONSET         /* 0xBF840E08 */
  .T8CONINV         /* 0xBF840E0C */
  .TMR8             /* 0xBF840E10 */
  .TMR8CLR          /* 0xBF840E14 */
  .TMR8SET          /* 0xBF840E18 */
  .TMR8INV          /* 0xBF840E1C */
  .PR8              /* 0xBF840E20 */
  .PR8CLR           /* 0xBF840E24 */
  .PR8SET           /* 0xBF840E28 */
  .PR8INV           /* 0xBF840E2C */
  .T9CON            /* 0xBF841000 */
  .T9CONCLR         /* 0xBF841004 */
  .T9CONSET         /* 0xBF841008 */
  .T9CONINV         /* 0xBF84100C */
  .TMR9             /* 0xBF841010 */
  .TMR9CLR          /* 0xBF841014 */
  .TMR9SET          /* 0xBF841018 */
  .TMR9INV          /* 0xBF84101C */
  .PR9              /* 0xBF841020 */
  .PR9CLR           /* 0xBF841024 */
  .PR9SET           /* 0xBF841028 */
  .PR9INV           /* 0xBF84102C */
  .IC1CON           /* 0xBF842000 */
  .IC1CONCLR        /* 0xBF842004 */
  .IC1CONSET        /* 0xBF842008 */
  .IC1CONINV        /* 0xBF84200C */
  .IC1BUF           /* 0xBF842010 */
  .IC2CON           /* 0xBF842200 */
  .IC2CONCLR        /* 0xBF842204 */
  .IC2CONSET        /* 0xBF842208 */
  .IC2CONINV        /* 0xBF84220C */
  .IC2BUF           /* 0xBF842210 */
  .IC3CON           /* 0xBF842400 */
  .IC3CONCLR        /* 0xBF842404 */
  .IC3CONSET        /* 0xBF842408 */
  .IC3CONINV        /* 0xBF84240C */
  .IC3BUF           /* 0xBF842410 */
  .IC4CON           /* 0xBF842600 */
  .IC4CONCLR        /* 0xBF842604 */
  .IC4CONSET        /* 0xBF842608 */
  .IC4CONINV        /* 0xBF84260C */
  .IC4BUF           /* 0xBF842610 */
  .IC5CON           /* 0xBF842800 */
  .IC5CONCLR        /* 0xBF842804 */
  .IC5CONSET        /* 0xBF842808 */
  .IC5CONINV        /* 0xBF84280C */
  .IC5BUF           /* 0xBF842810 */
  .IC6CON           /* 0xBF842A00 */
  .IC6CONCLR        /* 0xBF842A04 */
  .IC6CONSET        /* 0xBF842A08 */
  .IC6CONINV        /* 0xBF842A0C */
  .IC6BUF           /* 0xBF842A10 */
  .IC7CON           /* 0xBF842C00 */
  .IC7CONCLR        /* 0xBF842C04 */
  .IC7CONSET        /* 0xBF842C08 */
  .IC7CONINV        /* 0xBF842C0C */
  .IC7BUF           /* 0xBF842C10 */
  .IC8CON           /* 0xBF842E00 */
  .IC8CONCLR        /* 0xBF842E04 */
  .IC8CONSET        /* 0xBF842E08 */
  .IC8CONINV        /* 0xBF842E0C */
  .IC8BUF           /* 0xBF842E10 */
  .IC9CON           /* 0xBF843000 */
  .IC9CONCLR        /* 0xBF843004 */
  .IC9CONSET        /* 0xBF843008 */
  .IC9CONINV        /* 0xBF84300C */
  .IC9BUF           /* 0xBF843010 */
  .OC1CON           /* 0xBF844000 */
  .OC1CONCLR        /* 0xBF844004 */
  .OC1CONSET        /* 0xBF844008 */
  .OC1CONINV        /* 0xBF84400C */
  .OC1R             /* 0xBF844010 */
  .OC1RCLR          /* 0xBF844014 */
  .OC1RSET          /* 0xBF844018 */
  .OC1RINV          /* 0xBF84401C */
  .OC1RS            /* 0xBF844020 */
  .OC1RSCLR         /* 0xBF844024 */
  .OC1RSSET         /* 0xBF844028 */
  .OC1RSINV         /* 0xBF84402C */
  .OC2CON           /* 0xBF844200 */
  .OC2CONCLR        /* 0xBF844204 */
  .OC2CONSET        /* 0xBF844208 */
  .OC2CONINV        /* 0xBF84420C */
  .OC2R             /* 0xBF844210 */
  .OC2RCLR          /* 0xBF844214 */
  .OC2RSET          /* 0xBF844218 */
  .OC2RINV          /* 0xBF84421C */
  .OC2RS            /* 0xBF844220 */
  .OC2RSCLR         /* 0xBF844224 */
  .OC2RSSET         /* 0xBF844228 */
  .OC2RSINV         /* 0xBF84422C */
  .OC3CON           /* 0xBF844400 */
  .OC3CONCLR        /* 0xBF844404 */
  .OC3CONSET        /* 0xBF844408 */
  .OC3CONINV        /* 0xBF84440C */
  .OC3R             /* 0xBF844410 */
  .OC3RCLR          /* 0xBF844414 */
  .OC3RSET          /* 0xBF844418 */
  .OC3RINV          /* 0xBF84441C */
  .OC3RS            /* 0xBF844420 */
  .OC3RSCLR         /* 0xBF844424 */
  .OC3RSSET         /* 0xBF844428 */
  .OC3RSINV         /* 0xBF84442C */
  .OC4CON           /* 0xBF844600 */
  .OC4CONCLR        /* 0xBF844604 */
  .OC4CONSET        /* 0xBF844608 */
  .OC4CONINV        /* 0xBF84460C */
  .OC4R             /* 0xBF844610 */
  .OC4RCLR          /* 0xBF844614 */
  .OC4RSET          /* 0xBF844618 */
  .OC4RINV          /* 0xBF84461C */
  .OC4RS            /* 0xBF844620 */
  .OC4RSCLR         /* 0xBF844624 */
  .OC4RSSET         /* 0xBF844628 */
  .OC4RSINV         /* 0xBF84462C */
  .OC5CON           /* 0xBF844800 */
  .OC5CONCLR        /* 0xBF844804 */
  .OC5CONSET        /* 0xBF844808 */
  .OC5CONINV        /* 0xBF84480C */
  .OC5R             /* 0xBF844810 */
  .OC5RCLR          /* 0xBF844814 */
  .OC5RSET          /* 0xBF844818 */
  .OC5RINV          /* 0xBF84481C */
  .OC5RS            /* 0xBF844820 */
  .OC5RSCLR         /* 0xBF844824 */
  .OC5RSSET         /* 0xBF844828 */
  .OC5RSINV         /* 0xBF84482C */
  .OC6CON           /* 0xBF844A00 */
  .OC6CONCLR        /* 0xBF844A04 */
  .OC6CONSET        /* 0xBF844A08 */
  .OC6CONINV        /* 0xBF844A0C */
  .OC6R             /* 0xBF844A10 */
  .OC6RCLR          /* 0xBF844A14 */
  .OC6RSET          /* 0xBF844A18 */
  .OC6RINV          /* 0xBF844A1C */
  .OC6RS            /* 0xBF844A20 */
  .OC6RSCLR         /* 0xBF844A24 */
  .OC6RSSET         /* 0xBF844A28 */
  .OC6RSINV         /* 0xBF844A2C */
  .OC7CON           /* 0xBF844C00 */
  .OC7CONCLR        /* 0xBF844C04 */
  .OC7CONSET        /* 0xBF844C08 */
  .OC7CONINV        /* 0xBF844C0C */
  .OC7R             /* 0xBF844C10 */
  .OC7RCLR          /* 0xBF844C14 */
  .OC7RSET          /* 0xBF844C18 */
  .OC7RINV          /* 0xBF844C1C */
  .OC7RS            /* 0xBF844C20 */
  .OC7RSCLR         /* 0xBF844C24 */
  .OC7RSSET         /* 0xBF844C28 */
  .OC7RSINV         /* 0xBF844C2C */
  .OC8CON           /* 0xBF844E00 */
  .OC8CONCLR        /* 0xBF844E04 */
  .OC8CONSET        /* 0xBF844E08 */
  .OC8CONINV        /* 0xBF844E0C */
  .OC8R             /* 0xBF844E10 */
  .OC8RCLR          /* 0xBF844E14 */
  .OC8RSET          /* 0xBF844E18 */
  .OC8RINV          /* 0xBF844E1C */
  .OC8RS            /* 0xBF844E20 */
  .OC8RSCLR         /* 0xBF844E24 */
  .OC8RSSET         /* 0xBF844E28 */
  .OC8RSINV         /* 0xBF844E2C */
  .OC9CON           /* 0xBF845000 */
  .OC9CONCLR        /* 0xBF845004 */
  .OC9CONSET        /* 0xBF845008 */
  .OC9CONINV        /* 0xBF84500C */
  .OC9R             /* 0xBF845010 */
  .OC9RCLR          /* 0xBF845014 */
  .OC9RSET          /* 0xBF845018 */
  .OC9RINV          /* 0xBF84501C */
  .OC9RS            /* 0xBF845020 */
  .OC9RSCLR         /* 0xBF845024 */
  .OC9RSSET         /* 0xBF845028 */
  .OC9RSINV         /* 0xBF84502C */
  .ADCCON1          /* 0xBF84B000 */
  .ADCCON2          /* 0xBF84B004 */
  .ADCCON3          /* 0xBF84B008 */
  .ADCTRGMODE       /* 0xBF84B00C */
  .ADCIMCON1        /* 0xBF84B010 */
  .ADCIMCON2        /* 0xBF84B014 */
  .ADCIMCON3        /* 0xBF84B018 */
  .ADCGIRQEN1       /* 0xBF84B020 */
  .ADCGIRQEN2       /* 0xBF84B024 */
  .ADCCSS1          /* 0xBF84B028 */
  .ADCCSS2          /* 0xBF84B02C */
  .ADCDSTAT1        /* 0xBF84B030 */
  .ADCDSTAT2        /* 0xBF84B034 */
  .ADCCMPEN1        /* 0xBF84B038 */
  .ADCCMP1          /* 0xBF84B03C */
