HomuraVehicle/homuraLib_v2/machine/device/p32mz2048efg100_forVC.c
  .ADCCMPEN2        /* 0xBF84B040 */
  .ADCCMP2          /* 0xBF84B044 */
  .ADCCMPEN3        /* 0xBF84B048 */
  .ADCCMP3          /* 0xBF84B04C */
  .ADCCMPEN4        /* 0xBF84B050 */
  .ADCCMP4          /* 0xBF84B054 */
  .ADCCMPEN5        /* 0xBF84B058 */
  .ADCCMP5          /* 0xBF84B05C */
  .ADCCMPEN6        /* 0xBF84B060 */
  .ADCCMP6          /* 0xBF84B064 */
  .ADCFLTR1         /* 0xBF84B068 */
  .ADCFLTR2         /* 0xBF84B06C */
  .ADCFLTR3         /* 0xBF84B070 */
  .ADCFLTR4         /* 0xBF84B074 */
  .ADCFLTR5         /* 0xBF84B078 */
  .ADCFLTR6         /* 0xBF84B07C */
  .ADCTRG1          /* 0xBF84B080 */
  .ADCTRG2          /* 0xBF84B084 */
  .ADCTRG3          /* 0xBF84B088 */
  .ADCCMPCON1       /* 0xBF84B0A0 */
  .ADCCMPCON2       /* 0xBF84B0A4 */
  .ADCCMPCON3       /* 0xBF84B0A8 */
  .ADCCMPCON4       /* 0xBF84B0AC */
  .ADCCMPCON5       /* 0xBF84B0B0 */
  .ADCCMPCON6       /* 0xBF84B0B4 */
  .ADCBASE          /* 0xBF84B0C0 */
  .ADCTRGSNS        /* 0xBF84B0D0 */
  .ADC0TIME         /* 0xBF84B0D4 */
  .ADC1TIME         /* 0xBF84B0D8 */
  .ADC2TIME         /* 0xBF84B0DC */
  .ADC3TIME         /* 0xBF84B0E0 */
  .ADC4TIME         /* 0xBF84B0E4 */
  .ADCEIEN1         /* 0xBF84B0F0 */
  .ADCEIEN2         /* 0xBF84B0F4 */
  .ADCEISTAT1       /* 0xBF84B0F8 */
  .ADCEISTAT2       /* 0xBF84B0FC */
  .ADCANCON         /* 0xBF84B100 */
  .ADC0CFG          /* 0xBF84B180 */
  .ADC1CFG          /* 0xBF84B184 */
  .ADC2CFG          /* 0xBF84B188 */
  .ADC3CFG          /* 0xBF84B18C */
  .ADC4CFG          /* 0xBF84B190 */
  .ADC7CFG          /* 0xBF84B19C */
  .ADCSYSCFG0       /* 0xBF84B1C0 */
  .ADCSYSCFG1       /* 0xBF84B1C4 */
  .ADCDATA0         /* 0xBF84B200 */
  .ADCDATA1         /* 0xBF84B204 */
  .ADCDATA2         /* 0xBF84B208 */
  .ADCDATA3         /* 0xBF84B20C */
  .ADCDATA4         /* 0xBF84B210 */
  .ADCDATA5         /* 0xBF84B214 */
  .ADCDATA6         /* 0xBF84B218 */
  .ADCDATA7         /* 0xBF84B21C */
  .ADCDATA8         /* 0xBF84B220 */
  .ADCDATA9         /* 0xBF84B224 */
  .ADCDATA10        /* 0xBF84B228 */
  .ADCDATA11        /* 0xBF84B22C */
  .ADCDATA12        /* 0xBF84B230 */
  .ADCDATA13        /* 0xBF84B234 */
  .ADCDATA14        /* 0xBF84B238 */
  .ADCDATA15        /* 0xBF84B23C */
  .ADCDATA16        /* 0xBF84B240 */
  .ADCDATA17        /* 0xBF84B244 */
  .ADCDATA18        /* 0xBF84B248 */
  .ADCDATA19        /* 0xBF84B24C */
  .ADCDATA20        /* 0xBF84B250 */
  .ADCDATA21        /* 0xBF84B254 */
  .ADCDATA22        /* 0xBF84B258 */
  .ADCDATA23        /* 0xBF84B25C */
  .ADCDATA24        /* 0xBF84B260 */
  .ADCDATA25        /* 0xBF84B264 */
  .ADCDATA26        /* 0xBF84B268 */
  .ADCDATA27        /* 0xBF84B26C */
  .ADCDATA28        /* 0xBF84B270 */
  .ADCDATA29        /* 0xBF84B274 */
  .ADCDATA30        /* 0xBF84B278 */
  .ADCDATA31        /* 0xBF84B27C */
  .ADCDATA32        /* 0xBF84B280 */
  .ADCDATA33        /* 0xBF84B284 */
  .ADCDATA34        /* 0xBF84B288 */
  .ADCDATA43        /* 0xBF84B2AC */
  .ADCDATA44        /* 0xBF84B2B0 */
  .CM1CON           /* 0xBF84C000 */
  .CM1CONCLR        /* 0xBF84C004 */
  .CM1CONSET        /* 0xBF84C008 */
  .CM1CONINV        /* 0xBF84C00C */
  .CM2CON           /* 0xBF84C010 */
  .CM2CONCLR        /* 0xBF84C014 */
  .CM2CONSET        /* 0xBF84C018 */
  .CM2CONINV        /* 0xBF84C01C */
  .CMSTAT           /* 0xBF84C060 */
  .CMSTATCLR        /* 0xBF84C064 */
  .CMSTATSET        /* 0xBF84C068 */
  .CMSTATINV        /* 0xBF84C06C */
  .ANSELA           /* 0xBF860000 */
  .ANSELACLR        /* 0xBF860004 */
  .ANSELASET        /* 0xBF860008 */
  .ANSELAINV        /* 0xBF86000C */
  .TRISA            /* 0xBF860010 */
  .TRISACLR         /* 0xBF860014 */
  .TRISASET         /* 0xBF860018 */
  .TRISAINV         /* 0xBF86001C */
  .PORTA            /* 0xBF860020 */
  .PORTACLR         /* 0xBF860024 */
  .PORTASET         /* 0xBF860028 */
  .PORTAINV         /* 0xBF86002C */
  .LATA             /* 0xBF860030 */
  .LATACLR          /* 0xBF860034 */
  .LATASET          /* 0xBF860038 */
  .LATAINV          /* 0xBF86003C */
  .ODCA             /* 0xBF860040 */
  .ODCACLR          /* 0xBF860044 */
  .ODCASET          /* 0xBF860048 */
  .ODCAINV          /* 0xBF86004C */
  .CNPUA            /* 0xBF860050 */
  .CNPUACLR         /* 0xBF860054 */
  .CNPUASET         /* 0xBF860058 */
  .CNPUAINV         /* 0xBF86005C */
  .CNPDA            /* 0xBF860060 */
  .CNPDACLR         /* 0xBF860064 */
  .CNPDASET         /* 0xBF860068 */
  .CNPDAINV         /* 0xBF86006C */
  .CNCONA           /* 0xBF860070 */
  .CNCONACLR        /* 0xBF860074 */
  .CNCONASET        /* 0xBF860078 */
  .CNCONAINV        /* 0xBF86007C */
  .CNENA            /* 0xBF860080 */
  .CNENACLR         /* 0xBF860084 */
  .CNENASET         /* 0xBF860088 */
  .CNENAINV         /* 0xBF86008C */
  .CNSTATA          /* 0xBF860090 */
  .CNSTATACLR       /* 0xBF860094 */
  .CNSTATASET       /* 0xBF860098 */
  .CNSTATAINV       /* 0xBF86009C */
  .CNNEA            /* 0xBF8600A0 */
  .CNFA             /* 0xBF8600B0 */
  .SRCON0A          /* 0xBF8600C0 */
  .SRCON1A          /* 0xBF8600D0 */
  .ANSELB           /* 0xBF860100 */
  .ANSELBCLR        /* 0xBF860104 */
  .ANSELBSET        /* 0xBF860108 */
  .ANSELBINV        /* 0xBF86010C */
  .TRISB            /* 0xBF860110 */
  .TRISBCLR         /* 0xBF860114 */
  .TRISBSET         /* 0xBF860118 */
  .TRISBINV         /* 0xBF86011C */
  .PORTB            /* 0xBF860120 */
  .PORTBCLR         /* 0xBF860124 */
  .PORTBSET         /* 0xBF860128 */
  .PORTBINV         /* 0xBF86012C */
  .LATB             /* 0xBF860130 */
  .LATBCLR          /* 0xBF860134 */
  .LATBSET          /* 0xBF860138 */
  .LATBINV          /* 0xBF86013C */
  .ODCB             /* 0xBF860140 */
  .ODCBCLR          /* 0xBF860144 */
  .ODCBSET          /* 0xBF860148 */
  .ODCBINV          /* 0xBF86014C */
  .CNPUB            /* 0xBF860150 */
  .CNPUBCLR         /* 0xBF860154 */
  .CNPUBSET         /* 0xBF860158 */
  .CNPUBINV         /* 0xBF86015C */
  .CNPDB            /* 0xBF860160 */
  .CNPDBCLR         /* 0xBF860164 */
  .CNPDBSET         /* 0xBF860168 */
  .CNPDBINV         /* 0xBF86016C */
  .CNCONB           /* 0xBF860170 */
  .CNCONBCLR        /* 0xBF860174 */
  .CNCONBSET        /* 0xBF860178 */
  .CNCONBINV        /* 0xBF86017C */
  .CNENB            /* 0xBF860180 */
  .CNENBCLR         /* 0xBF860184 */
  .CNENBSET         /* 0xBF860188 */
  .CNENBINV         /* 0xBF86018C */
  .CNSTATB          /* 0xBF860190 */
  .CNSTATBCLR       /* 0xBF860194 */
  .CNSTATBSET       /* 0xBF860198 */
  .CNSTATBINV       /* 0xBF86019C */
  .CNNEB            /* 0xBF8601A0 */
  .CNFB             /* 0xBF8601B0 */
  .SRCON0B          /* 0xBF8601C0 */
  .SRCON1B          /* 0xBF8601D0 */
  .ANSELC           /* 0xBF860200 */
  .ANSELCCLR        /* 0xBF860204 */
  .ANSELCSET        /* 0xBF860208 */
  .ANSELCINV        /* 0xBF86020C */
  .TRISC            /* 0xBF860210 */
  .TRISCCLR         /* 0xBF860214 */
  .TRISCSET         /* 0xBF860218 */
  .TRISCINV         /* 0xBF86021C */
  .PORTC            /* 0xBF860220 */
  .PORTCCLR         /* 0xBF860224 */
  .PORTCSET         /* 0xBF860228 */
  .PORTCINV         /* 0xBF86022C */
  .LATC             /* 0xBF860230 */
  .LATCCLR          /* 0xBF860234 */
  .LATCSET          /* 0xBF860238 */
  .LATCINV          /* 0xBF86023C */
  .ODCC             /* 0xBF860240 */
  .ODCCCLR          /* 0xBF860244 */
  .ODCCSET          /* 0xBF860248 */
  .ODCCINV          /* 0xBF86024C */
  .CNPUC            /* 0xBF860250 */
  .CNPUCCLR         /* 0xBF860254 */
  .CNPUCSET         /* 0xBF860258 */
  .CNPUCINV         /* 0xBF86025C */
  .CNPDC            /* 0xBF860260 */
  .CNPDCCLR         /* 0xBF860264 */
  .CNPDCSET         /* 0xBF860268 */
  .CNPDCINV         /* 0xBF86026C */
  .CNCONC           /* 0xBF860270 */
  .CNCONCCLR        /* 0xBF860274 */
  .CNCONCSET        /* 0xBF860278 */
  .CNCONCINV        /* 0xBF86027C */
  .CNENC            /* 0xBF860280 */
  .CNENCCLR         /* 0xBF860284 */
  .CNENCSET         /* 0xBF860288 */
  .CNENCINV         /* 0xBF86028C */
  .CNSTATC          /* 0xBF860290 */
  .CNSTATCCLR       /* 0xBF860294 */
  .CNSTATCSET       /* 0xBF860298 */
  .CNSTATCINV       /* 0xBF86029C */
  .CNNEC            /* 0xBF8602A0 */
  .CNFC             /* 0xBF8602B0 */
  .ANSELD           /* 0xBF860300 */
  .ANSELDCLR        /* 0xBF860304 */
  .ANSELDSET        /* 0xBF860308 */
  .ANSELDINV        /* 0xBF86030C */
  .TRISD            /* 0xBF860310 */
  .TRISDCLR         /* 0xBF860314 */
  .TRISDSET         /* 0xBF860318 */
  .TRISDINV         /* 0xBF86031C */
  .PORTD            /* 0xBF860320 */
  .PORTDCLR         /* 0xBF860324 */
  .PORTDSET         /* 0xBF860328 */
  .PORTDINV         /* 0xBF86032C */
  .LATD             /* 0xBF860330 */
  .LATDCLR          /* 0xBF860334 */
  .LATDSET          /* 0xBF860338 */
  .LATDINV          /* 0xBF86033C */
  .ODCD             /* 0xBF860340 */
  .ODCDCLR          /* 0xBF860344 */
  .ODCDSET          /* 0xBF860348 */
  .ODCDINV          /* 0xBF86034C */
  .CNPUD            /* 0xBF860350 */
  .CNPUDCLR         /* 0xBF860354 */
  .CNPUDSET         /* 0xBF860358 */
  .CNPUDINV         /* 0xBF86035C */
  .CNPDD            /* 0xBF860360 */
  .CNPDDCLR         /* 0xBF860364 */
  .CNPDDSET         /* 0xBF860368 */
  .CNPDDINV         /* 0xBF86036C */
  .CNCOND           /* 0xBF860370 */
  .CNCONDCLR        /* 0xBF860374 */
  .CNCONDSET        /* 0xBF860378 */
  .CNCONDINV        /* 0xBF86037C */
  .CNEND            /* 0xBF860380 */
  .CNENDCLR         /* 0xBF860384 */
  .CNENDSET         /* 0xBF860388 */
  .CNENDINV         /* 0xBF86038C */
  .CNSTATD          /* 0xBF860390 */
  .CNSTATDCLR       /* 0xBF860394 */
  .CNSTATDSET       /* 0xBF860398 */
  .CNSTATDINV       /* 0xBF86039C */
  .CNNED            /* 0xBF8603A0 */
  .CNFD             /* 0xBF8603B0 */
  .ANSELE           /* 0xBF860400 */
  .ANSELECLR        /* 0xBF860404 */
  .ANSELESET        /* 0xBF860408 */
  .ANSELEINV        /* 0xBF86040C */
  .TRISE            /* 0xBF860410 */
  .TRISECLR         /* 0xBF860414 */
  .TRISESET         /* 0xBF860418 */
  .TRISEINV         /* 0xBF86041C */
  .PORTE            /* 0xBF860420 */
  .PORTECLR         /* 0xBF860424 */
  .PORTESET         /* 0xBF860428 */
  .PORTEINV         /* 0xBF86042C */
  .LATE             /* 0xBF860430 */
  .LATECLR          /* 0xBF860434 */
  .LATESET          /* 0xBF860438 */
  .LATEINV          /* 0xBF86043C */
  .ODCE             /* 0xBF860440 */
  .ODCECLR          /* 0xBF860444 */
  .ODCESET          /* 0xBF860448 */
  .ODCEINV          /* 0xBF86044C */
  .CNPUE            /* 0xBF860450 */
  .CNPUECLR         /* 0xBF860454 */
  .CNPUESET         /* 0xBF860458 */
  .CNPUEINV         /* 0xBF86045C */
  .CNPDE            /* 0xBF860460 */
  .CNPDECLR         /* 0xBF860464 */
  .CNPDESET         /* 0xBF860468 */
  .CNPDEINV         /* 0xBF86046C */
  .CNCONE           /* 0xBF860470 */
  .CNCONECLR        /* 0xBF860474 */
  .CNCONESET        /* 0xBF860478 */
  .CNCONEINV        /* 0xBF86047C */
  .CNENE            /* 0xBF860480 */
  .CNENECLR         /* 0xBF860484 */
  .CNENESET         /* 0xBF860488 */
  .CNENEINV         /* 0xBF86048C */
  .CNSTATE          /* 0xBF860490 */
  .CNSTATECLR       /* 0xBF860494 */
  .CNSTATESET       /* 0xBF860498 */
  .CNSTATEINV       /* 0xBF86049C */
  .CNNEE            /* 0xBF8604A0 */
  .CNFE             /* 0xBF8604B0 */
  .SRCON0E          /* 0xBF8604C0 */
  .SRCON1E          /* 0xBF8604D0 */
  .ANSELF           /* 0xBF860500 */
  .ANSELFCLR        /* 0xBF860504 */
  .ANSELFSET        /* 0xBF860508 */
  .ANSELFINV        /* 0xBF86050C */
  .TRISF            /* 0xBF860510 */
  .TRISFCLR         /* 0xBF860514 */
  .TRISFSET         /* 0xBF860518 */
  .TRISFINV         /* 0xBF86051C */
  .PORTF            /* 0xBF860520 */
  .PORTFCLR         /* 0xBF860524 */
  .PORTFSET         /* 0xBF860528 */
  .PORTFINV         /* 0xBF86052C */
  .LATF             /* 0xBF860530 */
  .LATFCLR          /* 0xBF860534 */
  .LATFSET          /* 0xBF860538 */
  .LATFINV          /* 0xBF86053C */
  .ODCF             /* 0xBF860540 */
  .ODCFCLR          /* 0xBF860544 */
  .ODCFSET          /* 0xBF860548 */
  .ODCFINV          /* 0xBF86054C */
  .CNPUF            /* 0xBF860550 */
  .CNPUFCLR         /* 0xBF860554 */
  .CNPUFSET         /* 0xBF860558 */
  .CNPUFINV         /* 0xBF86055C */
  .CNPDF            /* 0xBF860560 */
  .CNPDFCLR         /* 0xBF860564 */
  .CNPDFSET         /* 0xBF860568 */
  .CNPDFINV         /* 0xBF86056C */
  .CNCONF           /* 0xBF860570 */
  .CNCONFCLR        /* 0xBF860574 */
  .CNCONFSET        /* 0xBF860578 */
  .CNCONFINV        /* 0xBF86057C */
  .CNENF            /* 0xBF860580 */
  .CNENFCLR         /* 0xBF860584 */
  .CNENFSET         /* 0xBF860588 */
  .CNENFINV         /* 0xBF86058C */
  .CNSTATF          /* 0xBF860590 */
  .CNSTATFCLR       /* 0xBF860594 */
  .CNSTATFSET       /* 0xBF860598 */
  .CNSTATFINV       /* 0xBF86059C */
  .CNNEF            /* 0xBF8605A0 */
  .CNFF             /* 0xBF8605B0 */
  .SRCON0F          /* 0xBF8605C0 */
  .SRCON1F          /* 0xBF8605D0 */
  .ANSELG           /* 0xBF860600 */
  .ANSELGCLR        /* 0xBF860604 */
  .ANSELGSET        /* 0xBF860608 */
  .ANSELGINV        /* 0xBF86060C */
  .TRISG            /* 0xBF860610 */
  .TRISGCLR         /* 0xBF860614 */
  .TRISGSET         /* 0xBF860618 */
  .TRISGINV         /* 0xBF86061C */
  .PORTG            /* 0xBF860620 */
  .PORTGCLR         /* 0xBF860624 */
  .PORTGSET         /* 0xBF860628 */
  .PORTGINV         /* 0xBF86062C */
  .LATG             /* 0xBF860630 */
  .LATGCLR          /* 0xBF860634 */
  .LATGSET          /* 0xBF860638 */
  .LATGINV          /* 0xBF86063C */
  .ODCG             /* 0xBF860640 */
  .ODCGCLR          /* 0xBF860644 */
  .ODCGSET          /* 0xBF860648 */
  .ODCGINV          /* 0xBF86064C */
  .CNPUG            /* 0xBF860650 */
  .CNPUGCLR         /* 0xBF860654 */
  .CNPUGSET         /* 0xBF860658 */
  .CNPUGINV         /* 0xBF86065C */
  .CNPDG            /* 0xBF860660 */
  .CNPDGCLR         /* 0xBF860664 */
  .CNPDGSET         /* 0xBF860668 */
  .CNPDGINV         /* 0xBF86066C */
  .CNCONG           /* 0xBF860670 */
  .CNCONGCLR        /* 0xBF860674 */
  .CNCONGSET        /* 0xBF860678 */
  .CNCONGINV        /* 0xBF86067C */
  .CNENG            /* 0xBF860680 */
  .CNENGCLR         /* 0xBF860684 */
  .CNENGSET         /* 0xBF860688 */
  .CNENGINV         /* 0xBF86068C */
  .CNSTATG          /* 0xBF860690 */
  .CNSTATGCLR       /* 0xBF860694 */
  .CNSTATGSET       /* 0xBF860698 */
  .CNSTATGINV       /* 0xBF86069C */
  .CNNEG            /* 0xBF8606A0 */
  .CNFG             /* 0xBF8606B0 */
  .SRCON0G          /* 0xBF8606C0 */
  .SRCON1G          /* 0xBF8606D0 */
  .ETHCON1          /* 0xBF882000 */
  .ETHCON1CLR       /* 0xBF882004 */
  .ETHCON1SET       /* 0xBF882008 */
  .ETHCON1INV       /* 0xBF88200C */
  .ETHCON2          /* 0xBF882010 */
  .ETHCON2CLR       /* 0xBF882014 */
  .ETHCON2SET       /* 0xBF882018 */
  .ETHCON2INV       /* 0xBF88201C */
  .ETHTXST          /* 0xBF882020 */
  .ETHTXSTCLR       /* 0xBF882024 */
  .ETHTXSTSET       /* 0xBF882028 */
  .ETHTXSTINV       /* 0xBF88202C */
  .ETHRXST          /* 0xBF882030 */
  .ETHRXSTCLR       /* 0xBF882034 */
  .ETHRXSTSET       /* 0xBF882038 */
  .ETHRXSTINV       /* 0xBF88203C */
  .ETHHT0           /* 0xBF882040 */
  .ETHHT0CLR        /* 0xBF882044 */
  .ETHHT0SET        /* 0xBF882048 */
  .ETHHT0INV        /* 0xBF88204C */
  .ETHHT1           /* 0xBF882050 */
  .ETHHT1CLR        /* 0xBF882054 */
  .ETHHT1SET        /* 0xBF882058 */
  .ETHHT1INV        /* 0xBF88205C */
  .ETHPMM0          /* 0xBF882060 */
  .ETHPMM0CLR       /* 0xBF882064 */
  .ETHPMM0SET       /* 0xBF882068 */
  .ETHPMM0INV       /* 0xBF88206C */
  .ETHPMM1          /* 0xBF882070 */
  .ETHPMM1CLR       /* 0xBF882074 */
  .ETHPMM1SET       /* 0xBF882078 */
  .ETHPMM1INV       /* 0xBF88207C */
  .ETHPMCS          /* 0xBF882080 */
  .ETHPMCSCLR       /* 0xBF882084 */
  .ETHPMCSSET       /* 0xBF882088 */
  .ETHPMCSINV       /* 0xBF88208C */
  .ETHPMO           /* 0xBF882090 */
  .ETHPMOCLR        /* 0xBF882094 */
  .ETHPMOSET        /* 0xBF882098 */
  .ETHPMOINV        /* 0xBF88209C */
  .ETHRXFC          /* 0xBF8820A0 */
  .ETHRXFCCLR       /* 0xBF8820A4 */
  .ETHRXFCSET       /* 0xBF8820A8 */
  .ETHRXFCINV       /* 0xBF8820AC */
  .ETHRXWM          /* 0xBF8820B0 */
  .ETHRXWMCLR       /* 0xBF8820B4 */
  .ETHRXWMSET       /* 0xBF8820B8 */
  .ETHRXWMINV       /* 0xBF8820BC */
  .ETHIEN           /* 0xBF8820C0 */
  .ETHIENCLR        /* 0xBF8820C4 */
  .ETHIENSET        /* 0xBF8820C8 */
  .ETHIENINV        /* 0xBF8820CC */
  .ETHIRQ           /* 0xBF8820D0 */
  .ETHIRQCLR        /* 0xBF8820D4 */
  .ETHIRQSET        /* 0xBF8820D8 */
  .ETHIRQINV        /* 0xBF8820DC */
  .ETHSTAT          /* 0xBF8820E0 */
  .ETHSTATCLR       /* 0xBF8820E4 */
  .ETHSTATSET       /* 0xBF8820E8 */
  .ETHSTATINV       /* 0xBF8820EC */
  .ETHRXOVFLOW      /* 0xBF882100 */
  .ETHRXOVFLOWCLR   /* 0xBF882104 */
  .ETHRXOVFLOWSET   /* 0xBF882108 */
  .ETHRXOVFLOWINV   /* 0xBF88210C */
  .ETHFRMTXOK       /* 0xBF882110 */
  .ETHFRMTXOKCLR    /* 0xBF882114 */
  .ETHFRMTXOKSET    /* 0xBF882118 */
  .ETHFRMTXOKINV    /* 0xBF88211C */
  .ETHSCOLFRM       /* 0xBF882120 */
  .ETHSCOLFRMCLR    /* 0xBF882124 */
  .ETHSCOLFRMSET    /* 0xBF882128 */
  .ETHSCOLFRMINV    /* 0xBF88212C */
  .ETHMCOLFRM       /* 0xBF882130 */
  .ETHMCOLFRMCLR    /* 0xBF882134 */
  .ETHMCOLFRMSET    /* 0xBF882138 */
  .ETHMCOLFRMINV    /* 0xBF88213C */
  .ETHFRMRXOK       /* 0xBF882140 */
  .ETHFRMRXOKCLR    /* 0xBF882144 */
  .ETHFRMRXOKSET    /* 0xBF882148 */
  .ETHFRMRXOKINV    /* 0xBF88214C */
  .ETHFCSERR        /* 0xBF882150 */
  .ETHFCSERRCLR     /* 0xBF882154 */
  .ETHFCSERRSET     /* 0xBF882158 */
  .ETHFCSERRINV     /* 0xBF88215C */
  .ETHALGNERR       /* 0xBF882160 */
  .ETHALGNERRCLR    /* 0xBF882164 */
  .ETHALGNERRSET    /* 0xBF882168 */
  .ETHALGNERRINV    /* 0xBF88216C */
  .EMAC1CFG1        /* 0xBF882200 */
  .EMACxCFG1        /* 0xBF882200 */
  .EMAC1CFG1CLR     /* 0xBF882204 */
  .EMACxCFG1CLR     /* 0xBF882204 */
  .EMAC1CFG1SET     /* 0xBF882208 */
  .EMACxCFG1SET     /* 0xBF882208 */
  .EMAC1CFG1INV     /* 0xBF88220C */
  .EMACxCFG1INV     /* 0xBF88220C */
  .EMAC1CFG2        /* 0xBF882210 */
  .EMACxCFG2        /* 0xBF882210 */
  .EMAC1CFG2CLR     /* 0xBF882214 */
  .EMACxCFG2CLR     /* 0xBF882214 */
  .EMAC1CFG2SET     /* 0xBF882218 */
  .EMACxCFG2SET     /* 0xBF882218 */
  .EMAC1CFG2INV     /* 0xBF88221C */
  .EMACxCFG2INV     /* 0xBF88221C */
  .EMAC1IPGT        /* 0xBF882220 */
  .EMACxIPGT        /* 0xBF882220 */
  .EMAC1IPGTCLR     /* 0xBF882224 */
  .EMACxIPGTCLR     /* 0xBF882224 */
  .EMAC1IPGTSET     /* 0xBF882228 */
  .EMACxIPGTSET     /* 0xBF882228 */
  .EMAC1IPGTINV     /* 0xBF88222C */
  .EMACxIPGTINV     /* 0xBF88222C */
  .EMAC1IPGR        /* 0xBF882230 */
  .EMACxIPGR        /* 0xBF882230 */
  .EMAC1IPGRCLR     /* 0xBF882234 */
  .EMACxIPGRCLR     /* 0xBF882234 */
  .EMAC1IPGRSET     /* 0xBF882238 */
  .EMACxIPGRSET     /* 0xBF882238 */
  .EMAC1IPGRINV     /* 0xBF88223C */
  .EMACxIPGRINV     /* 0xBF88223C */
  .EMAC1CLRT        /* 0xBF882240 */
  .EMACxCLRT        /* 0xBF882240 */
  .EMAC1CLRTCLR     /* 0xBF882244 */
  .EMACxCLRTCLR     /* 0xBF882244 */
  .EMAC1CLRTSET     /* 0xBF882248 */
  .EMACxCLRTSET     /* 0xBF882248 */
  .EMAC1CLRTINV     /* 0xBF88224C */
  .EMACxCLRTINV     /* 0xBF88224C */
  .EMAC1MAXF        /* 0xBF882250 */
  .EMACxMAXF        /* 0xBF882250 */
  .EMAC1MAXFCLR     /* 0xBF882254 */
  .EMACxMAXFCLR     /* 0xBF882254 */
  .EMAC1MAXFSET     /* 0xBF882258 */
  .EMACxMAXFSET     /* 0xBF882258 */
  .EMAC1MAXFINV     /* 0xBF88225C */
  .EMACxMAXFINV     /* 0xBF88225C */
  .EMAC1SUPP        /* 0xBF882260 */
  .EMACxSUPP        /* 0xBF882260 */
  .EMAC1SUPPCLR     /* 0xBF882264 */
  .EMACxSUPPCLR     /* 0xBF882264 */
  .EMAC1SUPPSET     /* 0xBF882268 */
  .EMACxSUPPSET     /* 0xBF882268 */
  .EMAC1SUPPINV     /* 0xBF88226C */
  .EMACxSUPPINV     /* 0xBF88226C */
  .EMAC1TEST        /* 0xBF882270 */
  .EMACxTEST        /* 0xBF882270 */
  .EMAC1TESTCLR     /* 0xBF882274 */
  .EMACxTESTCLR     /* 0xBF882274 */
  .EMAC1TESTSET     /* 0xBF882278 */
  .EMACxTESTSET     /* 0xBF882278 */
  .EMAC1TESTINV     /* 0xBF88227C */
  .EMACxTESTINV     /* 0xBF88227C */
  .EMAC1MCFG        /* 0xBF882280 */
  .EMACxMCFG        /* 0xBF882280 */
  .EMAC1MCFGCLR     /* 0xBF882284 */
  .EMACxMCFGCLR     /* 0xBF882284 */
  .EMAC1MCFGSET     /* 0xBF882288 */
  .EMACxMCFGSET     /* 0xBF882288 */
  .EMAC1MCFGINV     /* 0xBF88228C */
  .EMACxMCFGINV     /* 0xBF88228C */
  .EMAC1MCMD        /* 0xBF882290 */
  .EMACxMCMD        /* 0xBF882290 */
  .EMAC1MCMDCLR     /* 0xBF882294 */
  .EMACxMCMDCLR     /* 0xBF882294 */
  .EMAC1MCMDSET     /* 0xBF882298 */
  .EMACxMCMDSET     /* 0xBF882298 */
  .EMAC1MCMDINV     /* 0xBF88229C */
  .EMACxMCMDINV     /* 0xBF88229C */
  .EMAC1MADR        /* 0xBF8822A0 */
  .EMACxMADR        /* 0xBF8822A0 */
  .EMAC1MADRCLR     /* 0xBF8822A4 */
  .EMACxMADRCLR     /* 0xBF8822A4 */
  .EMAC1MADRSET     /* 0xBF8822A8 */
  .EMACxMADRSET     /* 0xBF8822A8 */
  .EMAC1MADRINV     /* 0xBF8822AC */
  .EMACxMADRINV     /* 0xBF8822AC */
  .EMAC1MWTD        /* 0xBF8822B0 */
  .EMACxMWTD        /* 0xBF8822B0 */
  .EMAC1MWTDCLR     /* 0xBF8822B4 */
  .EMACxMWTDCLR     /* 0xBF8822B4 */
  .EMAC1MWTDSET     /* 0xBF8822B8 */
  .EMACxMWTDSET     /* 0xBF8822B8 */
  .EMAC1MWTDINV     /* 0xBF8822BC */
  .EMACxMWTDINV     /* 0xBF8822BC */
  .EMAC1MRDD        /* 0xBF8822C0 */
  .EMACxMRDD        /* 0xBF8822C0 */
  .EMAC1MRDDCLR     /* 0xBF8822C4 */
  .EMACxMRDDCLR     /* 0xBF8822C4 */
  .EMAC1MRDDSET     /* 0xBF8822C8 */
  .EMACxMRDDSET     /* 0xBF8822C8 */
  .EMAC1MRDDINV     /* 0xBF8822CC */
  .EMACxMRDDINV     /* 0xBF8822CC */
  .EMAC1MIND        /* 0xBF8822D0 */
  .EMACxMIND        /* 0xBF8822D0 */
  .EMAC1MINDCLR     /* 0xBF8822D4 */
  .EMACxMINDCLR     /* 0xBF8822D4 */
  .EMAC1MINDSET     /* 0xBF8822D8 */
  .EMACxMINDSET     /* 0xBF8822D8 */
  .EMAC1MINDINV     /* 0xBF8822DC */
  .EMACxMINDINV     /* 0xBF8822DC */
  .EMAC1SA0         /* 0xBF882300 */
  .EMACxSA0         /* 0xBF882300 */
  .EMAC1SA0CLR      /* 0xBF882304 */
  .EMACxSA0CLR      /* 0xBF882304 */
  .EMAC1SA0SET      /* 0xBF882308 */
  .EMACxSA0SET      /* 0xBF882308 */
  .EMAC1SA0INV      /* 0xBF88230C */
  .EMACxSA0INV      /* 0xBF88230C */
  .EMAC1SA1         /* 0xBF882310 */
  .EMACxSA1         /* 0xBF882310 */
  .EMAC1SA1CLR      /* 0xBF882314 */
  .EMACxSA1CLR      /* 0xBF882314 */
  .EMAC1SA1SET      /* 0xBF882318 */
  .EMACxSA1SET      /* 0xBF882318 */
  .EMAC1SA1INV      /* 0xBF88231C */
  .EMACxSA1INV      /* 0xBF88231C */
  .EMAC1SA2         /* 0xBF882320 */
  .EMACxSA2         /* 0xBF882320 */
  .EMAC1SA2CLR      /* 0xBF882324 */
  .EMACxSA2CLR      /* 0xBF882324 */
  .EMAC1SA2SET      /* 0xBF882328 */
  .EMACxSA2SET      /* 0xBF882328 */
  .EMAC1SA2INV      /* 0xBF88232C */
  .EMACxSA2INV      /* 0xBF88232C */
  .USBCRCON         /* 0xBF884000 */
  .PRECON           /* 0xBF8E0000 */
  .PRECONCLR        /* 0xBF8E0004 */
  .PRECONSET        /* 0xBF8E0008 */
  .PRECONINV        /* 0xBF8E000C */
  .PRESTAT          /* 0xBF8E0010 */
  .PRESTATCLR       /* 0xBF8E0014 */
  .PRESTATSET       /* 0xBF8E0018 */
  .PRESTATINV       /* 0xBF8E001C */
  .EBICS0           /* 0xBF8E1014 */
  .EBICS1           /* 0xBF8E1018 */
  .EBICS2           /* 0xBF8E101C */
  .EBICS3           /* 0xBF8E1020 */
  .EBIMSK0          /* 0xBF8E1054 */
  .EBIMSK1          /* 0xBF8E1058 */
  .EBIMSK2          /* 0xBF8E105C */
  .EBIMSK3          /* 0xBF8E1060 */
  .EBISMT0          /* 0xBF8E1094 */
  .EBISMT1          /* 0xBF8E1098 */
  .EBISMT2          /* 0xBF8E109C */
  .EBIFTRPD         /* 0xBF8E10A0 */
  .EBISMCON         /* 0xBF8E10A4 */
  .SQI1XCON1        /* 0xBF8E2000 */
  .SQI1XCON2        /* 0xBF8E2004 */
  .SQI1CFG          /* 0xBF8E2008 */
  .SQI1CON          /* 0xBF8E200C */
