HomuraVehicle/homuraLib_v2/machine/device/p32mz2048efg100_forVC.c
  .SQI1CLKCON       /* 0xBF8E2010 */
  .SQI1CMDTHR       /* 0xBF8E2014 */
  .SQI1INTTHR       /* 0xBF8E2018 */
  .SQI1INTEN        /* 0xBF8E201C */
  .SQI1INTSTAT      /* 0xBF8E2020 */
  .SQI1TXDATA       /* 0xBF8E2024 */
  .SQI1RXDATA       /* 0xBF8E2028 */
  .SQI1STAT1        /* 0xBF8E202C */
  .SQI1STAT2        /* 0xBF8E2030 */
  .SQI1BDCON        /* 0xBF8E2034 */
  .SQI1BDCURADD     /* 0xBF8E2038 */
  .SQI1BDBASEADD    /* 0xBF8E2040 */
  .SQI1BDSTAT       /* 0xBF8E2044 */
  .SQI1BDPOLLCON    /* 0xBF8E2048 */
  .SQI1BDTXDSTAT    /* 0xBF8E204C */
  .SQI1BDRXDSTAT    /* 0xBF8E2050 */
  .SQI1THR          /* 0xBF8E2054 */
  .SQI1INTSIGEN     /* 0xBF8E2058 */
  .SQI1TAPCON       /* 0xBF8E205C */
  .SQI1MEMSTAT      /* 0xBF8E2060 */
  .SQI1XCON3        /* 0xBF8E2064 */
  .SQI1XCON4        /* 0xBF8E2068 */
  .USBCSR0          /* 0xBF8E3000 */
  .USBCSR1          /* 0xBF8E3004 */
  .USBCSR2          /* 0xBF8E3008 */
  .USBCSR3          /* 0xBF8E300C */
  .USBIENCSR0       /* 0xBF8E3010 */
  .USBIENCSR1       /* 0xBF8E3014 */
  .USBIENCSR2       /* 0xBF8E3018 */
  .USBIENCSR3       /* 0xBF8E301C */
  .USBFIFO0         /* 0xBF8E3020 */
  .USBFIFO1         /* 0xBF8E3024 */
  .USBFIFO2         /* 0xBF8E3028 */
  .USBFIFO3         /* 0xBF8E302C */
  .USBFIFO4         /* 0xBF8E3030 */
  .USBFIFO5         /* 0xBF8E3034 */
  .USBFIFO6         /* 0xBF8E3038 */
  .USBFIFO7         /* 0xBF8E303C */
  .USBOTG           /* 0xBF8E3060 */
  .USBFIFOA         /* 0xBF8E3064 */
  .USBHWVER         /* 0xBF8E306C */
  .USBINFO          /* 0xBF8E3078 */
  .USBEOFRST        /* 0xBF8E307C */
  .USBE0TXA         /* 0xBF8E3080 */
  .USBE0RXA         /* 0xBF8E3084 */
  .USBE1TXA         /* 0xBF8E3088 */
  .USBE1RXA         /* 0xBF8E308C */
  .USBE2TXA         /* 0xBF8E3090 */
  .USBE2RXA         /* 0xBF8E3094 */
  .USBE3TXA         /* 0xBF8E3098 */
  .USBE3RXA         /* 0xBF8E309C */
  .USBE4TXA         /* 0xBF8E30A0 */
  .USBE4RXA         /* 0xBF8E30A4 */
  .USBE5TXA         /* 0xBF8E30A8 */
  .USBE5RXA         /* 0xBF8E30AC */
  .USBE6TXA         /* 0xBF8E30B0 */
  .USBE6RXA         /* 0xBF8E30B4 */
  .USBE7TXA         /* 0xBF8E30B8 */
  .USBE7RXA         /* 0xBF8E30BC */
  .USBE0CSR0        /* 0xBF8E3100 */
  .USBE0CSR2        /* 0xBF8E3108 */
  .USBE0CSR3        /* 0xBF8E310C */
  .USBE1CSR0        /* 0xBF8E3110 */
  .USBE1CSR1        /* 0xBF8E3114 */
  .USBE1CSR2        /* 0xBF8E3118 */
  .USBE1CSR3        /* 0xBF8E311C */
  .USBE2CSR0        /* 0xBF8E3120 */
  .USBE2CSR1        /* 0xBF8E3124 */
  .USBE2CSR2        /* 0xBF8E3128 */
  .USBE2CSR3        /* 0xBF8E312C */
  .USBE3CSR0        /* 0xBF8E3130 */
  .USBE3CSR1        /* 0xBF8E3134 */
  .USBE3CSR2        /* 0xBF8E3138 */
  .USBE3CSR3        /* 0xBF8E313C */
  .USBE4CSR0        /* 0xBF8E3140 */
  .USBE4CSR1        /* 0xBF8E3144 */
  .USBE4CSR2        /* 0xBF8E3148 */
  .USBE4CSR3        /* 0xBF8E314C */
  .USBE5CSR0        /* 0xBF8E3150 */
  .USBE5CSR1        /* 0xBF8E3154 */
  .USBE5CSR2        /* 0xBF8E3158 */
  .USBE5CSR3        /* 0xBF8E315C */
  .USBE6CSR0        /* 0xBF8E3160 */
  .USBE6CSR1        /* 0xBF8E3164 */
  .USBE6CSR2        /* 0xBF8E3168 */
  .USBE6CSR3        /* 0xBF8E316C */
  .USBE7CSR0        /* 0xBF8E3170 */
  .USBE7CSR1        /* 0xBF8E3174 */
  .USBE7CSR2        /* 0xBF8E3178 */
  .USBE7CSR3        /* 0xBF8E317C */
  .USBDMAINT        /* 0xBF8E3200 */
  .USBDMA1C         /* 0xBF8E3204 */
  .USBDMA1A         /* 0xBF8E3208 */
  .USBDMA1N         /* 0xBF8E320C */
  .USBDMA2C         /* 0xBF8E3214 */
  .USBDMA2A         /* 0xBF8E3218 */
  .USBDMA2N         /* 0xBF8E321C */
  .USBDMA3C         /* 0xBF8E3224 */
  .USBDMA3A         /* 0xBF8E3228 */
  .USBDMA3N         /* 0xBF8E322C */
  .USBDMA4C         /* 0xBF8E3234 */
  .USBDMA4A         /* 0xBF8E3238 */
  .USBDMA4N         /* 0xBF8E323C */
  .USBDMA5C         /* 0xBF8E3244 */
  .USBDMA5A         /* 0xBF8E3248 */
  .USBDMA5N         /* 0xBF8E324C */
  .USBDMA6C         /* 0xBF8E3254 */
  .USBDMA6A         /* 0xBF8E3258 */
  .USBDMA6N         /* 0xBF8E325C */
  .USBDMA7C         /* 0xBF8E3264 */
  .USBDMA7A         /* 0xBF8E3268 */
  .USBDMA7N         /* 0xBF8E326C */
  .USBDMA8C         /* 0xBF8E3274 */
  .USBDMA8A         /* 0xBF8E3278 */
  .USBDMA8N         /* 0xBF8E327C */
  .USBE1RPC         /* 0xBF8E3304 */
  .USBE2RPC         /* 0xBF8E3308 */
  .USBE3RPC         /* 0xBF8E330C */
  .USBE4RPC         /* 0xBF8E3310 */
  .USBE5RPC         /* 0xBF8E3314 */
  .USBE6RPC         /* 0xBF8E3318 */
  .USBE7RPC         /* 0xBF8E331C */
  .USBDPBFD         /* 0xBF8E3340 */
  .USBTMCON1        /* 0xBF8E3344 */
  .USBTMCON2        /* 0xBF8E3348 */
  .USBLPMR1         /* 0xBF8E3360 */
  .USBLMPR2         /* 0xBF8E3364 */
  .USBLPMP2         /* 0xBF8E3364 */
  .RNGVER           /* 0xBF8E6000 */
  .RNGCON           /* 0xBF8E6004 */
  .RNGPOLY1         /* 0xBF8E6008 */
  .RNGPOLY2         /* 0xBF8E600C */
  .RNGNUMGEN1       /* 0xBF8E6010 */
  .RNGNUMGEN2       /* 0xBF8E6014 */
  .RNGSEED1         /* 0xBF8E6018 */
  .RNGSEED2         /* 0xBF8E601C */
  .RNGCNT           /* 0xBF8E6020 */
  .SBFLAG           /* 0xBF8F0510 */
  .SBT0ELOG1        /* 0xBF8F8020 */
  .SBT0ELOG2        /* 0xBF8F8024 */
  .SBT0ECON         /* 0xBF8F8028 */
  .SBT0ECLRS        /* 0xBF8F8030 */
  .SBT0ECLRM        /* 0xBF8F8038 */
  .SBT0REG0         /* 0xBF8F8040 */
  .SBT0RD0          /* 0xBF8F8050 */
  .SBT0WR0          /* 0xBF8F8058 */
  .SBT0REG1         /* 0xBF8F8060 */
  .SBT0RD1          /* 0xBF8F8070 */
  .SBT0WR1          /* 0xBF8F8078 */
  .SBT1ELOG1        /* 0xBF8F8420 */
  .SBT1ELOG2        /* 0xBF8F8424 */
  .SBT1ECON         /* 0xBF8F8428 */
  .SBT1ECLRS        /* 0xBF8F8430 */
  .SBT1ECLRM        /* 0xBF8F8438 */
  .SBT1REG0         /* 0xBF8F8440 */
  .SBT1RD0          /* 0xBF8F8450 */
  .SBT1WR0          /* 0xBF8F8458 */
  .SBT1REG2         /* 0xBF8F8480 */
  .SBT1RD2          /* 0xBF8F8490 */
  .SBT1WR2          /* 0xBF8F8498 */
  .SBT1REG3         /* 0xBF8F84A0 */
  .SBT1RD3          /* 0xBF8F84B0 */
  .SBT1WR3          /* 0xBF8F84B8 */
  .SBT1REG4         /* 0xBF8F84C0 */
  .SBT1RD4          /* 0xBF8F84D0 */
  .SBT1WR4          /* 0xBF8F84D8 */
  .SBT1REG5         /* 0xBF8F84E0 */
  .SBT1RD5          /* 0xBF8F84F0 */
  .SBT1WR5          /* 0xBF8F84F8 */
  .SBT1REG6         /* 0xBF8F8500 */
  .SBT1RD6          /* 0xBF8F8510 */
  .SBT1WR6          /* 0xBF8F8518 */
  .SBT1REG7         /* 0xBF8F8520 */
  .SBT1RD7          /* 0xBF8F8530 */
  .SBT1WR7          /* 0xBF8F8538 */
  .SBT1REG8         /* 0xBF8F8540 */
  .SBT1RD8          /* 0xBF8F8550 */
  .SBT1WR8          /* 0xBF8F8558 */
  .SBT2ELOG1        /* 0xBF8F8820 */
  .SBT2ELOG2        /* 0xBF8F8824 */
  .SBT2ECON         /* 0xBF8F8828 */
  .SBT2ECLRS        /* 0xBF8F8830 */
  .SBT2ECLRM        /* 0xBF8F8838 */
  .SBT2REG0         /* 0xBF8F8840 */
  .SBT2RD0          /* 0xBF8F8850 */
  .SBT2WR0          /* 0xBF8F8858 */
  .SBT2REG1         /* 0xBF8F8860 */
  .SBT2RD1          /* 0xBF8F8870 */
  .SBT2WR1          /* 0xBF8F8878 */
  .SBT2REG2         /* 0xBF8F8880 */
  .SBT2RD2          /* 0xBF8F8890 */
  .SBT2WR2          /* 0xBF8F8898 */
  .SBT3ELOG1        /* 0xBF8F8C20 */
  .SBT3ELOG2        /* 0xBF8F8C24 */
  .SBT3ECON         /* 0xBF8F8C28 */
  .SBT3ECLRS        /* 0xBF8F8C30 */
  .SBT3ECLRM        /* 0xBF8F8C38 */
  .SBT3REG0         /* 0xBF8F8C40 */
  .SBT3RD0          /* 0xBF8F8C50 */
  .SBT3WR0          /* 0xBF8F8C58 */
  .SBT3REG1         /* 0xBF8F8C60 */
  .SBT3RD1          /* 0xBF8F8C70 */
  .SBT3WR1          /* 0xBF8F8C78 */
  .SBT3REG2         /* 0xBF8F8C80 */
  .SBT3RD2          /* 0xBF8F8C90 */
  .SBT3WR2          /* 0xBF8F8C98 */
  .SBT4ELOG1        /* 0xBF8F9020 */
  .SBT4ELOG2        /* 0xBF8F9024 */
  .SBT4ECON         /* 0xBF8F9028 */
  .SBT4ECLRS        /* 0xBF8F9030 */
  .SBT4ECLRM        /* 0xBF8F9038 */
  .SBT4REG0         /* 0xBF8F9040 */
  .SBT4RD0          /* 0xBF8F9050 */
  .SBT4WR0          /* 0xBF8F9058 */
  .SBT4REG2         /* 0xBF8F9080 */
  .SBT4RD2          /* 0xBF8F9090 */
  .SBT4WR2          /* 0xBF8F9098 */
  .SBT5ELOG1        /* 0xBF8F9420 */
  .SBT5ELOG2        /* 0xBF8F9424 */
  .SBT5ECON         /* 0xBF8F9428 */
  .SBT5ECLRS        /* 0xBF8F9430 */
  .SBT5ECLRM        /* 0xBF8F9438 */
  .SBT5REG0         /* 0xBF8F9440 */
  .SBT5RD0          /* 0xBF8F9450 */
  .SBT5WR0          /* 0xBF8F9458 */
  .SBT5REG1         /* 0xBF8F9460 */
  .SBT5RD1          /* 0xBF8F9470 */
  .SBT5WR1          /* 0xBF8F9478 */
  .SBT5REG2         /* 0xBF8F9480 */
  .SBT5RD2          /* 0xBF8F9490 */
  .SBT5WR2          /* 0xBF8F9498 */
  .SBT6ELOG1        /* 0xBF8F9820 */
  .SBT6ELOG2        /* 0xBF8F9824 */
  .SBT6ECON         /* 0xBF8F9828 */
  .SBT6ECLRS        /* 0xBF8F9830 */
  .SBT6ECLRM        /* 0xBF8F9838 */
  .SBT6REG0         /* 0xBF8F9840 */
  .SBT6RD0          /* 0xBF8F9850 */
  .SBT6WR0          /* 0xBF8F9858 */
  .SBT6REG1         /* 0xBF8F9860 */
  .SBT6RD1          /* 0xBF8F9870 */
  .SBT6WR1          /* 0xBF8F9878 */
  .SBT7ELOG1        /* 0xBF8F9C20 */
  .SBT7ELOG2        /* 0xBF8F9C24 */
  .SBT7ECON         /* 0xBF8F9C28 */
  .SBT7ECLRS        /* 0xBF8F9C30 */
  .SBT7ECLRM        /* 0xBF8F9C38 */
  .SBT7REG0         /* 0xBF8F9C40 */
  .SBT7RD0          /* 0xBF8F9C50 */
  .SBT7WR0          /* 0xBF8F9C58 */
  .SBT7REG1         /* 0xBF8F9C60 */
  .SBT7RD1          /* 0xBF8F9C70 */
  .SBT7WR1          /* 0xBF8F9C78 */
  .SBT8ELOG1        /* 0xBF8FA020 */
  .SBT8ELOG2        /* 0xBF8FA024 */
  .SBT8ECON         /* 0xBF8FA028 */
  .SBT8ECLRS        /* 0xBF8FA030 */
  .SBT8ECLRM        /* 0xBF8FA038 */
  .SBT8REG0         /* 0xBF8FA040 */
  .SBT8RD0          /* 0xBF8FA050 */
  .SBT8WR0          /* 0xBF8FA058 */
  .SBT8REG1         /* 0xBF8FA060 */
  .SBT8RD1          /* 0xBF8FA070 */
  .SBT8WR1          /* 0xBF8FA078 */
  .SBT9ELOG1        /* 0xBF8FA420 */
  .SBT9ELOG2        /* 0xBF8FA424 */
  .SBT9ECON         /* 0xBF8FA428 */
  .SBT9ECLRS        /* 0xBF8FA430 */
  .SBT9ECLRM        /* 0xBF8FA438 */
  .SBT9REG0         /* 0xBF8FA440 */
  .SBT9RD0          /* 0xBF8FA450 */
  .SBT9WR0          /* 0xBF8FA458 */
  .SBT9REG1         /* 0xBF8FA460 */
  .SBT9RD1          /* 0xBF8FA470 */
  .SBT9WR1          /* 0xBF8FA478 */
  .SBT10ELOG1       /* 0xBF8FA820 */
  .SBT10ELOG2       /* 0xBF8FA824 */
  .SBT10ECON        /* 0xBF8FA828 */
  .SBT10ECLRS       /* 0xBF8FA830 */
  .SBT10ECLRM       /* 0xBF8FA838 */
  .SBT10REG0        /* 0xBF8FA840 */
  .SBT10RD0         /* 0xBF8FA850 */
  .SBT10WR0         /* 0xBF8FA858 */
  .SBT11ELOG1       /* 0xBF8FAC20 */
  .SBT11ELOG2       /* 0xBF8FAC24 */
  .SBT11ECON        /* 0xBF8FAC28 */
  .SBT11ECLRS       /* 0xBF8FAC30 */
  .SBT11ECLRM       /* 0xBF8FAC38 */
  .SBT11REG0        /* 0xBF8FAC40 */
  .SBT11RD0         /* 0xBF8FAC50 */
  .SBT11WR0         /* 0xBF8FAC58 */
  .SBT11REG1        /* 0xBF8FAC60 */
  .SBT11RD1         /* 0xBF8FAC70 */
  .SBT11WR1         /* 0xBF8FAC78 */
  .SBT12ELOG1       /* 0xBF8FB020 */
  .SBT12ELOG2       /* 0xBF8FB024 */
  .SBT12ECON        /* 0xBF8FB028 */
  .SBT12ECLRS       /* 0xBF8FB030 */
  .SBT12ECLRM       /* 0xBF8FB038 */
  .SBT12REG0        /* 0xBF8FB040 */
  .SBT12RD0         /* 0xBF8FB050 */
  .SBT12WR0         /* 0xBF8FB058 */
  .SBT13ELOG1       /* 0xBF8FB420 */
  .SBT13ELOG2       /* 0xBF8FB424 */
  .SBT13ECON        /* 0xBF8FB428 */
  .SBT13ECLRS       /* 0xBF8FB430 */
  .SBT13ECLRM       /* 0xBF8FB438 */
  .SBT13REG0        /* 0xBF8FB440 */
  .SBT13RD0         /* 0xBF8FB450 */
  .SBT13WR0         /* 0xBF8FB458 */
  .DEVCFG3          /* 0xBFC0FFC0 */
  .DEVCFG2          /* 0xBFC0FFC4 */
  .DEVCFG1          /* 0xBFC0FFC8 */
  .DEVCFG0          /* 0xBFC0FFCC */
  .DEVCP3           /* 0xBFC0FFD0 */
  .DEVCP2           /* 0xBFC0FFD4 */
  .DEVCP1           /* 0xBFC0FFD8 */
  .DEVCP0           /* 0xBFC0FFDC */
  .DEVSIGN3         /* 0xBFC0FFE0 */
  .DEVSIGN2         /* 0xBFC0FFE4 */
  .DEVSIGN1         /* 0xBFC0FFE8 */
  .DEVSIGN0         /* 0xBFC0FFEC */
  .SEQ3             /* 0xBFC0FFF0 */
  .SEQ2             /* 0xBFC0FFF4 */
  .SEQ1             /* 0xBFC0FFF8 */
  .SEQ0             /* 0xBFC0FFFC */
  .DEVSN0           /* 0xBFC54020 */
  .DEVSN1           /* 0xBFC54024 */
  .ADEVCFG3         /* 0xBFC0FF40 */
  .ADEVCFG2         /* 0xBFC0FF44 */
  .ADEVCFG1         /* 0xBFC0FF48 */
  .ADEVCFG0         /* 0xBFC0FF4C */
  .ADEVCP3          /* 0xBFC0FF50 */
  .ADEVCP2          /* 0xBFC0FF54 */
  .ADEVCP1          /* 0xBFC0FF58 */
  .ADEVCP0          /* 0xBFC0FF5C */
  .ADEVSIGN3        /* 0xBFC0FF60 */
  .ADEVSIGN2        /* 0xBFC0FF64 */
  .ADEVSIGN1        /* 0xBFC0FF68 */
  .ADEVSIGN0        /* 0xBFC0FF6C */
  .ASEQ3            /* 0xBFC0FF70 */
  .ASEQ2            /* 0xBFC0FF74 */
  .ASEQ1            /* 0xBFC0FF78 */
  .ASEQ0            /* 0xBFC0FF7C */
  .AUBADEVCFG3      /* 0xBFC2FF40 */
  .AUBADEVCFG2      /* 0xBFC2FF44 */
  .AUBADEVCFG1      /* 0xBFC2FF48 */
  .AUBADEVCFG0      /* 0xBFC2FF4C */
  .AUBADEVCP3       /* 0xBFC2FF50 */
  .AUBADEVCP2       /* 0xBFC2FF54 */
  .AUBADEVCP1       /* 0xBFC2FF58 */
  .AUBADEVCP0       /* 0xBFC2FF5C */
  .AUBADEVSIGN3     /* 0xBFC2FF60 */
  .AUBADEVSIGN2     /* 0xBFC2FF64 */
  .AUBADEVSIGN1     /* 0xBFC2FF68 */
  .AUBADEVSIGN0     /* 0xBFC2FF6C */
  .AUBASEQ3         /* 0xBFC2FF70 */
  .AUBASEQ2         /* 0xBFC2FF74 */
  .AUBASEQ1         /* 0xBFC2FF78 */
  .AUBASEQ0         /* 0xBFC2FF7C */
  .UBADEVCFG3       /* 0xBFC2FFC0 */
  .UBADEVCFG2       /* 0xBFC2FFC4 */
  .UBADEVCFG1       /* 0xBFC2FFC8 */
  .UBADEVCFG0       /* 0xBFC2FFCC */
  .UBADEVCP3        /* 0xBFC2FFD0 */
  .UBADEVCP2        /* 0xBFC2FFD4 */
  .UBADEVCP1        /* 0xBFC2FFD8 */
  .UBADEVCP0        /* 0xBFC2FFDC */
  .UBADEVSIGN3      /* 0xBFC2FFE0 */
  .UBADEVSIGN2      /* 0xBFC2FFE4 */
  .UBADEVSIGN1      /* 0xBFC2FFE8 */
  .UBADEVSIGN0      /* 0xBFC2FFEC */
  .UBASEQ3          /* 0xBFC2FFF0 */
  .UBASEQ2          /* 0xBFC2FFF4 */
  .UBASEQ1          /* 0xBFC2FFF8 */
  .UBASEQ0          /* 0xBFC2FFFC */
  .ABF1DEVCFG3      /* 0xBFC4FF40 */
  .ABF1DEVCFG2      /* 0xBFC4FF44 */
  .ABF1DEVCFG1      /* 0xBFC4FF48 */
  .ABF1DEVCFG0      /* 0xBFC4FF4C */
  .ABF1DEVCP3       /* 0xBFC4FF50 */
  .ABF1DEVCP2       /* 0xBFC4FF54 */
  .ABF1DEVCP1       /* 0xBFC4FF58 */
  .ABF1DEVCP0       /* 0xBFC4FF5C */
  .ABF1DEVSIGN3     /* 0xBFC4FF60 */
  .ABF1DEVSIGN2     /* 0xBFC4FF64 */
  .ABF1DEVSIGN1     /* 0xBFC4FF68 */
  .ABF1DEVSIGN0     /* 0xBFC4FF6C */
  .ABF1SEQ3         /* 0xBFC4FF70 */
  .ABF1SEQ2         /* 0xBFC4FF74 */
  .ABF1SEQ1         /* 0xBFC4FF78 */
  .ABF1SEQ0         /* 0xBFC4FF7C */
  .BF1DEVCFG3       /* 0xBFC4FFC0 */
  .BF1DEVCFG2       /* 0xBFC4FFC4 */
  .BF1DEVCFG1       /* 0xBFC4FFC8 */
  .BF1DEVCFG0       /* 0xBFC4FFCC */
  .BF1DEVCP3        /* 0xBFC4FFD0 */
  .BF1DEVCP2        /* 0xBFC4FFD4 */
  .BF1DEVCP1        /* 0xBFC4FFD8 */
  .BF1DEVCP0        /* 0xBFC4FFDC */
  .BF1DEVSIGN3      /* 0xBFC4FFE0 */
  .BF1DEVSIGN2      /* 0xBFC4FFE4 */
  .BF1DEVSIGN1      /* 0xBFC4FFE8 */
  .BF1DEVSIGN0      /* 0xBFC4FFEC */
  .BF1SEQ3          /* 0xBFC4FFF0 */
  .BF1SEQ2          /* 0xBFC4FFF4 */
  .BF1SEQ1          /* 0xBFC4FFF8 */
  .BF1SEQ0          /* 0xBFC4FFFC */
  .ABF2DEVCFG3      /* 0xBFC6FF40 */
  .ABF2DEVCFG2      /* 0xBFC6FF44 */
  .ABF2DEVCFG1      /* 0xBFC6FF48 */
  .ABF2DEVCFG0      /* 0xBFC6FF4C */
  .ABF2DEVCP3       /* 0xBFC6FF50 */
  .ABF2DEVCP2       /* 0xBFC6FF54 */
  .ABF2DEVCP1       /* 0xBFC6FF58 */
  .ABF2DEVCP0       /* 0xBFC6FF5C */
  .ABF2DEVSIGN3     /* 0xBFC6FF60 */
  .ABF2DEVSIGN2     /* 0xBFC6FF64 */
  .ABF2DEVSIGN1     /* 0xBFC6FF68 */
  .ABF2DEVSIGN0     /* 0xBFC6FF6C */
  .ABF2SEQ3         /* 0xBFC6FF70 */
  .ABF2SEQ2         /* 0xBFC6FF74 */
  .ABF2SEQ1         /* 0xBFC6FF78 */
  .ABF2SEQ0         /* 0xBFC6FF7C */
  .BF2DEVCFG3       /* 0xBFC6FFC0 */
  .BF2DEVCFG2       /* 0xBFC6FFC4 */
  .BF2DEVCFG1       /* 0xBFC6FFC8 */
  .BF2DEVCFG0       /* 0xBFC6FFCC */
  .BF2DEVCP3        /* 0xBFC6FFD0 */
  .BF2DEVCP2        /* 0xBFC6FFD4 */
  .BF2DEVCP1        /* 0xBFC6FFD8 */
  .BF2DEVCP0        /* 0xBFC6FFDC */
  .BF2DEVSIGN3      /* 0xBFC6FFE0 */
  .BF2DEVSIGN2      /* 0xBFC6FFE4 */
  .BF2DEVSIGN1      /* 0xBFC6FFE8 */
  .BF2DEVSIGN0      /* 0xBFC6FFEC */
  .BF2SEQ3          /* 0xBFC6FFF0 */
  .BF2SEQ2          /* 0xBFC6FFF4 */
  .BF2SEQ1          /* 0xBFC6FFF8 */
  .BF2SEQ0          /* 0xBFC6FFFC */
#else
#error Unknown language!
#endif

//#define _CFGCON_TDOEN_POSITION                   0x00000000
//#define _CFGCON_TDOEN_MASK                       0x00000001
//#define _CFGCON_TDOEN_LENGTH                     0x00000001

//#define _CFGCON_TROEN_POSITION                   0x00000002
//#define _CFGCON_TROEN_MASK                       0x00000004
//#define _CFGCON_TROEN_LENGTH                     0x00000001

//#define _CFGCON_JTAGEN_POSITION                  0x00000003
//#define _CFGCON_JTAGEN_MASK                      0x00000008
//#define _CFGCON_JTAGEN_LENGTH                    0x00000001

//#define _CFGCON_ECCCON_POSITION                  0x00000004
//#define _CFGCON_ECCCON_MASK                      0x00000030
//#define _CFGCON_ECCCON_LENGTH                    0x00000002

//#define _CFGCON_IOANCPN_POSITION                 0x00000007
//#define _CFGCON_IOANCPN_MASK                     0x00000080
//#define _CFGCON_IOANCPN_LENGTH                   0x00000001

//#define _CFGCON_USBSSEN_POSITION                 0x00000008
//#define _CFGCON_USBSSEN_MASK                     0x00000100
//#define _CFGCON_USBSSEN_LENGTH                   0x00000001

