HomuraVehicle/homuraLib_v2/machine/device/p32mz2048efg100_forVC.c
//#define _RCON_BOR_POSITION                       0x00000001
//#define _RCON_BOR_MASK                           0x00000002
//#define _RCON_BOR_LENGTH                         0x00000001

//#define _RCON_IDLE_POSITION                      0x00000002
//#define _RCON_IDLE_MASK                          0x00000004
//#define _RCON_IDLE_LENGTH                        0x00000001

//#define _RCON_SLEEP_POSITION                     0x00000003
//#define _RCON_SLEEP_MASK                         0x00000008
//#define _RCON_SLEEP_LENGTH                       0x00000001

//#define _RCON_WDTO_POSITION                      0x00000004
//#define _RCON_WDTO_MASK                          0x00000010
//#define _RCON_WDTO_LENGTH                        0x00000001

//#define _RCON_DMTO_POSITION                      0x00000005
//#define _RCON_DMTO_MASK                          0x00000020
//#define _RCON_DMTO_LENGTH                        0x00000001

//#define _RCON_SWR_POSITION                       0x00000006
//#define _RCON_SWR_MASK                           0x00000040
//#define _RCON_SWR_LENGTH                         0x00000001

//#define _RCON_EXTR_POSITION                      0x00000007
//#define _RCON_EXTR_MASK                          0x00000080
//#define _RCON_EXTR_LENGTH                        0x00000001

//#define _RCON_CMR_POSITION                       0x00000009
//#define _RCON_CMR_MASK                           0x00000200
//#define _RCON_CMR_LENGTH                         0x00000001

//#define _RCON_BCFGFAIL_POSITION                  0x0000001A
//#define _RCON_BCFGFAIL_MASK                      0x04000000
//#define _RCON_BCFGFAIL_LENGTH                    0x00000001

//#define _RCON_BCFGERR_POSITION                   0x0000001B
//#define _RCON_BCFGERR_MASK                       0x08000000
//#define _RCON_BCFGERR_LENGTH                     0x00000001

//#define _RSWRST_SWRST_POSITION                   0x00000000
//#define _RSWRST_SWRST_MASK                       0x00000001
//#define _RSWRST_SWRST_LENGTH                     0x00000001

//#define _RNMICON_NMICNT_POSITION                 0x00000000
//#define _RNMICON_NMICNT_MASK                     0x0000FFFF
//#define _RNMICON_NMICNT_LENGTH                   0x00000010

//#define _RNMICON_WDTS_POSITION                   0x00000010
//#define _RNMICON_WDTS_MASK                       0x00010000
//#define _RNMICON_WDTS_LENGTH                     0x00000001

//#define _RNMICON_CF_POSITION                     0x00000011
//#define _RNMICON_CF_MASK                         0x00020000
//#define _RNMICON_CF_LENGTH                       0x00000001

//#define _RNMICON_GNMI_POSITION                   0x00000013
//#define _RNMICON_GNMI_MASK                       0x00080000
//#define _RNMICON_GNMI_LENGTH                     0x00000001

//#define _RNMICON_SWNMI_POSITION                  0x00000017
//#define _RNMICON_SWNMI_MASK                      0x00800000
//#define _RNMICON_SWNMI_LENGTH                    0x00000001

//#define _RNMICON_WDTO_POSITION                   0x00000018
//#define _RNMICON_WDTO_MASK                       0x01000000
//#define _RNMICON_WDTO_LENGTH                     0x00000001

//#define _RNMICON_DMTO_POSITION                   0x00000019
//#define _RNMICON_DMTO_MASK                       0x02000000
//#define _RNMICON_DMTO_LENGTH                     0x00000001

//#define _PWRCON_VREGS_POSITION                   0x00000000
//#define _PWRCON_VREGS_MASK                       0x00000001
//#define _PWRCON_VREGS_LENGTH                     0x00000001

//#define _REFO1CON_ROSEL_POSITION                 0x00000000
//#define _REFO1CON_ROSEL_MASK                     0x0000000F
//#define _REFO1CON_ROSEL_LENGTH                   0x00000004

//#define _REFO1CON_ACTIVE_POSITION                0x00000008
//#define _REFO1CON_ACTIVE_MASK                    0x00000100
//#define _REFO1CON_ACTIVE_LENGTH                  0x00000001

//#define _REFO1CON_DIVSWEN_POSITION               0x00000009
//#define _REFO1CON_DIVSWEN_MASK                   0x00000200
//#define _REFO1CON_DIVSWEN_LENGTH                 0x00000001

//#define _REFO1CON_RSLP_POSITION                  0x0000000B
//#define _REFO1CON_RSLP_MASK                      0x00000800
//#define _REFO1CON_RSLP_LENGTH                    0x00000001

//#define _REFO1CON_OE_POSITION                    0x0000000C
//#define _REFO1CON_OE_MASK                        0x00001000
//#define _REFO1CON_OE_LENGTH                      0x00000001

//#define _REFO1CON_SIDL_POSITION                  0x0000000D
//#define _REFO1CON_SIDL_MASK                      0x00002000
//#define _REFO1CON_SIDL_LENGTH                    0x00000001

//#define _REFO1CON_ON_POSITION                    0x0000000F
//#define _REFO1CON_ON_MASK                        0x00008000
//#define _REFO1CON_ON_LENGTH                      0x00000001

//#define _REFO1CON_RODIV_POSITION                 0x00000010
//#define _REFO1CON_RODIV_MASK                     0x7FFF0000
//#define _REFO1CON_RODIV_LENGTH                   0x0000000F

//#define _REFO1TRIM_ROTRIM_POSITION               0x00000017
//#define _REFO1TRIM_ROTRIM_MASK                   0xFF800000
//#define _REFO1TRIM_ROTRIM_LENGTH                 0x00000009

//#define _REFO2CON_ROSEL_POSITION                 0x00000000
//#define _REFO2CON_ROSEL_MASK                     0x0000000F
//#define _REFO2CON_ROSEL_LENGTH                   0x00000004

//#define _REFO2CON_ACTIVE_POSITION                0x00000008
//#define _REFO2CON_ACTIVE_MASK                    0x00000100
//#define _REFO2CON_ACTIVE_LENGTH                  0x00000001

//#define _REFO2CON_DIVSWEN_POSITION               0x00000009
//#define _REFO2CON_DIVSWEN_MASK                   0x00000200
//#define _REFO2CON_DIVSWEN_LENGTH                 0x00000001

//#define _REFO2CON_RSLP_POSITION                  0x0000000B
//#define _REFO2CON_RSLP_MASK                      0x00000800
//#define _REFO2CON_RSLP_LENGTH                    0x00000001

//#define _REFO2CON_OE_POSITION                    0x0000000C
//#define _REFO2CON_OE_MASK                        0x00001000
//#define _REFO2CON_OE_LENGTH                      0x00000001

//#define _REFO2CON_SIDL_POSITION                  0x0000000D
//#define _REFO2CON_SIDL_MASK                      0x00002000
//#define _REFO2CON_SIDL_LENGTH                    0x00000001

//#define _REFO2CON_ON_POSITION                    0x0000000F
//#define _REFO2CON_ON_MASK                        0x00008000
//#define _REFO2CON_ON_LENGTH                      0x00000001

