HomuraVehicle/homuraLib_v2/machine/device/p32mz2048efg100_forVC.c
//#define _RPB5R_RPB5R_POSITION                    0x00000000
//#define _RPB5R_RPB5R_MASK                        0x0000000F
//#define _RPB5R_RPB5R_LENGTH                      0x00000004

//#define _RPB6R_RPB6R_POSITION                    0x00000000
//#define _RPB6R_RPB6R_MASK                        0x0000000F
//#define _RPB6R_RPB6R_LENGTH                      0x00000004

//#define _RPB7R_RPB7R_POSITION                    0x00000000
//#define _RPB7R_RPB7R_MASK                        0x0000000F
//#define _RPB7R_RPB7R_LENGTH                      0x00000004

//#define _RPB8R_RPB8R_POSITION                    0x00000000
//#define _RPB8R_RPB8R_MASK                        0x0000000F
//#define _RPB8R_RPB8R_LENGTH                      0x00000004

//#define _RPB9R_RPB9R_POSITION                    0x00000000
//#define _RPB9R_RPB9R_MASK                        0x0000000F
//#define _RPB9R_RPB9R_LENGTH                      0x00000004

//#define _RPB10R_RPB10R_POSITION                  0x00000000
//#define _RPB10R_RPB10R_MASK                      0x0000000F
//#define _RPB10R_RPB10R_LENGTH                    0x00000004

//#define _RPB14R_RPB14R_POSITION                  0x00000000
//#define _RPB14R_RPB14R_MASK                      0x0000000F
//#define _RPB14R_RPB14R_LENGTH                    0x00000004

//#define _RPB15R_RPB15R_POSITION                  0x00000000
//#define _RPB15R_RPB15R_MASK                      0x0000000F
//#define _RPB15R_RPB15R_LENGTH                    0x00000004

//#define _RPC1R_RPC1R_POSITION                    0x00000000
//#define _RPC1R_RPC1R_MASK                        0x0000000F
//#define _RPC1R_RPC1R_LENGTH                      0x00000004

//#define _RPC2R_RPC2R_POSITION                    0x00000000
//#define _RPC2R_RPC2R_MASK                        0x0000000F
//#define _RPC2R_RPC2R_LENGTH                      0x00000004

//#define _RPC3R_RPC3R_POSITION                    0x00000000
//#define _RPC3R_RPC3R_MASK                        0x0000000F
//#define _RPC3R_RPC3R_LENGTH                      0x00000004

//#define _RPC4R_RPC4R_POSITION                    0x00000000
//#define _RPC4R_RPC4R_MASK                        0x0000000F
//#define _RPC4R_RPC4R_LENGTH                      0x00000004

//#define _RPC13R_RPC13R_POSITION                  0x00000000
//#define _RPC13R_RPC13R_MASK                      0x0000000F
//#define _RPC13R_RPC13R_LENGTH                    0x00000004

//#define _RPC14R_RPC14R_POSITION                  0x00000000
//#define _RPC14R_RPC14R_MASK                      0x0000000F
//#define _RPC14R_RPC14R_LENGTH                    0x00000004

//#define _RPD0R_RPD0R_POSITION                    0x00000000
//#define _RPD0R_RPD0R_MASK                        0x0000000F
//#define _RPD0R_RPD0R_LENGTH                      0x00000004

//#define _RPD1R_RPD1R_POSITION                    0x00000000
//#define _RPD1R_RPD1R_MASK                        0x0000000F
//#define _RPD1R_RPD1R_LENGTH                      0x00000004

//#define _RPD2R_RPD2R_POSITION                    0x00000000
//#define _RPD2R_RPD2R_MASK                        0x0000000F
//#define _RPD2R_RPD2R_LENGTH                      0x00000004

//#define _RPD3R_RPD3R_POSITION                    0x00000000
//#define _RPD3R_RPD3R_MASK                        0x0000000F
//#define _RPD3R_RPD3R_LENGTH                      0x00000004

//#define _RPD4R_RPD4R_POSITION                    0x00000000
//#define _RPD4R_RPD4R_MASK                        0x0000000F
//#define _RPD4R_RPD4R_LENGTH                      0x00000004

//#define _RPD5R_RPD5R_POSITION                    0x00000000
//#define _RPD5R_RPD5R_MASK                        0x0000000F
//#define _RPD5R_RPD5R_LENGTH                      0x00000004

//#define _RPD9R_RPD9R_POSITION                    0x00000000
//#define _RPD9R_RPD9R_MASK                        0x0000000F
//#define _RPD9R_RPD9R_LENGTH                      0x00000004

//#define _RPD10R_RPD10R_POSITION                  0x00000000
//#define _RPD10R_RPD10R_MASK                      0x0000000F
//#define _RPD10R_RPD10R_LENGTH                    0x00000004

//#define _RPD11R_RPD11R_POSITION                  0x00000000
//#define _RPD11R_RPD11R_MASK                      0x0000000F
//#define _RPD11R_RPD11R_LENGTH                    0x00000004

//#define _RPD12R_RPD12R_POSITION                  0x00000000
//#define _RPD12R_RPD12R_MASK                      0x0000000F
//#define _RPD12R_RPD12R_LENGTH                    0x00000004

//#define _RPD14R_RPD14R_POSITION                  0x00000000
//#define _RPD14R_RPD14R_MASK                      0x0000000F
//#define _RPD14R_RPD14R_LENGTH                    0x00000004

//#define _RPD15R_RPD15R_POSITION                  0x00000000
//#define _RPD15R_RPD15R_MASK                      0x0000000F
//#define _RPD15R_RPD15R_LENGTH                    0x00000004

//#define _RPE3R_RPE3R_POSITION                    0x00000000
//#define _RPE3R_RPE3R_MASK                        0x0000000F
//#define _RPE3R_RPE3R_LENGTH                      0x00000004

//#define _RPE5R_RPE5R_POSITION                    0x00000000
//#define _RPE5R_RPE5R_MASK                        0x0000000F
//#define _RPE5R_RPE5R_LENGTH                      0x00000004

//#define _RPE8R_RPE8R_POSITION                    0x00000000
//#define _RPE8R_RPE8R_MASK                        0x0000000F
//#define _RPE8R_RPE8R_LENGTH                      0x00000004

//#define _RPE9R_RPE9R_POSITION                    0x00000000
//#define _RPE9R_RPE9R_MASK                        0x0000000F
//#define _RPE9R_RPE9R_LENGTH                      0x00000004

//#define _RPF0R_RPF0R_POSITION                    0x00000000
//#define _RPF0R_RPF0R_MASK                        0x0000000F
//#define _RPF0R_RPF0R_LENGTH                      0x00000004

//#define _RPF1R_RPF1R_POSITION                    0x00000000
//#define _RPF1R_RPF1R_MASK                        0x0000000F
//#define _RPF1R_RPF1R_LENGTH                      0x00000004

//#define _RPF2R_RPF2R_POSITION                    0x00000000
//#define _RPF2R_RPF2R_MASK                        0x0000000F
//#define _RPF2R_RPF2R_LENGTH                      0x00000004

//#define _RPF3R_RPF3R_POSITION                    0x00000000
//#define _RPF3R_RPF3R_MASK                        0x0000000F
//#define _RPF3R_RPF3R_LENGTH                      0x00000004

//#define _RPF4R_RPF4R_POSITION                    0x00000000
//#define _RPF4R_RPF4R_MASK                        0x0000000F
//#define _RPF4R_RPF4R_LENGTH                      0x00000004

//#define _RPF5R_RPF5R_POSITION                    0x00000000
//#define _RPF5R_RPF5R_MASK                        0x0000000F
//#define _RPF5R_RPF5R_LENGTH                      0x00000004

//#define _RPF8R_RPF8R_POSITION                    0x00000000
//#define _RPF8R_RPF8R_MASK                        0x0000000F
//#define _RPF8R_RPF8R_LENGTH                      0x00000004

//#define _RPF12R_RPF12R_POSITION                  0x00000000
//#define _RPF12R_RPF12R_MASK                      0x0000000F
//#define _RPF12R_RPF12R_LENGTH                    0x00000004

//#define _RPF13R_RPF13R_POSITION                  0x00000000
//#define _RPF13R_RPF13R_MASK                      0x0000000F
//#define _RPF13R_RPF13R_LENGTH                    0x00000004

//#define _RPG0R_RPG0R_POSITION                    0x00000000
//#define _RPG0R_RPG0R_MASK                        0x0000000F
//#define _RPG0R_RPG0R_LENGTH                      0x00000004

//#define _RPG1R_RPG1R_POSITION                    0x00000000
//#define _RPG1R_RPG1R_MASK                        0x0000000F
//#define _RPG1R_RPG1R_LENGTH                      0x00000004

