HomuraVehicle/homuraLib_v2/machine/device/p32mz2048efg100_forVC.c
//#define _IFS0_INT2IF_POSITION                    0x0000000D
//#define _IFS0_INT2IF_MASK                        0x00002000
//#define _IFS0_INT2IF_LENGTH                      0x00000001

//#define _IFS0_T3IF_POSITION                      0x0000000E
//#define _IFS0_T3IF_MASK                          0x00004000
//#define _IFS0_T3IF_LENGTH                        0x00000001

//#define _IFS0_IC3EIF_POSITION                    0x0000000F
//#define _IFS0_IC3EIF_MASK                        0x00008000
//#define _IFS0_IC3EIF_LENGTH                      0x00000001

//#define _IFS0_IC3IF_POSITION                     0x00000010
//#define _IFS0_IC3IF_MASK                         0x00010000
//#define _IFS0_IC3IF_LENGTH                       0x00000001

//#define _IFS0_OC3IF_POSITION                     0x00000011
//#define _IFS0_OC3IF_MASK                         0x00020000
//#define _IFS0_OC3IF_LENGTH                       0x00000001

//#define _IFS0_INT3IF_POSITION                    0x00000012
//#define _IFS0_INT3IF_MASK                        0x00040000
//#define _IFS0_INT3IF_LENGTH                      0x00000001

//#define _IFS0_T4IF_POSITION                      0x00000013
//#define _IFS0_T4IF_MASK                          0x00080000
//#define _IFS0_T4IF_LENGTH                        0x00000001

//#define _IFS0_IC4EIF_POSITION                    0x00000014
//#define _IFS0_IC4EIF_MASK                        0x00100000
//#define _IFS0_IC4EIF_LENGTH                      0x00000001

//#define _IFS0_IC4IF_POSITION                     0x00000015
//#define _IFS0_IC4IF_MASK                         0x00200000
//#define _IFS0_IC4IF_LENGTH                       0x00000001

//#define _IFS0_OC4IF_POSITION                     0x00000016
//#define _IFS0_OC4IF_MASK                         0x00400000
//#define _IFS0_OC4IF_LENGTH                       0x00000001

//#define _IFS0_INT4IF_POSITION                    0x00000017
//#define _IFS0_INT4IF_MASK                        0x00800000
//#define _IFS0_INT4IF_LENGTH                      0x00000001

//#define _IFS0_T5IF_POSITION                      0x00000018
//#define _IFS0_T5IF_MASK                          0x01000000
//#define _IFS0_T5IF_LENGTH                        0x00000001

//#define _IFS0_IC5EIF_POSITION                    0x00000019
//#define _IFS0_IC5EIF_MASK                        0x02000000
//#define _IFS0_IC5EIF_LENGTH                      0x00000001

//#define _IFS0_IC5IF_POSITION                     0x0000001A
//#define _IFS0_IC5IF_MASK                         0x04000000
//#define _IFS0_IC5IF_LENGTH                       0x00000001

//#define _IFS0_OC5IF_POSITION                     0x0000001B
//#define _IFS0_OC5IF_MASK                         0x08000000
//#define _IFS0_OC5IF_LENGTH                       0x00000001

//#define _IFS0_T6IF_POSITION                      0x0000001C
//#define _IFS0_T6IF_MASK                          0x10000000
//#define _IFS0_T6IF_LENGTH                        0x00000001

//#define _IFS0_IC6EIF_POSITION                    0x0000001D
//#define _IFS0_IC6EIF_MASK                        0x20000000
//#define _IFS0_IC6EIF_LENGTH                      0x00000001

//#define _IFS0_IC6IF_POSITION                     0x0000001E
//#define _IFS0_IC6IF_MASK                         0x40000000
//#define _IFS0_IC6IF_LENGTH                       0x00000001

//#define _IFS0_OC6IF_POSITION                     0x0000001F
//#define _IFS0_OC6IF_MASK                         0x80000000
//#define _IFS0_OC6IF_LENGTH                       0x00000001

//#define _IFS0_w_POSITION                         0x00000000
//#define _IFS0_w_MASK                             0xFFFFFFFF
//#define _IFS0_w_LENGTH                           0x00000020

//#define _IFS1_T7IF_POSITION                      0x00000000
//#define _IFS1_T7IF_MASK                          0x00000001
//#define _IFS1_T7IF_LENGTH                        0x00000001

//#define _IFS1_IC7EIF_POSITION                    0x00000001
//#define _IFS1_IC7EIF_MASK                        0x00000002
//#define _IFS1_IC7EIF_LENGTH                      0x00000001

//#define _IFS1_IC7IF_POSITION                     0x00000002
//#define _IFS1_IC7IF_MASK                         0x00000004
//#define _IFS1_IC7IF_LENGTH                       0x00000001

//#define _IFS1_OC7IF_POSITION                     0x00000003
//#define _IFS1_OC7IF_MASK                         0x00000008
//#define _IFS1_OC7IF_LENGTH                       0x00000001

//#define _IFS1_T8IF_POSITION                      0x00000004
//#define _IFS1_T8IF_MASK                          0x00000010
//#define _IFS1_T8IF_LENGTH                        0x00000001

//#define _IFS1_IC8EIF_POSITION                    0x00000005
//#define _IFS1_IC8EIF_MASK                        0x00000020
//#define _IFS1_IC8EIF_LENGTH                      0x00000001

//#define _IFS1_IC8IF_POSITION                     0x00000006
//#define _IFS1_IC8IF_MASK                         0x00000040
//#define _IFS1_IC8IF_LENGTH                       0x00000001

//#define _IFS1_OC8IF_POSITION                     0x00000007
//#define _IFS1_OC8IF_MASK                         0x00000080
//#define _IFS1_OC8IF_LENGTH                       0x00000001

//#define _IFS1_T9IF_POSITION                      0x00000008
//#define _IFS1_T9IF_MASK                          0x00000100
//#define _IFS1_T9IF_LENGTH                        0x00000001

//#define _IFS1_IC9EIF_POSITION                    0x00000009
//#define _IFS1_IC9EIF_MASK                        0x00000200
//#define _IFS1_IC9EIF_LENGTH                      0x00000001

//#define _IFS1_IC9IF_POSITION                     0x0000000A
//#define _IFS1_IC9IF_MASK                         0x00000400
//#define _IFS1_IC9IF_LENGTH                       0x00000001

//#define _IFS1_OC9IF_POSITION                     0x0000000B
//#define _IFS1_OC9IF_MASK                         0x00000800
//#define _IFS1_OC9IF_LENGTH                       0x00000001

//#define _IFS1_ADCIF_POSITION                     0x0000000C
//#define _IFS1_ADCIF_MASK                         0x00001000
//#define _IFS1_ADCIF_LENGTH                       0x00000001

