HomuraVehicle/homuraLib_v2/machine/device/p32mz2048efg100_forVC.c
//#define _IFS1_ADCDC1IF_POSITION                  0x0000000E
//#define _IFS1_ADCDC1IF_MASK                      0x00004000
//#define _IFS1_ADCDC1IF_LENGTH                    0x00000001

//#define _IFS1_ADCDC2IF_POSITION                  0x0000000F
//#define _IFS1_ADCDC2IF_MASK                      0x00008000
//#define _IFS1_ADCDC2IF_LENGTH                    0x00000001

//#define _IFS1_ADCDC3IF_POSITION                  0x00000010
//#define _IFS1_ADCDC3IF_MASK                      0x00010000
//#define _IFS1_ADCDC3IF_LENGTH                    0x00000001

//#define _IFS1_ADCDC4IF_POSITION                  0x00000011
//#define _IFS1_ADCDC4IF_MASK                      0x00020000
//#define _IFS1_ADCDC4IF_LENGTH                    0x00000001

//#define _IFS1_ADCDC5IF_POSITION                  0x00000012
//#define _IFS1_ADCDC5IF_MASK                      0x00040000
//#define _IFS1_ADCDC5IF_LENGTH                    0x00000001

//#define _IFS1_ADCDC6IF_POSITION                  0x00000013
//#define _IFS1_ADCDC6IF_MASK                      0x00080000
//#define _IFS1_ADCDC6IF_LENGTH                    0x00000001

//#define _IFS1_ADCDF1IF_POSITION                  0x00000014
//#define _IFS1_ADCDF1IF_MASK                      0x00100000
//#define _IFS1_ADCDF1IF_LENGTH                    0x00000001

//#define _IFS1_ADCDF2IF_POSITION                  0x00000015
//#define _IFS1_ADCDF2IF_MASK                      0x00200000
//#define _IFS1_ADCDF2IF_LENGTH                    0x00000001

//#define _IFS1_ADCDF3IF_POSITION                  0x00000016
//#define _IFS1_ADCDF3IF_MASK                      0x00400000
//#define _IFS1_ADCDF3IF_LENGTH                    0x00000001

//#define _IFS1_ADCDF4IF_POSITION                  0x00000017
//#define _IFS1_ADCDF4IF_MASK                      0x00800000
//#define _IFS1_ADCDF4IF_LENGTH                    0x00000001

//#define _IFS1_ADCDF5IF_POSITION                  0x00000018
//#define _IFS1_ADCDF5IF_MASK                      0x01000000
//#define _IFS1_ADCDF5IF_LENGTH                    0x00000001

//#define _IFS1_ADCDF6IF_POSITION                  0x00000019
//#define _IFS1_ADCDF6IF_MASK                      0x02000000
//#define _IFS1_ADCDF6IF_LENGTH                    0x00000001

//#define _IFS1_ADCFLTIF_POSITION                  0x0000001A
//#define _IFS1_ADCFLTIF_MASK                      0x04000000
//#define _IFS1_ADCFLTIF_LENGTH                    0x00000001

//#define _IFS1_ADCD0IF_POSITION                   0x0000001B
//#define _IFS1_ADCD0IF_MASK                       0x08000000
//#define _IFS1_ADCD0IF_LENGTH                     0x00000001

//#define _IFS1_ADCD1IF_POSITION                   0x0000001C
//#define _IFS1_ADCD1IF_MASK                       0x10000000
//#define _IFS1_ADCD1IF_LENGTH                     0x00000001

//#define _IFS1_ADCD2IF_POSITION                   0x0000001D
//#define _IFS1_ADCD2IF_MASK                       0x20000000
//#define _IFS1_ADCD2IF_LENGTH                     0x00000001

//#define _IFS1_ADCD3IF_POSITION                   0x0000001E
//#define _IFS1_ADCD3IF_MASK                       0x40000000
//#define _IFS1_ADCD3IF_LENGTH                     0x00000001

//#define _IFS1_ADCD4IF_POSITION                   0x0000001F
//#define _IFS1_ADCD4IF_MASK                       0x80000000
//#define _IFS1_ADCD4IF_LENGTH                     0x00000001

//#define _IFS1_w_POSITION                         0x00000000
//#define _IFS1_w_MASK                             0xFFFFFFFF
//#define _IFS1_w_LENGTH                           0x00000020

//#define _IFS2_ADCD5IF_POSITION                   0x00000000
//#define _IFS2_ADCD5IF_MASK                       0x00000001
//#define _IFS2_ADCD5IF_LENGTH                     0x00000001

//#define _IFS2_ADCD6IF_POSITION                   0x00000001
//#define _IFS2_ADCD6IF_MASK                       0x00000002
//#define _IFS2_ADCD6IF_LENGTH                     0x00000001

//#define _IFS2_ADCD7IF_POSITION                   0x00000002
//#define _IFS2_ADCD7IF_MASK                       0x00000004
//#define _IFS2_ADCD7IF_LENGTH                     0x00000001

//#define _IFS2_ADCD8IF_POSITION                   0x00000003
//#define _IFS2_ADCD8IF_MASK                       0x00000008
//#define _IFS2_ADCD8IF_LENGTH                     0x00000001

//#define _IFS2_ADCD9IF_POSITION                   0x00000004
//#define _IFS2_ADCD9IF_MASK                       0x00000010
//#define _IFS2_ADCD9IF_LENGTH                     0x00000001

//#define _IFS2_ADCD10IF_POSITION                  0x00000005
//#define _IFS2_ADCD10IF_MASK                      0x00000020
//#define _IFS2_ADCD10IF_LENGTH                    0x00000001

//#define _IFS2_ADCD11IF_POSITION                  0x00000006
//#define _IFS2_ADCD11IF_MASK                      0x00000040
//#define _IFS2_ADCD11IF_LENGTH                    0x00000001

//#define _IFS2_ADCD12IF_POSITION                  0x00000007
//#define _IFS2_ADCD12IF_MASK                      0x00000080
//#define _IFS2_ADCD12IF_LENGTH                    0x00000001

//#define _IFS2_ADCD13IF_POSITION                  0x00000008
//#define _IFS2_ADCD13IF_MASK                      0x00000100
//#define _IFS2_ADCD13IF_LENGTH                    0x00000001

//#define _IFS2_ADCD14IF_POSITION                  0x00000009
//#define _IFS2_ADCD14IF_MASK                      0x00000200
//#define _IFS2_ADCD14IF_LENGTH                    0x00000001

//#define _IFS2_ADCD15IF_POSITION                  0x0000000A
//#define _IFS2_ADCD15IF_MASK                      0x00000400
//#define _IFS2_ADCD15IF_LENGTH                    0x00000001

//#define _IFS2_ADCD16IF_POSITION                  0x0000000B
//#define _IFS2_ADCD16IF_MASK                      0x00000800
//#define _IFS2_ADCD16IF_LENGTH                    0x00000001

//#define _IFS2_ADCD17IF_POSITION                  0x0000000C
//#define _IFS2_ADCD17IF_MASK                      0x00001000
//#define _IFS2_ADCD17IF_LENGTH                    0x00000001

//#define _IFS2_ADCD18IF_POSITION                  0x0000000D
//#define _IFS2_ADCD18IF_MASK                      0x00002000
//#define _IFS2_ADCD18IF_LENGTH                    0x00000001

//#define _IFS2_ADCD19IF_POSITION                  0x0000000E
//#define _IFS2_ADCD19IF_MASK                      0x00004000
//#define _IFS2_ADCD19IF_LENGTH                    0x00000001

//#define _IFS2_ADCD20IF_POSITION                  0x0000000F
//#define _IFS2_ADCD20IF_MASK                      0x00008000
//#define _IFS2_ADCD20IF_LENGTH                    0x00000001

//#define _IFS2_ADCD21IF_POSITION                  0x00000010
//#define _IFS2_ADCD21IF_MASK                      0x00010000
//#define _IFS2_ADCD21IF_LENGTH                    0x00000001

//#define _IFS2_ADCD22IF_POSITION                  0x00000011
//#define _IFS2_ADCD22IF_MASK                      0x00020000
//#define _IFS2_ADCD22IF_LENGTH                    0x00000001

//#define _IFS2_ADCD23IF_POSITION                  0x00000012
//#define _IFS2_ADCD23IF_MASK                      0x00040000
//#define _IFS2_ADCD23IF_LENGTH                    0x00000001

//#define _IFS2_ADCD24IF_POSITION                  0x00000013
//#define _IFS2_ADCD24IF_MASK                      0x00080000
//#define _IFS2_ADCD24IF_LENGTH                    0x00000001

//#define _IFS2_ADCD25IF_POSITION                  0x00000014
//#define _IFS2_ADCD25IF_MASK                      0x00100000
//#define _IFS2_ADCD25IF_LENGTH                    0x00000001

//#define _IFS2_ADCD26IF_POSITION                  0x00000015
//#define _IFS2_ADCD26IF_MASK                      0x00200000
//#define _IFS2_ADCD26IF_LENGTH                    0x00000001

