HomuraVehicle/homuraLib_v2/machine/device/p32mz2048efg100_forVC.c
//#define _IEC0_T6IE_POSITION                      0x0000001C
//#define _IEC0_T6IE_MASK                          0x10000000
//#define _IEC0_T6IE_LENGTH                        0x00000001

//#define _IEC0_IC6EIE_POSITION                    0x0000001D
//#define _IEC0_IC6EIE_MASK                        0x20000000
//#define _IEC0_IC6EIE_LENGTH                      0x00000001

//#define _IEC0_IC6IE_POSITION                     0x0000001E
//#define _IEC0_IC6IE_MASK                         0x40000000
//#define _IEC0_IC6IE_LENGTH                       0x00000001

//#define _IEC0_OC6IE_POSITION                     0x0000001F
//#define _IEC0_OC6IE_MASK                         0x80000000
//#define _IEC0_OC6IE_LENGTH                       0x00000001

//#define _IEC0_w_POSITION                         0x00000000
//#define _IEC0_w_MASK                             0xFFFFFFFF
//#define _IEC0_w_LENGTH                           0x00000020

//#define _IEC1_T7IE_POSITION                      0x00000000
//#define _IEC1_T7IE_MASK                          0x00000001
//#define _IEC1_T7IE_LENGTH                        0x00000001

//#define _IEC1_IC7EIE_POSITION                    0x00000001
//#define _IEC1_IC7EIE_MASK                        0x00000002
//#define _IEC1_IC7EIE_LENGTH                      0x00000001

//#define _IEC1_IC7IE_POSITION                     0x00000002
//#define _IEC1_IC7IE_MASK                         0x00000004
//#define _IEC1_IC7IE_LENGTH                       0x00000001

//#define _IEC1_OC7IE_POSITION                     0x00000003
//#define _IEC1_OC7IE_MASK                         0x00000008
//#define _IEC1_OC7IE_LENGTH                       0x00000001

//#define _IEC1_T8IE_POSITION                      0x00000004
//#define _IEC1_T8IE_MASK                          0x00000010
//#define _IEC1_T8IE_LENGTH                        0x00000001

//#define _IEC1_IC8EIE_POSITION                    0x00000005
//#define _IEC1_IC8EIE_MASK                        0x00000020
//#define _IEC1_IC8EIE_LENGTH                      0x00000001

//#define _IEC1_IC8IE_POSITION                     0x00000006
//#define _IEC1_IC8IE_MASK                         0x00000040
//#define _IEC1_IC8IE_LENGTH                       0x00000001

//#define _IEC1_OC8IE_POSITION                     0x00000007
//#define _IEC1_OC8IE_MASK                         0x00000080
//#define _IEC1_OC8IE_LENGTH                       0x00000001

//#define _IEC1_T9IE_POSITION                      0x00000008
//#define _IEC1_T9IE_MASK                          0x00000100
//#define _IEC1_T9IE_LENGTH                        0x00000001

//#define _IEC1_IC9EIE_POSITION                    0x00000009
//#define _IEC1_IC9EIE_MASK                        0x00000200
//#define _IEC1_IC9EIE_LENGTH                      0x00000001

//#define _IEC1_IC9IE_POSITION                     0x0000000A
//#define _IEC1_IC9IE_MASK                         0x00000400
//#define _IEC1_IC9IE_LENGTH                       0x00000001

//#define _IEC1_OC9IE_POSITION                     0x0000000B
//#define _IEC1_OC9IE_MASK                         0x00000800
//#define _IEC1_OC9IE_LENGTH                       0x00000001

//#define _IEC1_ADCIE_POSITION                     0x0000000C
//#define _IEC1_ADCIE_MASK                         0x00001000
//#define _IEC1_ADCIE_LENGTH                       0x00000001

//#define _IEC1_ADCDC1IE_POSITION                  0x0000000E
//#define _IEC1_ADCDC1IE_MASK                      0x00004000
//#define _IEC1_ADCDC1IE_LENGTH                    0x00000001

//#define _IEC1_ADCDC2IE_POSITION                  0x0000000F
//#define _IEC1_ADCDC2IE_MASK                      0x00008000
//#define _IEC1_ADCDC2IE_LENGTH                    0x00000001

//#define _IEC1_ADCDC3IE_POSITION                  0x00000010
//#define _IEC1_ADCDC3IE_MASK                      0x00010000
//#define _IEC1_ADCDC3IE_LENGTH                    0x00000001

//#define _IEC1_ADCDC4IE_POSITION                  0x00000011
//#define _IEC1_ADCDC4IE_MASK                      0x00020000
//#define _IEC1_ADCDC4IE_LENGTH                    0x00000001

//#define _IEC1_ADCDC5IE_POSITION                  0x00000012
//#define _IEC1_ADCDC5IE_MASK                      0x00040000
//#define _IEC1_ADCDC5IE_LENGTH                    0x00000001

//#define _IEC1_ADCDC6IE_POSITION                  0x00000013
//#define _IEC1_ADCDC6IE_MASK                      0x00080000
//#define _IEC1_ADCDC6IE_LENGTH                    0x00000001

//#define _IEC1_ADCDF1IE_POSITION                  0x00000014
//#define _IEC1_ADCDF1IE_MASK                      0x00100000
//#define _IEC1_ADCDF1IE_LENGTH                    0x00000001

//#define _IEC1_ADCDF2IE_POSITION                  0x00000015
//#define _IEC1_ADCDF2IE_MASK                      0x00200000
//#define _IEC1_ADCDF2IE_LENGTH                    0x00000001

//#define _IEC1_ADCDF3IE_POSITION                  0x00000016
//#define _IEC1_ADCDF3IE_MASK                      0x00400000
//#define _IEC1_ADCDF3IE_LENGTH                    0x00000001

//#define _IEC1_ADCDF4IE_POSITION                  0x00000017
//#define _IEC1_ADCDF4IE_MASK                      0x00800000
//#define _IEC1_ADCDF4IE_LENGTH                    0x00000001

//#define _IEC1_ADCDF5IE_POSITION                  0x00000018
//#define _IEC1_ADCDF5IE_MASK                      0x01000000
//#define _IEC1_ADCDF5IE_LENGTH                    0x00000001

//#define _IEC1_ADCDF6IE_POSITION                  0x00000019
//#define _IEC1_ADCDF6IE_MASK                      0x02000000
//#define _IEC1_ADCDF6IE_LENGTH                    0x00000001

//#define _IEC1_ADCFLTIE_POSITION                  0x0000001A
//#define _IEC1_ADCFLTIE_MASK                      0x04000000
//#define _IEC1_ADCFLTIE_LENGTH                    0x00000001

//#define _IEC1_ADCD0IE_POSITION                   0x0000001B
//#define _IEC1_ADCD0IE_MASK                       0x08000000
//#define _IEC1_ADCD0IE_LENGTH                     0x00000001

//#define _IEC1_ADCD1IE_POSITION                   0x0000001C
//#define _IEC1_ADCD1IE_MASK                       0x10000000
//#define _IEC1_ADCD1IE_LENGTH                     0x00000001

