HomuraVehicle/homuraLib_v2/machine/device/p32mz2048efg100_forVC.c
//#define _IEC2_ADCD34IE_POSITION                  0x0000001D
//#define _IEC2_ADCD34IE_MASK                      0x20000000
//#define _IEC2_ADCD34IE_LENGTH                    0x00000001

//#define _IEC2_w_POSITION                         0x00000000
//#define _IEC2_w_MASK                             0xFFFFFFFF
//#define _IEC2_w_LENGTH                           0x00000020

//#define _IEC3_ADCD43IE_POSITION                  0x00000006
//#define _IEC3_ADCD43IE_MASK                      0x00000040
//#define _IEC3_ADCD43IE_LENGTH                    0x00000001

//#define _IEC3_ADCD44IE_POSITION                  0x00000007
//#define _IEC3_ADCD44IE_MASK                      0x00000080
//#define _IEC3_ADCD44IE_LENGTH                    0x00000001

//#define _IEC3_CPCIE_POSITION                     0x00000008
//#define _IEC3_CPCIE_MASK                         0x00000100
//#define _IEC3_CPCIE_LENGTH                       0x00000001

//#define _IEC3_CFDCIE_POSITION                    0x00000009
//#define _IEC3_CFDCIE_MASK                        0x00000200
//#define _IEC3_CFDCIE_LENGTH                      0x00000001

//#define _IEC3_SBIE_POSITION                      0x0000000A
//#define _IEC3_SBIE_MASK                          0x00000400
//#define _IEC3_SBIE_LENGTH                        0x00000001

//#define _IEC3_SPI1EIE_POSITION                   0x0000000D
//#define _IEC3_SPI1EIE_MASK                       0x00002000
//#define _IEC3_SPI1EIE_LENGTH                     0x00000001

//#define _IEC3_SPI1RXIE_POSITION                  0x0000000E
//#define _IEC3_SPI1RXIE_MASK                      0x00004000
//#define _IEC3_SPI1RXIE_LENGTH                    0x00000001

//#define _IEC3_SPI1TXIE_POSITION                  0x0000000F
//#define _IEC3_SPI1TXIE_MASK                      0x00008000
//#define _IEC3_SPI1TXIE_LENGTH                    0x00000001

//#define _IEC3_U1EIE_POSITION                     0x00000010
//#define _IEC3_U1EIE_MASK                         0x00010000
//#define _IEC3_U1EIE_LENGTH                       0x00000001

//#define _IEC3_U1RXIE_POSITION                    0x00000011
//#define _IEC3_U1RXIE_MASK                        0x00020000
//#define _IEC3_U1RXIE_LENGTH                      0x00000001

//#define _IEC3_U1TXIE_POSITION                    0x00000012
//#define _IEC3_U1TXIE_MASK                        0x00040000
//#define _IEC3_U1TXIE_LENGTH                      0x00000001

//#define _IEC3_I2C1BIE_POSITION                   0x00000013
//#define _IEC3_I2C1BIE_MASK                       0x00080000
//#define _IEC3_I2C1BIE_LENGTH                     0x00000001

//#define _IEC3_I2C1SIE_POSITION                   0x00000014
//#define _IEC3_I2C1SIE_MASK                       0x00100000
//#define _IEC3_I2C1SIE_LENGTH                     0x00000001

//#define _IEC3_I2C1MIE_POSITION                   0x00000015
//#define _IEC3_I2C1MIE_MASK                       0x00200000
//#define _IEC3_I2C1MIE_LENGTH                     0x00000001

//#define _IEC3_CNAIE_POSITION                     0x00000016
//#define _IEC3_CNAIE_MASK                         0x00400000
//#define _IEC3_CNAIE_LENGTH                       0x00000001

//#define _IEC3_CNBIE_POSITION                     0x00000017
//#define _IEC3_CNBIE_MASK                         0x00800000
//#define _IEC3_CNBIE_LENGTH                       0x00000001

//#define _IEC3_CNCIE_POSITION                     0x00000018
//#define _IEC3_CNCIE_MASK                         0x01000000
//#define _IEC3_CNCIE_LENGTH                       0x00000001

//#define _IEC3_CNDIE_POSITION                     0x00000019
//#define _IEC3_CNDIE_MASK                         0x02000000
//#define _IEC3_CNDIE_LENGTH                       0x00000001

//#define _IEC3_CNEIE_POSITION                     0x0000001A
//#define _IEC3_CNEIE_MASK                         0x04000000
//#define _IEC3_CNEIE_LENGTH                       0x00000001

//#define _IEC3_CNFIE_POSITION                     0x0000001B
//#define _IEC3_CNFIE_MASK                         0x08000000
//#define _IEC3_CNFIE_LENGTH                       0x00000001

//#define _IEC3_CNGIE_POSITION                     0x0000001C
//#define _IEC3_CNGIE_MASK                         0x10000000
//#define _IEC3_CNGIE_LENGTH                       0x00000001

//#define _IEC3_w_POSITION                         0x00000000
//#define _IEC3_w_MASK                             0xFFFFFFFF
//#define _IEC3_w_LENGTH                           0x00000020

//#define _IEC4_PMPIE_POSITION                     0x00000000
//#define _IEC4_PMPIE_MASK                         0x00000001
//#define _IEC4_PMPIE_LENGTH                       0x00000001

//#define _IEC4_PMPEIE_POSITION                    0x00000001
//#define _IEC4_PMPEIE_MASK                        0x00000002
//#define _IEC4_PMPEIE_LENGTH                      0x00000001

//#define _IEC4_CMP1IE_POSITION                    0x00000002
//#define _IEC4_CMP1IE_MASK                        0x00000004
//#define _IEC4_CMP1IE_LENGTH                      0x00000001

//#define _IEC4_CMP2IE_POSITION                    0x00000003
//#define _IEC4_CMP2IE_MASK                        0x00000008
//#define _IEC4_CMP2IE_LENGTH                      0x00000001

//#define _IEC4_USBIE_POSITION                     0x00000004
//#define _IEC4_USBIE_MASK                         0x00000010
//#define _IEC4_USBIE_LENGTH                       0x00000001

//#define _IEC4_USBDMAIE_POSITION                  0x00000005
//#define _IEC4_USBDMAIE_MASK                      0x00000020
//#define _IEC4_USBDMAIE_LENGTH                    0x00000001

//#define _IEC4_DMA0IE_POSITION                    0x00000006
//#define _IEC4_DMA0IE_MASK                        0x00000040
//#define _IEC4_DMA0IE_LENGTH                      0x00000001

//#define _IEC4_DMA1IE_POSITION                    0x00000007
//#define _IEC4_DMA1IE_MASK                        0x00000080
//#define _IEC4_DMA1IE_LENGTH                      0x00000001

//#define _IEC4_DMA2IE_POSITION                    0x00000008
//#define _IEC4_DMA2IE_MASK                        0x00000100
//#define _IEC4_DMA2IE_LENGTH                      0x00000001

//#define _IEC4_DMA3IE_POSITION                    0x00000009
//#define _IEC4_DMA3IE_MASK                        0x00000200
//#define _IEC4_DMA3IE_LENGTH                      0x00000001

