HomuraVehicle/homuraLib_v2/machine/device/p32mz2048efg100_forVC.c
//#define _IEC4_DMA4IE_POSITION                    0x0000000A
//#define _IEC4_DMA4IE_MASK                        0x00000400
//#define _IEC4_DMA4IE_LENGTH                      0x00000001

//#define _IEC4_DMA5IE_POSITION                    0x0000000B
//#define _IEC4_DMA5IE_MASK                        0x00000800
//#define _IEC4_DMA5IE_LENGTH                      0x00000001

//#define _IEC4_DMA6IE_POSITION                    0x0000000C
//#define _IEC4_DMA6IE_MASK                        0x00001000
//#define _IEC4_DMA6IE_LENGTH                      0x00000001

//#define _IEC4_DMA7IE_POSITION                    0x0000000D
//#define _IEC4_DMA7IE_MASK                        0x00002000
//#define _IEC4_DMA7IE_LENGTH                      0x00000001

//#define _IEC4_SPI2EIE_POSITION                   0x0000000E
//#define _IEC4_SPI2EIE_MASK                       0x00004000
//#define _IEC4_SPI2EIE_LENGTH                     0x00000001

//#define _IEC4_SPI2RXIE_POSITION                  0x0000000F
//#define _IEC4_SPI2RXIE_MASK                      0x00008000
//#define _IEC4_SPI2RXIE_LENGTH                    0x00000001

//#define _IEC4_SPI2TXIE_POSITION                  0x00000010
//#define _IEC4_SPI2TXIE_MASK                      0x00010000
//#define _IEC4_SPI2TXIE_LENGTH                    0x00000001

//#define _IEC4_U2EIE_POSITION                     0x00000011
//#define _IEC4_U2EIE_MASK                         0x00020000
//#define _IEC4_U2EIE_LENGTH                       0x00000001

//#define _IEC4_U2RXIE_POSITION                    0x00000012
//#define _IEC4_U2RXIE_MASK                        0x00040000
//#define _IEC4_U2RXIE_LENGTH                      0x00000001

//#define _IEC4_U2TXIE_POSITION                    0x00000013
//#define _IEC4_U2TXIE_MASK                        0x00080000
//#define _IEC4_U2TXIE_LENGTH                      0x00000001

//#define _IEC4_I2C2BIE_POSITION                   0x00000014
//#define _IEC4_I2C2BIE_MASK                       0x00100000
//#define _IEC4_I2C2BIE_LENGTH                     0x00000001

//#define _IEC4_I2C2SIE_POSITION                   0x00000015
//#define _IEC4_I2C2SIE_MASK                       0x00200000
//#define _IEC4_I2C2SIE_LENGTH                     0x00000001

//#define _IEC4_I2C2MIE_POSITION                   0x00000016
//#define _IEC4_I2C2MIE_MASK                       0x00400000
//#define _IEC4_I2C2MIE_LENGTH                     0x00000001

//#define _IEC4_ETHIE_POSITION                     0x00000019
//#define _IEC4_ETHIE_MASK                         0x02000000
//#define _IEC4_ETHIE_LENGTH                       0x00000001

//#define _IEC4_SPI3EIE_POSITION                   0x0000001A
//#define _IEC4_SPI3EIE_MASK                       0x04000000
//#define _IEC4_SPI3EIE_LENGTH                     0x00000001

//#define _IEC4_SPI3RXIE_POSITION                  0x0000001B
//#define _IEC4_SPI3RXIE_MASK                      0x08000000
//#define _IEC4_SPI3RXIE_LENGTH                    0x00000001

//#define _IEC4_SPI3TXIE_POSITION                  0x0000001C
//#define _IEC4_SPI3TXIE_MASK                      0x10000000
//#define _IEC4_SPI3TXIE_LENGTH                    0x00000001

//#define _IEC4_U3EIE_POSITION                     0x0000001D
//#define _IEC4_U3EIE_MASK                         0x20000000
//#define _IEC4_U3EIE_LENGTH                       0x00000001

//#define _IEC4_U3RXIE_POSITION                    0x0000001E
//#define _IEC4_U3RXIE_MASK                        0x40000000
//#define _IEC4_U3RXIE_LENGTH                      0x00000001

//#define _IEC4_U3TXIE_POSITION                    0x0000001F
//#define _IEC4_U3TXIE_MASK                        0x80000000
//#define _IEC4_U3TXIE_LENGTH                      0x00000001

//#define _IEC4_w_POSITION                         0x00000000
//#define _IEC4_w_MASK                             0xFFFFFFFF
//#define _IEC4_w_LENGTH                           0x00000020

//#define _IEC5_I2C3BIE_POSITION                   0x00000000
//#define _IEC5_I2C3BIE_MASK                       0x00000001
//#define _IEC5_I2C3BIE_LENGTH                     0x00000001

//#define _IEC5_I2C3SIE_POSITION                   0x00000001
//#define _IEC5_I2C3SIE_MASK                       0x00000002
//#define _IEC5_I2C3SIE_LENGTH                     0x00000001

//#define _IEC5_I2C3MIE_POSITION                   0x00000002
//#define _IEC5_I2C3MIE_MASK                       0x00000004
//#define _IEC5_I2C3MIE_LENGTH                     0x00000001

//#define _IEC5_SPI4EIE_POSITION                   0x00000003
//#define _IEC5_SPI4EIE_MASK                       0x00000008
//#define _IEC5_SPI4EIE_LENGTH                     0x00000001

//#define _IEC5_SPI4RXIE_POSITION                  0x00000004
//#define _IEC5_SPI4RXIE_MASK                      0x00000010
//#define _IEC5_SPI4RXIE_LENGTH                    0x00000001

//#define _IEC5_SPI4TXIE_POSITION                  0x00000005
//#define _IEC5_SPI4TXIE_MASK                      0x00000020
//#define _IEC5_SPI4TXIE_LENGTH                    0x00000001

//#define _IEC5_RTCCIE_POSITION                    0x00000006
//#define _IEC5_RTCCIE_MASK                        0x00000040
//#define _IEC5_RTCCIE_LENGTH                      0x00000001

//#define _IEC5_FCEIE_POSITION                     0x00000007
//#define _IEC5_FCEIE_MASK                         0x00000080
//#define _IEC5_FCEIE_LENGTH                       0x00000001

//#define _IEC5_PREIE_POSITION                     0x00000008
//#define _IEC5_PREIE_MASK                         0x00000100
//#define _IEC5_PREIE_LENGTH                       0x00000001

//#define _IEC5_SQI1IE_POSITION                    0x00000009
//#define _IEC5_SQI1IE_MASK                        0x00000200
//#define _IEC5_SQI1IE_LENGTH                      0x00000001

//#define _IEC5_U4EIE_POSITION                     0x0000000A
//#define _IEC5_U4EIE_MASK                         0x00000400
//#define _IEC5_U4EIE_LENGTH                       0x00000001

//#define _IEC5_U4RXIE_POSITION                    0x0000000B
//#define _IEC5_U4RXIE_MASK                        0x00000800
//#define _IEC5_U4RXIE_LENGTH                      0x00000001

//#define _IEC5_U4TXIE_POSITION                    0x0000000C
//#define _IEC5_U4TXIE_MASK                        0x00001000
//#define _IEC5_U4TXIE_LENGTH                      0x00000001

//#define _IEC5_I2C4BIE_POSITION                   0x0000000D
//#define _IEC5_I2C4BIE_MASK                       0x00002000
//#define _IEC5_I2C4BIE_LENGTH                     0x00000001

//#define _IEC5_I2C4SIE_POSITION                   0x0000000E
//#define _IEC5_I2C4SIE_MASK                       0x00004000
//#define _IEC5_I2C4SIE_LENGTH                     0x00000001

//#define _IEC5_I2C4MIE_POSITION                   0x0000000F
//#define _IEC5_I2C4MIE_MASK                       0x00008000
//#define _IEC5_I2C4MIE_LENGTH                     0x00000001

