HomuraVehicle/homuraLib_v2/machine/device/p32mz2048efg100_forVC.c
//#define _IEC5_SPI5EIE_POSITION                   0x00000010
//#define _IEC5_SPI5EIE_MASK                       0x00010000
//#define _IEC5_SPI5EIE_LENGTH                     0x00000001

//#define _IEC5_SPI5RXIE_POSITION                  0x00000011
//#define _IEC5_SPI5RXIE_MASK                      0x00020000
//#define _IEC5_SPI5RXIE_LENGTH                    0x00000001

//#define _IEC5_SPI5TXIE_POSITION                  0x00000012
//#define _IEC5_SPI5TXIE_MASK                      0x00040000
//#define _IEC5_SPI5TXIE_LENGTH                    0x00000001

//#define _IEC5_U5EIE_POSITION                     0x00000013
//#define _IEC5_U5EIE_MASK                         0x00080000
//#define _IEC5_U5EIE_LENGTH                       0x00000001

//#define _IEC5_U5RXIE_POSITION                    0x00000014
//#define _IEC5_U5RXIE_MASK                        0x00100000
//#define _IEC5_U5RXIE_LENGTH                      0x00000001

//#define _IEC5_U5TXIE_POSITION                    0x00000015
//#define _IEC5_U5TXIE_MASK                        0x00200000
//#define _IEC5_U5TXIE_LENGTH                      0x00000001

//#define _IEC5_I2C5BIE_POSITION                   0x00000016
//#define _IEC5_I2C5BIE_MASK                       0x00400000
//#define _IEC5_I2C5BIE_LENGTH                     0x00000001

//#define _IEC5_I2C5SIE_POSITION                   0x00000017
//#define _IEC5_I2C5SIE_MASK                       0x00800000
//#define _IEC5_I2C5SIE_LENGTH                     0x00000001

//#define _IEC5_I2C5MIE_POSITION                   0x00000018
//#define _IEC5_I2C5MIE_MASK                       0x01000000
//#define _IEC5_I2C5MIE_LENGTH                     0x00000001

//#define _IEC5_SPI6IE_POSITION                    0x00000019
//#define _IEC5_SPI6IE_MASK                        0x02000000
//#define _IEC5_SPI6IE_LENGTH                      0x00000001

//#define _IEC5_SPI6RXIE_POSITION                  0x0000001A
//#define _IEC5_SPI6RXIE_MASK                      0x04000000
//#define _IEC5_SPI6RXIE_LENGTH                    0x00000001

//#define _IEC5_SPI6TXIE_POSITION                  0x0000001B
//#define _IEC5_SPI6TXIE_MASK                      0x08000000
//#define _IEC5_SPI6TXIE_LENGTH                    0x00000001

//#define _IEC5_U6EIE_POSITION                     0x0000001C
//#define _IEC5_U6EIE_MASK                         0x10000000
//#define _IEC5_U6EIE_LENGTH                       0x00000001

//#define _IEC5_U6RXIE_POSITION                    0x0000001D
//#define _IEC5_U6RXIE_MASK                        0x20000000
//#define _IEC5_U6RXIE_LENGTH                      0x00000001

//#define _IEC5_U6TXIE_POSITION                    0x0000001E
//#define _IEC5_U6TXIE_MASK                        0x40000000
//#define _IEC5_U6TXIE_LENGTH                      0x00000001

//#define _IEC5_w_POSITION                         0x00000000
//#define _IEC5_w_MASK                             0xFFFFFFFF
//#define _IEC5_w_LENGTH                           0x00000020

//#define _IEC6_ADCEOSIE_POSITION                  0x00000000
//#define _IEC6_ADCEOSIE_MASK                      0x00000001
//#define _IEC6_ADCEOSIE_LENGTH                    0x00000001

//#define _IEC6_ADCARDYIE_POSITION                 0x00000001
//#define _IEC6_ADCARDYIE_MASK                     0x00000002
//#define _IEC6_ADCARDYIE_LENGTH                   0x00000001

//#define _IEC6_ADCURDYIE_POSITION                 0x00000002
//#define _IEC6_ADCURDYIE_MASK                     0x00000004
//#define _IEC6_ADCURDYIE_LENGTH                   0x00000001

//#define _IEC6_ADCGRPIE_POSITION                  0x00000004
//#define _IEC6_ADCGRPIE_MASK                      0x00000010
//#define _IEC6_ADCGRPIE_LENGTH                    0x00000001

//#define _IEC6_ADC0EIE_POSITION                   0x00000006
//#define _IEC6_ADC0EIE_MASK                       0x00000040
//#define _IEC6_ADC0EIE_LENGTH                     0x00000001

//#define _IEC6_ADC1EIE_POSITION                   0x00000007
//#define _IEC6_ADC1EIE_MASK                       0x00000080
//#define _IEC6_ADC1EIE_LENGTH                     0x00000001

//#define _IEC6_ADC2EIE_POSITION                   0x00000008
//#define _IEC6_ADC2EIE_MASK                       0x00000100
//#define _IEC6_ADC2EIE_LENGTH                     0x00000001

//#define _IEC6_ADC3EIE_POSITION                   0x00000009
//#define _IEC6_ADC3EIE_MASK                       0x00000200
//#define _IEC6_ADC3EIE_LENGTH                     0x00000001

//#define _IEC6_ADC4EIE_POSITION                   0x0000000A
//#define _IEC6_ADC4EIE_MASK                       0x00000400
//#define _IEC6_ADC4EIE_LENGTH                     0x00000001

//#define _IEC6_ADC7EIE_POSITION                   0x0000000D
//#define _IEC6_ADC7EIE_MASK                       0x00002000
//#define _IEC6_ADC7EIE_LENGTH                     0x00000001

//#define _IEC6_ADC0WIE_POSITION                   0x0000000E
//#define _IEC6_ADC0WIE_MASK                       0x00004000
//#define _IEC6_ADC0WIE_LENGTH                     0x00000001

//#define _IEC6_ADC1WIE_POSITION                   0x0000000F
//#define _IEC6_ADC1WIE_MASK                       0x00008000
//#define _IEC6_ADC1WIE_LENGTH                     0x00000001

//#define _IEC6_ADC2WIE_POSITION                   0x00000010
//#define _IEC6_ADC2WIE_MASK                       0x00010000
//#define _IEC6_ADC2WIE_LENGTH                     0x00000001

//#define _IEC6_ADC3WIE_POSITION                   0x00000011
//#define _IEC6_ADC3WIE_MASK                       0x00020000
//#define _IEC6_ADC3WIE_LENGTH                     0x00000001

//#define _IEC6_ADC4WIE_POSITION                   0x00000012
//#define _IEC6_ADC4WIE_MASK                       0x00040000
//#define _IEC6_ADC4WIE_LENGTH                     0x00000001

//#define _IEC6_ADC7WIE_POSITION                   0x00000015
//#define _IEC6_ADC7WIE_MASK                       0x00200000
//#define _IEC6_ADC7WIE_LENGTH                     0x00000001

//#define _IEC6_w_POSITION                         0x00000000
//#define _IEC6_w_MASK                             0xFFFFFFFF
//#define _IEC6_w_LENGTH                           0x00000020

//#define _IPC0_CTIS_POSITION                      0x00000000
//#define _IPC0_CTIS_MASK                          0x00000003
//#define _IPC0_CTIS_LENGTH                        0x00000002

