HomuraVehicle/homuraLib_v2/machine/device/p32mz2048efg100_forVC.c
//#define _IPC0_CTIP_POSITION                      0x00000002
//#define _IPC0_CTIP_MASK                          0x0000001C
//#define _IPC0_CTIP_LENGTH                        0x00000003

//#define _IPC0_CS0IS_POSITION                     0x00000008
//#define _IPC0_CS0IS_MASK                         0x00000300
//#define _IPC0_CS0IS_LENGTH                       0x00000002

//#define _IPC0_CS0IP_POSITION                     0x0000000A
//#define _IPC0_CS0IP_MASK                         0x00001C00
//#define _IPC0_CS0IP_LENGTH                       0x00000003

//#define _IPC0_CS1IS_POSITION                     0x00000010
//#define _IPC0_CS1IS_MASK                         0x00030000
//#define _IPC0_CS1IS_LENGTH                       0x00000002

//#define _IPC0_CS1IP_POSITION                     0x00000012
//#define _IPC0_CS1IP_MASK                         0x001C0000
//#define _IPC0_CS1IP_LENGTH                       0x00000003

//#define _IPC0_INT0IS_POSITION                    0x00000018
//#define _IPC0_INT0IS_MASK                        0x03000000
//#define _IPC0_INT0IS_LENGTH                      0x00000002

//#define _IPC0_INT0IP_POSITION                    0x0000001A
//#define _IPC0_INT0IP_MASK                        0x1C000000
//#define _IPC0_INT0IP_LENGTH                      0x00000003

//#define _IPC0_w_POSITION                         0x00000000
//#define _IPC0_w_MASK                             0xFFFFFFFF
//#define _IPC0_w_LENGTH                           0x00000020

//#define _IPC1_T1IS_POSITION                      0x00000000
//#define _IPC1_T1IS_MASK                          0x00000003
//#define _IPC1_T1IS_LENGTH                        0x00000002

//#define _IPC1_T1IP_POSITION                      0x00000002
//#define _IPC1_T1IP_MASK                          0x0000001C
//#define _IPC1_T1IP_LENGTH                        0x00000003

//#define _IPC1_IC1EIS_POSITION                    0x00000008
//#define _IPC1_IC1EIS_MASK                        0x00000300
//#define _IPC1_IC1EIS_LENGTH                      0x00000002

//#define _IPC1_IC1EIP_POSITION                    0x0000000A
//#define _IPC1_IC1EIP_MASK                        0x00001C00
//#define _IPC1_IC1EIP_LENGTH                      0x00000003

//#define _IPC1_IC1IS_POSITION                     0x00000010
//#define _IPC1_IC1IS_MASK                         0x00030000
//#define _IPC1_IC1IS_LENGTH                       0x00000002

//#define _IPC1_IC1IP_POSITION                     0x00000012
//#define _IPC1_IC1IP_MASK                         0x001C0000
//#define _IPC1_IC1IP_LENGTH                       0x00000003

//#define _IPC1_OC1IS_POSITION                     0x00000018
//#define _IPC1_OC1IS_MASK                         0x03000000
//#define _IPC1_OC1IS_LENGTH                       0x00000002

//#define _IPC1_OC1IP_POSITION                     0x0000001A
//#define _IPC1_OC1IP_MASK                         0x1C000000
//#define _IPC1_OC1IP_LENGTH                       0x00000003

//#define _IPC1_w_POSITION                         0x00000000
//#define _IPC1_w_MASK                             0xFFFFFFFF
//#define _IPC1_w_LENGTH                           0x00000020

//#define _IPC2_INT1IS_POSITION                    0x00000000
//#define _IPC2_INT1IS_MASK                        0x00000003
//#define _IPC2_INT1IS_LENGTH                      0x00000002

//#define _IPC2_INT1IP_POSITION                    0x00000002
//#define _IPC2_INT1IP_MASK                        0x0000001C
//#define _IPC2_INT1IP_LENGTH                      0x00000003

//#define _IPC2_T2IS_POSITION                      0x00000008
//#define _IPC2_T2IS_MASK                          0x00000300
//#define _IPC2_T2IS_LENGTH                        0x00000002

//#define _IPC2_T2IP_POSITION                      0x0000000A
//#define _IPC2_T2IP_MASK                          0x00001C00
//#define _IPC2_T2IP_LENGTH                        0x00000003

//#define _IPC2_IC2EIS_POSITION                    0x00000010
//#define _IPC2_IC2EIS_MASK                        0x00030000
//#define _IPC2_IC2EIS_LENGTH                      0x00000002

//#define _IPC2_IC2EIP_POSITION                    0x00000012
//#define _IPC2_IC2EIP_MASK                        0x001C0000
//#define _IPC2_IC2EIP_LENGTH                      0x00000003

//#define _IPC2_IC2IS_POSITION                     0x00000018
//#define _IPC2_IC2IS_MASK                         0x03000000
//#define _IPC2_IC2IS_LENGTH                       0x00000002

//#define _IPC2_IC2IP_POSITION                     0x0000001A
//#define _IPC2_IC2IP_MASK                         0x1C000000
//#define _IPC2_IC2IP_LENGTH                       0x00000003

//#define _IPC2_w_POSITION                         0x00000000
//#define _IPC2_w_MASK                             0xFFFFFFFF
//#define _IPC2_w_LENGTH                           0x00000020

//#define _IPC3_OC2IS_POSITION                     0x00000000
//#define _IPC3_OC2IS_MASK                         0x00000003
//#define _IPC3_OC2IS_LENGTH                       0x00000002

//#define _IPC3_OC2IP_POSITION                     0x00000002
//#define _IPC3_OC2IP_MASK                         0x0000001C
//#define _IPC3_OC2IP_LENGTH                       0x00000003

//#define _IPC3_INT2IS_POSITION                    0x00000008
//#define _IPC3_INT2IS_MASK                        0x00000300
//#define _IPC3_INT2IS_LENGTH                      0x00000002

//#define _IPC3_INT2IP_POSITION                    0x0000000A
//#define _IPC3_INT2IP_MASK                        0x00001C00
//#define _IPC3_INT2IP_LENGTH                      0x00000003

//#define _IPC3_T3IS_POSITION                      0x00000010
//#define _IPC3_T3IS_MASK                          0x00030000
//#define _IPC3_T3IS_LENGTH                        0x00000002

//#define _IPC3_T3IP_POSITION                      0x00000012
//#define _IPC3_T3IP_MASK                          0x001C0000
//#define _IPC3_T3IP_LENGTH                        0x00000003

//#define _IPC3_IC3EIS_POSITION                    0x00000018
//#define _IPC3_IC3EIS_MASK                        0x03000000
//#define _IPC3_IC3EIS_LENGTH                      0x00000002

//#define _IPC3_IC3EIP_POSITION                    0x0000001A
//#define _IPC3_IC3EIP_MASK                        0x1C000000
//#define _IPC3_IC3EIP_LENGTH                      0x00000003

