HomuraVehicle/homuraLib_v2/machine/device/p32mz2048efg100_forVC.c
//#define _IPC3_w_POSITION                         0x00000000
//#define _IPC3_w_MASK                             0xFFFFFFFF
//#define _IPC3_w_LENGTH                           0x00000020

//#define _IPC4_IC3IS_POSITION                     0x00000000
//#define _IPC4_IC3IS_MASK                         0x00000003
//#define _IPC4_IC3IS_LENGTH                       0x00000002

//#define _IPC4_IC3IP_POSITION                     0x00000002
//#define _IPC4_IC3IP_MASK                         0x0000001C
//#define _IPC4_IC3IP_LENGTH                       0x00000003

//#define _IPC4_OC3IS_POSITION                     0x00000008
//#define _IPC4_OC3IS_MASK                         0x00000300
//#define _IPC4_OC3IS_LENGTH                       0x00000002

//#define _IPC4_OC3IP_POSITION                     0x0000000A
//#define _IPC4_OC3IP_MASK                         0x00001C00
//#define _IPC4_OC3IP_LENGTH                       0x00000003

//#define _IPC4_INT3IS_POSITION                    0x00000010
//#define _IPC4_INT3IS_MASK                        0x00030000
//#define _IPC4_INT3IS_LENGTH                      0x00000002

//#define _IPC4_INT3IP_POSITION                    0x00000012
//#define _IPC4_INT3IP_MASK                        0x001C0000
//#define _IPC4_INT3IP_LENGTH                      0x00000003

//#define _IPC4_T4IS_POSITION                      0x00000018
//#define _IPC4_T4IS_MASK                          0x03000000
//#define _IPC4_T4IS_LENGTH                        0x00000002

//#define _IPC4_T4IP_POSITION                      0x0000001A
//#define _IPC4_T4IP_MASK                          0x1C000000
//#define _IPC4_T4IP_LENGTH                        0x00000003

//#define _IPC4_w_POSITION                         0x00000000
//#define _IPC4_w_MASK                             0xFFFFFFFF
//#define _IPC4_w_LENGTH                           0x00000020

//#define _IPC5_IC4EIS_POSITION                    0x00000000
//#define _IPC5_IC4EIS_MASK                        0x00000003
//#define _IPC5_IC4EIS_LENGTH                      0x00000002

//#define _IPC5_IC4EIP_POSITION                    0x00000002
//#define _IPC5_IC4EIP_MASK                        0x0000001C
//#define _IPC5_IC4EIP_LENGTH                      0x00000003

//#define _IPC5_IC4IS_POSITION                     0x00000008
//#define _IPC5_IC4IS_MASK                         0x00000300
//#define _IPC5_IC4IS_LENGTH                       0x00000002

//#define _IPC5_IC4IP_POSITION                     0x0000000A
//#define _IPC5_IC4IP_MASK                         0x00001C00
//#define _IPC5_IC4IP_LENGTH                       0x00000003

//#define _IPC5_OC4IS_POSITION                     0x00000010
//#define _IPC5_OC4IS_MASK                         0x00030000
//#define _IPC5_OC4IS_LENGTH                       0x00000002

//#define _IPC5_OC4IP_POSITION                     0x00000012
//#define _IPC5_OC4IP_MASK                         0x001C0000
//#define _IPC5_OC4IP_LENGTH                       0x00000003

//#define _IPC5_INT4IS_POSITION                    0x00000018
//#define _IPC5_INT4IS_MASK                        0x03000000
//#define _IPC5_INT4IS_LENGTH                      0x00000002

//#define _IPC5_INT4IP_POSITION                    0x0000001A
//#define _IPC5_INT4IP_MASK                        0x1C000000
//#define _IPC5_INT4IP_LENGTH                      0x00000003

//#define _IPC5_w_POSITION                         0x00000000
//#define _IPC5_w_MASK                             0xFFFFFFFF
//#define _IPC5_w_LENGTH                           0x00000020

//#define _IPC6_T5IS_POSITION                      0x00000000
//#define _IPC6_T5IS_MASK                          0x00000003
//#define _IPC6_T5IS_LENGTH                        0x00000002

//#define _IPC6_T5IP_POSITION                      0x00000002
//#define _IPC6_T5IP_MASK                          0x0000001C
//#define _IPC6_T5IP_LENGTH                        0x00000003

//#define _IPC6_IC5EIS_POSITION                    0x00000008
//#define _IPC6_IC5EIS_MASK                        0x00000300
//#define _IPC6_IC5EIS_LENGTH                      0x00000002

//#define _IPC6_IC5EIP_POSITION                    0x0000000A
//#define _IPC6_IC5EIP_MASK                        0x00001C00
//#define _IPC6_IC5EIP_LENGTH                      0x00000003

//#define _IPC6_IC5IS_POSITION                     0x00000010
//#define _IPC6_IC5IS_MASK                         0x00030000
//#define _IPC6_IC5IS_LENGTH                       0x00000002

//#define _IPC6_IC5IP_POSITION                     0x00000012
//#define _IPC6_IC5IP_MASK                         0x001C0000
//#define _IPC6_IC5IP_LENGTH                       0x00000003

//#define _IPC6_OC5IS_POSITION                     0x00000018
//#define _IPC6_OC5IS_MASK                         0x03000000
//#define _IPC6_OC5IS_LENGTH                       0x00000002

//#define _IPC6_OC5IP_POSITION                     0x0000001A
//#define _IPC6_OC5IP_MASK                         0x1C000000
//#define _IPC6_OC5IP_LENGTH                       0x00000003

//#define _IPC6_w_POSITION                         0x00000000
//#define _IPC6_w_MASK                             0xFFFFFFFF
//#define _IPC6_w_LENGTH                           0x00000020

//#define _IPC7_T6IS_POSITION                      0x00000000
//#define _IPC7_T6IS_MASK                          0x00000003
//#define _IPC7_T6IS_LENGTH                        0x00000002

//#define _IPC7_T6IP_POSITION                      0x00000002
//#define _IPC7_T6IP_MASK                          0x0000001C
//#define _IPC7_T6IP_LENGTH                        0x00000003

//#define _IPC7_IC6EIS_POSITION                    0x00000008
//#define _IPC7_IC6EIS_MASK                        0x00000300
//#define _IPC7_IC6EIS_LENGTH                      0x00000002

//#define _IPC7_IC6EIP_POSITION                    0x0000000A
//#define _IPC7_IC6EIP_MASK                        0x00001C00
//#define _IPC7_IC6EIP_LENGTH                      0x00000003

//#define _IPC7_IC6IS_POSITION                     0x00000010
//#define _IPC7_IC6IS_MASK                         0x00030000
//#define _IPC7_IC6IS_LENGTH                       0x00000002

//#define _IPC7_IC6IP_POSITION                     0x00000012
//#define _IPC7_IC6IP_MASK                         0x001C0000
//#define _IPC7_IC6IP_LENGTH                       0x00000003

//#define _IPC7_OC6IS_POSITION                     0x00000018
//#define _IPC7_OC6IS_MASK                         0x03000000
//#define _IPC7_OC6IS_LENGTH                       0x00000002

//#define _IPC7_OC6IP_POSITION                     0x0000001A
//#define _IPC7_OC6IP_MASK                         0x1C000000
//#define _IPC7_OC6IP_LENGTH                       0x00000003

//#define _IPC7_w_POSITION                         0x00000000
//#define _IPC7_w_MASK                             0xFFFFFFFF
//#define _IPC7_w_LENGTH                           0x00000020

//#define _IPC8_T7IS_POSITION                      0x00000000
//#define _IPC8_T7IS_MASK                          0x00000003
//#define _IPC8_T7IS_LENGTH                        0x00000002

//#define _IPC8_T7IP_POSITION                      0x00000002
//#define _IPC8_T7IP_MASK                          0x0000001C
//#define _IPC8_T7IP_LENGTH                        0x00000003

//#define _IPC8_IC7EIS_POSITION                    0x00000008
//#define _IPC8_IC7EIS_MASK                        0x00000300
//#define _IPC8_IC7EIS_LENGTH                      0x00000002

//#define _IPC8_IC7EIP_POSITION                    0x0000000A
//#define _IPC8_IC7EIP_MASK                        0x00001C00
//#define _IPC8_IC7EIP_LENGTH                      0x00000003

