HomuraVehicle/homuraLib_v2/machine/device/p32mz2048efg100_forVC.c
//#define _IPC16_ADCD6IP_POSITION                  0x0000000A
//#define _IPC16_ADCD6IP_MASK                      0x00001C00
//#define _IPC16_ADCD6IP_LENGTH                    0x00000003

//#define _IPC16_ADCD7IS_POSITION                  0x00000010
//#define _IPC16_ADCD7IS_MASK                      0x00030000
//#define _IPC16_ADCD7IS_LENGTH                    0x00000002

//#define _IPC16_ADCD7IP_POSITION                  0x00000012
//#define _IPC16_ADCD7IP_MASK                      0x001C0000
//#define _IPC16_ADCD7IP_LENGTH                    0x00000003

//#define _IPC16_ADCD8IS_POSITION                  0x00000018
//#define _IPC16_ADCD8IS_MASK                      0x03000000
//#define _IPC16_ADCD8IS_LENGTH                    0x00000002

//#define _IPC16_ADCD8IP_POSITION                  0x0000001A
//#define _IPC16_ADCD8IP_MASK                      0x1C000000
//#define _IPC16_ADCD8IP_LENGTH                    0x00000003

//#define _IPC16_w_POSITION                        0x00000000
//#define _IPC16_w_MASK                            0xFFFFFFFF
//#define _IPC16_w_LENGTH                          0x00000020

//#define _IPC17_ADCD9IS_POSITION                  0x00000000
//#define _IPC17_ADCD9IS_MASK                      0x00000003
//#define _IPC17_ADCD9IS_LENGTH                    0x00000002

//#define _IPC17_ADCD9IP_POSITION                  0x00000002
//#define _IPC17_ADCD9IP_MASK                      0x0000001C
//#define _IPC17_ADCD9IP_LENGTH                    0x00000003

//#define _IPC17_ADCD10IS_POSITION                 0x00000008
//#define _IPC17_ADCD10IS_MASK                     0x00000300
//#define _IPC17_ADCD10IS_LENGTH                   0x00000002

//#define _IPC17_ADCD10IP_POSITION                 0x0000000A
//#define _IPC17_ADCD10IP_MASK                     0x00001C00
//#define _IPC17_ADCD10IP_LENGTH                   0x00000003

//#define _IPC17_ADCD11IS_POSITION                 0x00000010
//#define _IPC17_ADCD11IS_MASK                     0x00030000
//#define _IPC17_ADCD11IS_LENGTH                   0x00000002

//#define _IPC17_ADCD11IP_POSITION                 0x00000012
//#define _IPC17_ADCD11IP_MASK                     0x001C0000
//#define _IPC17_ADCD11IP_LENGTH                   0x00000003

//#define _IPC17_ADCD12IS_POSITION                 0x00000018
//#define _IPC17_ADCD12IS_MASK                     0x03000000
//#define _IPC17_ADCD12IS_LENGTH                   0x00000002

//#define _IPC17_ADCD12IP_POSITION                 0x0000001A
//#define _IPC17_ADCD12IP_MASK                     0x1C000000
//#define _IPC17_ADCD12IP_LENGTH                   0x00000003

//#define _IPC17_w_POSITION                        0x00000000
//#define _IPC17_w_MASK                            0xFFFFFFFF
//#define _IPC17_w_LENGTH                          0x00000020

//#define _IPC18_ADCD13IS_POSITION                 0x00000000
//#define _IPC18_ADCD13IS_MASK                     0x00000003
//#define _IPC18_ADCD13IS_LENGTH                   0x00000002

//#define _IPC18_ADCD13IP_POSITION                 0x00000002
//#define _IPC18_ADCD13IP_MASK                     0x0000001C
//#define _IPC18_ADCD13IP_LENGTH                   0x00000003

//#define _IPC18_ADCD14IS_POSITION                 0x00000008
//#define _IPC18_ADCD14IS_MASK                     0x00000300
//#define _IPC18_ADCD14IS_LENGTH                   0x00000002

//#define _IPC18_ADCD14IP_POSITION                 0x0000000A
//#define _IPC18_ADCD14IP_MASK                     0x00001C00
//#define _IPC18_ADCD14IP_LENGTH                   0x00000003

//#define _IPC18_ADCD15IS_POSITION                 0x00000010
//#define _IPC18_ADCD15IS_MASK                     0x00030000
//#define _IPC18_ADCD15IS_LENGTH                   0x00000002

//#define _IPC18_ADCD15IP_POSITION                 0x00000012
//#define _IPC18_ADCD15IP_MASK                     0x001C0000
//#define _IPC18_ADCD15IP_LENGTH                   0x00000003

//#define _IPC18_ADCD16IS_POSITION                 0x00000018
//#define _IPC18_ADCD16IS_MASK                     0x03000000
//#define _IPC18_ADCD16IS_LENGTH                   0x00000002

//#define _IPC18_ADCD16IP_POSITION                 0x0000001A
//#define _IPC18_ADCD16IP_MASK                     0x1C000000
//#define _IPC18_ADCD16IP_LENGTH                   0x00000003

//#define _IPC18_w_POSITION                        0x00000000
//#define _IPC18_w_MASK                            0xFFFFFFFF
//#define _IPC18_w_LENGTH                          0x00000020

//#define _IPC19_ADCD17IS_POSITION                 0x00000000
//#define _IPC19_ADCD17IS_MASK                     0x00000003
//#define _IPC19_ADCD17IS_LENGTH                   0x00000002

//#define _IPC19_ADCD17IP_POSITION                 0x00000002
//#define _IPC19_ADCD17IP_MASK                     0x0000001C
//#define _IPC19_ADCD17IP_LENGTH                   0x00000003

//#define _IPC19_ADCD18IS_POSITION                 0x00000008
//#define _IPC19_ADCD18IS_MASK                     0x00000300
//#define _IPC19_ADCD18IS_LENGTH                   0x00000002

//#define _IPC19_ADCD18IP_POSITION                 0x0000000A
//#define _IPC19_ADCD18IP_MASK                     0x00001C00
//#define _IPC19_ADCD18IP_LENGTH                   0x00000003

//#define _IPC19_ADCD19IS_POSITION                 0x00000010
//#define _IPC19_ADCD19IS_MASK                     0x00030000
//#define _IPC19_ADCD19IS_LENGTH                   0x00000002

//#define _IPC19_ADCD19IP_POSITION                 0x00000012
//#define _IPC19_ADCD19IP_MASK                     0x001C0000
//#define _IPC19_ADCD19IP_LENGTH                   0x00000003

//#define _IPC19_ADCD20IS_POSITION                 0x00000018
//#define _IPC19_ADCD20IS_MASK                     0x03000000
//#define _IPC19_ADCD20IS_LENGTH                   0x00000002

//#define _IPC19_ADCD20IP_POSITION                 0x0000001A
//#define _IPC19_ADCD20IP_MASK                     0x1C000000
//#define _IPC19_ADCD20IP_LENGTH                   0x00000003

//#define _IPC19_w_POSITION                        0x00000000
//#define _IPC19_w_MASK                            0xFFFFFFFF
//#define _IPC19_w_LENGTH                          0x00000020

//#define _IPC20_ADCD21IS_POSITION                 0x00000000
//#define _IPC20_ADCD21IS_MASK                     0x00000003
//#define _IPC20_ADCD21IS_LENGTH                   0x00000002

//#define _IPC20_ADCD21IP_POSITION                 0x00000002
//#define _IPC20_ADCD21IP_MASK                     0x0000001C
//#define _IPC20_ADCD21IP_LENGTH                   0x00000003

//#define _IPC20_ADCD22IS_POSITION                 0x00000008
//#define _IPC20_ADCD22IS_MASK                     0x00000300
//#define _IPC20_ADCD22IS_LENGTH                   0x00000002

//#define _IPC20_ADCD22IP_POSITION                 0x0000000A
//#define _IPC20_ADCD22IP_MASK                     0x00001C00
//#define _IPC20_ADCD22IP_LENGTH                   0x00000003

