HomuraVehicle/homuraLib_v2/machine/device/p32mz2048efg100_forVC.c
//#define _IPC20_ADCD23IS_POSITION                 0x00000010
//#define _IPC20_ADCD23IS_MASK                     0x00030000
//#define _IPC20_ADCD23IS_LENGTH                   0x00000002

//#define _IPC20_ADCD23IP_POSITION                 0x00000012
//#define _IPC20_ADCD23IP_MASK                     0x001C0000
//#define _IPC20_ADCD23IP_LENGTH                   0x00000003

//#define _IPC20_ADCD24IS_POSITION                 0x00000018
//#define _IPC20_ADCD24IS_MASK                     0x03000000
//#define _IPC20_ADCD24IS_LENGTH                   0x00000002

//#define _IPC20_ADCD24IP_POSITION                 0x0000001A
//#define _IPC20_ADCD24IP_MASK                     0x1C000000
//#define _IPC20_ADCD24IP_LENGTH                   0x00000003

//#define _IPC20_w_POSITION                        0x00000000
//#define _IPC20_w_MASK                            0xFFFFFFFF
//#define _IPC20_w_LENGTH                          0x00000020

//#define _IPC21_ADCD25IS_POSITION                 0x00000000
//#define _IPC21_ADCD25IS_MASK                     0x00000003
//#define _IPC21_ADCD25IS_LENGTH                   0x00000002

//#define _IPC21_ADCD25IP_POSITION                 0x00000002
//#define _IPC21_ADCD25IP_MASK                     0x0000001C
//#define _IPC21_ADCD25IP_LENGTH                   0x00000003

//#define _IPC21_ADCD26IS_POSITION                 0x00000008
//#define _IPC21_ADCD26IS_MASK                     0x00000300
//#define _IPC21_ADCD26IS_LENGTH                   0x00000002

//#define _IPC21_ADCD26IP_POSITION                 0x0000000A
//#define _IPC21_ADCD26IP_MASK                     0x00001C00
//#define _IPC21_ADCD26IP_LENGTH                   0x00000003

//#define _IPC21_ADCD27IS_POSITION                 0x00000010
//#define _IPC21_ADCD27IS_MASK                     0x00030000
//#define _IPC21_ADCD27IS_LENGTH                   0x00000002

//#define _IPC21_ADCD27IP_POSITION                 0x00000012
//#define _IPC21_ADCD27IP_MASK                     0x001C0000
//#define _IPC21_ADCD27IP_LENGTH                   0x00000003

//#define _IPC21_ADCD28IS_POSITION                 0x00000018
//#define _IPC21_ADCD28IS_MASK                     0x03000000
//#define _IPC21_ADCD28IS_LENGTH                   0x00000002

//#define _IPC21_ADCD28IP_POSITION                 0x0000001A
//#define _IPC21_ADCD28IP_MASK                     0x1C000000
//#define _IPC21_ADCD28IP_LENGTH                   0x00000003

//#define _IPC21_w_POSITION                        0x00000000
//#define _IPC21_w_MASK                            0xFFFFFFFF
//#define _IPC21_w_LENGTH                          0x00000020

//#define _IPC22_ADCD29IS_POSITION                 0x00000000
//#define _IPC22_ADCD29IS_MASK                     0x00000003
//#define _IPC22_ADCD29IS_LENGTH                   0x00000002

//#define _IPC22_ADCD29IP_POSITION                 0x00000002
//#define _IPC22_ADCD29IP_MASK                     0x0000001C
//#define _IPC22_ADCD29IP_LENGTH                   0x00000003

//#define _IPC22_ADCD30IS_POSITION                 0x00000008
//#define _IPC22_ADCD30IS_MASK                     0x00000300
//#define _IPC22_ADCD30IS_LENGTH                   0x00000002

//#define _IPC22_ADCD30IP_POSITION                 0x0000000A
//#define _IPC22_ADCD30IP_MASK                     0x00001C00
//#define _IPC22_ADCD30IP_LENGTH                   0x00000003

//#define _IPC22_ADCD31IS_POSITION                 0x00000010
//#define _IPC22_ADCD31IS_MASK                     0x00030000
//#define _IPC22_ADCD31IS_LENGTH                   0x00000002

//#define _IPC22_ADCD31IP_POSITION                 0x00000012
//#define _IPC22_ADCD31IP_MASK                     0x001C0000
//#define _IPC22_ADCD31IP_LENGTH                   0x00000003

//#define _IPC22_ADCD32IS_POSITION                 0x00000018
//#define _IPC22_ADCD32IS_MASK                     0x03000000
//#define _IPC22_ADCD32IS_LENGTH                   0x00000002

//#define _IPC22_ADCD32IP_POSITION                 0x0000001A
//#define _IPC22_ADCD32IP_MASK                     0x1C000000
//#define _IPC22_ADCD32IP_LENGTH                   0x00000003

//#define _IPC22_w_POSITION                        0x00000000
//#define _IPC22_w_MASK                            0xFFFFFFFF
//#define _IPC22_w_LENGTH                          0x00000020

//#define _IPC23_ADCD33IS_POSITION                 0x00000000
//#define _IPC23_ADCD33IS_MASK                     0x00000003
//#define _IPC23_ADCD33IS_LENGTH                   0x00000002

//#define _IPC23_ADCD33IP_POSITION                 0x00000002
//#define _IPC23_ADCD33IP_MASK                     0x0000001C
//#define _IPC23_ADCD33IP_LENGTH                   0x00000003

//#define _IPC23_ADCD34IS_POSITION                 0x00000008
//#define _IPC23_ADCD34IS_MASK                     0x00000300
//#define _IPC23_ADCD34IS_LENGTH                   0x00000002

//#define _IPC23_ADCD34IP_POSITION                 0x0000000A
//#define _IPC23_ADCD34IP_MASK                     0x00001C00
//#define _IPC23_ADCD34IP_LENGTH                   0x00000003

//#define _IPC23_w_POSITION                        0x00000000
//#define _IPC23_w_MASK                            0xFFFFFFFF
//#define _IPC23_w_LENGTH                          0x00000020

//#define _IPC25_ADCD43IS_POSITION                 0x00000010
//#define _IPC25_ADCD43IS_MASK                     0x00030000
//#define _IPC25_ADCD43IS_LENGTH                   0x00000002

//#define _IPC25_ADCD43IP_POSITION                 0x00000012
//#define _IPC25_ADCD43IP_MASK                     0x001C0000
//#define _IPC25_ADCD43IP_LENGTH                   0x00000003

//#define _IPC25_ADCD44IS_POSITION                 0x00000018
//#define _IPC25_ADCD44IS_MASK                     0x03000000
//#define _IPC25_ADCD44IS_LENGTH                   0x00000002

//#define _IPC25_ADCD44IP_POSITION                 0x0000001A
//#define _IPC25_ADCD44IP_MASK                     0x1C000000
//#define _IPC25_ADCD44IP_LENGTH                   0x00000003

//#define _IPC25_w_POSITION                        0x00000000
//#define _IPC25_w_MASK                            0xFFFFFFFF
//#define _IPC25_w_LENGTH                          0x00000020

//#define _IPC26_CPCIS_POSITION                    0x00000000
//#define _IPC26_CPCIS_MASK                        0x00000003
//#define _IPC26_CPCIS_LENGTH                      0x00000002

//#define _IPC26_CPCIP_POSITION                    0x00000002
//#define _IPC26_CPCIP_MASK                        0x0000001C
//#define _IPC26_CPCIP_LENGTH                      0x00000003

//#define _IPC26_CFDCIS_POSITION                   0x00000008
//#define _IPC26_CFDCIS_MASK                       0x00000300
//#define _IPC26_CFDCIS_LENGTH                     0x00000002

//#define _IPC26_CFDCIP_POSITION                   0x0000000A
//#define _IPC26_CFDCIP_MASK                       0x00001C00
//#define _IPC26_CFDCIP_LENGTH                     0x00000003

//#define _IPC26_SBIS_POSITION                     0x00000010
//#define _IPC26_SBIS_MASK                         0x00030000
//#define _IPC26_SBIS_LENGTH                       0x00000002

