HomuraVehicle/homuraLib_v2/machine/device/p32mz2048efg100_forVC.c
//#define _IPC26_SBIP_POSITION                     0x00000012
//#define _IPC26_SBIP_MASK                         0x001C0000
//#define _IPC26_SBIP_LENGTH                       0x00000003

//#define _IPC26_w_POSITION                        0x00000000
//#define _IPC26_w_MASK                            0xFFFFFFFF
//#define _IPC26_w_LENGTH                          0x00000020

//#define _IPC27_SPI1EIS_POSITION                  0x00000008
//#define _IPC27_SPI1EIS_MASK                      0x00000300
//#define _IPC27_SPI1EIS_LENGTH                    0x00000002

//#define _IPC27_SPI1EIP_POSITION                  0x0000000A
//#define _IPC27_SPI1EIP_MASK                      0x00001C00
//#define _IPC27_SPI1EIP_LENGTH                    0x00000003

//#define _IPC27_SPI1RXIS_POSITION                 0x00000010
//#define _IPC27_SPI1RXIS_MASK                     0x00030000
//#define _IPC27_SPI1RXIS_LENGTH                   0x00000002

//#define _IPC27_SPI1RXIP_POSITION                 0x00000012
//#define _IPC27_SPI1RXIP_MASK                     0x001C0000
//#define _IPC27_SPI1RXIP_LENGTH                   0x00000003

//#define _IPC27_SPI1TXIS_POSITION                 0x00000018
//#define _IPC27_SPI1TXIS_MASK                     0x03000000
//#define _IPC27_SPI1TXIS_LENGTH                   0x00000002

//#define _IPC27_SPI1TXIP_POSITION                 0x0000001A
//#define _IPC27_SPI1TXIP_MASK                     0x1C000000
//#define _IPC27_SPI1TXIP_LENGTH                   0x00000003

//#define _IPC27_w_POSITION                        0x00000000
//#define _IPC27_w_MASK                            0xFFFFFFFF
//#define _IPC27_w_LENGTH                          0x00000020

//#define _IPC28_U1EIS_POSITION                    0x00000000
//#define _IPC28_U1EIS_MASK                        0x00000003
//#define _IPC28_U1EIS_LENGTH                      0x00000002

//#define _IPC28_U1EIP_POSITION                    0x00000002
//#define _IPC28_U1EIP_MASK                        0x0000001C
//#define _IPC28_U1EIP_LENGTH                      0x00000003

//#define _IPC28_U1RXIS_POSITION                   0x00000008
//#define _IPC28_U1RXIS_MASK                       0x00000300
//#define _IPC28_U1RXIS_LENGTH                     0x00000002

//#define _IPC28_U1RXIP_POSITION                   0x0000000A
//#define _IPC28_U1RXIP_MASK                       0x00001C00
//#define _IPC28_U1RXIP_LENGTH                     0x00000003

//#define _IPC28_U1TXIS_POSITION                   0x00000010
//#define _IPC28_U1TXIS_MASK                       0x00030000
//#define _IPC28_U1TXIS_LENGTH                     0x00000002

//#define _IPC28_U1TXIP_POSITION                   0x00000012
//#define _IPC28_U1TXIP_MASK                       0x001C0000
//#define _IPC28_U1TXIP_LENGTH                     0x00000003

//#define _IPC28_I2C1BIS_POSITION                  0x00000018
//#define _IPC28_I2C1BIS_MASK                      0x03000000
//#define _IPC28_I2C1BIS_LENGTH                    0x00000002

//#define _IPC28_I2C1BIP_POSITION                  0x0000001A
//#define _IPC28_I2C1BIP_MASK                      0x1C000000
//#define _IPC28_I2C1BIP_LENGTH                    0x00000003

//#define _IPC28_w_POSITION                        0x00000000
//#define _IPC28_w_MASK                            0xFFFFFFFF
//#define _IPC28_w_LENGTH                          0x00000020

//#define _IPC29_I2C1SIS_POSITION                  0x00000000
//#define _IPC29_I2C1SIS_MASK                      0x00000003
//#define _IPC29_I2C1SIS_LENGTH                    0x00000002

//#define _IPC29_I2C1SIP_POSITION                  0x00000002
//#define _IPC29_I2C1SIP_MASK                      0x0000001C
//#define _IPC29_I2C1SIP_LENGTH                    0x00000003

//#define _IPC29_I2C1MIS_POSITION                  0x00000008
//#define _IPC29_I2C1MIS_MASK                      0x00000300
//#define _IPC29_I2C1MIS_LENGTH                    0x00000002

//#define _IPC29_I2C1MIP_POSITION                  0x0000000A
//#define _IPC29_I2C1MIP_MASK                      0x00001C00
//#define _IPC29_I2C1MIP_LENGTH                    0x00000003

//#define _IPC29_CNAIS_POSITION                    0x00000010
//#define _IPC29_CNAIS_MASK                        0x00030000
//#define _IPC29_CNAIS_LENGTH                      0x00000002

//#define _IPC29_CNAIP_POSITION                    0x00000012
//#define _IPC29_CNAIP_MASK                        0x001C0000
//#define _IPC29_CNAIP_LENGTH                      0x00000003

//#define _IPC29_CNBIS_POSITION                    0x00000018
//#define _IPC29_CNBIS_MASK                        0x03000000
//#define _IPC29_CNBIS_LENGTH                      0x00000002

//#define _IPC29_CNBIP_POSITION                    0x0000001A
//#define _IPC29_CNBIP_MASK                        0x1C000000
//#define _IPC29_CNBIP_LENGTH                      0x00000003

//#define _IPC29_w_POSITION                        0x00000000
//#define _IPC29_w_MASK                            0xFFFFFFFF
//#define _IPC29_w_LENGTH                          0x00000020

//#define _IPC30_CNCIS_POSITION                    0x00000000
//#define _IPC30_CNCIS_MASK                        0x00000003
//#define _IPC30_CNCIS_LENGTH                      0x00000002

//#define _IPC30_CNCIP_POSITION                    0x00000002
//#define _IPC30_CNCIP_MASK                        0x0000001C
//#define _IPC30_CNCIP_LENGTH                      0x00000003

//#define _IPC30_CNDIS_POSITION                    0x00000008
//#define _IPC30_CNDIS_MASK                        0x00000300
//#define _IPC30_CNDIS_LENGTH                      0x00000002

//#define _IPC30_CNDIP_POSITION                    0x0000000A
//#define _IPC30_CNDIP_MASK                        0x00001C00
//#define _IPC30_CNDIP_LENGTH                      0x00000003

//#define _IPC30_CNEIS_POSITION                    0x00000010
//#define _IPC30_CNEIS_MASK                        0x00030000
//#define _IPC30_CNEIS_LENGTH                      0x00000002

//#define _IPC30_CNEIP_POSITION                    0x00000012
//#define _IPC30_CNEIP_MASK                        0x001C0000
//#define _IPC30_CNEIP_LENGTH                      0x00000003

//#define _IPC30_CNFIS_POSITION                    0x00000018
//#define _IPC30_CNFIS_MASK                        0x03000000
//#define _IPC30_CNFIS_LENGTH                      0x00000002

//#define _IPC30_CNFIP_POSITION                    0x0000001A
//#define _IPC30_CNFIP_MASK                        0x1C000000
//#define _IPC30_CNFIP_LENGTH                      0x00000003

