HomuraVehicle/homuraLib_v2/machine/device/p32mz2048efg100_forVC.c
//#define _IPC40_I2C3BIP_POSITION                  0x00000002
//#define _IPC40_I2C3BIP_MASK                      0x0000001C
//#define _IPC40_I2C3BIP_LENGTH                    0x00000003

//#define _IPC40_I2C3SIS_POSITION                  0x00000008
//#define _IPC40_I2C3SIS_MASK                      0x00000300
//#define _IPC40_I2C3SIS_LENGTH                    0x00000002

//#define _IPC40_I2C3SIP_POSITION                  0x0000000A
//#define _IPC40_I2C3SIP_MASK                      0x00001C00
//#define _IPC40_I2C3SIP_LENGTH                    0x00000003

//#define _IPC40_I2C3MIS_POSITION                  0x00000010
//#define _IPC40_I2C3MIS_MASK                      0x00030000
//#define _IPC40_I2C3MIS_LENGTH                    0x00000002

//#define _IPC40_I2C3MIP_POSITION                  0x00000012
//#define _IPC40_I2C3MIP_MASK                      0x001C0000
//#define _IPC40_I2C3MIP_LENGTH                    0x00000003

//#define _IPC40_SPI4EIS_POSITION                  0x00000018
//#define _IPC40_SPI4EIS_MASK                      0x03000000
//#define _IPC40_SPI4EIS_LENGTH                    0x00000002

//#define _IPC40_SPI4EIP_POSITION                  0x0000001A
//#define _IPC40_SPI4EIP_MASK                      0x1C000000
//#define _IPC40_SPI4EIP_LENGTH                    0x00000003

//#define _IPC40_w_POSITION                        0x00000000
//#define _IPC40_w_MASK                            0xFFFFFFFF
//#define _IPC40_w_LENGTH                          0x00000020

//#define _IPC41_SPI4RXIS_POSITION                 0x00000000
//#define _IPC41_SPI4RXIS_MASK                     0x00000003
//#define _IPC41_SPI4RXIS_LENGTH                   0x00000002

//#define _IPC41_SPI4RXIP_POSITION                 0x00000002
//#define _IPC41_SPI4RXIP_MASK                     0x0000001C
//#define _IPC41_SPI4RXIP_LENGTH                   0x00000003

//#define _IPC41_SPI4TXIS_POSITION                 0x00000008
//#define _IPC41_SPI4TXIS_MASK                     0x00000300
//#define _IPC41_SPI4TXIS_LENGTH                   0x00000002

//#define _IPC41_SPI4TXIP_POSITION                 0x0000000A
//#define _IPC41_SPI4TXIP_MASK                     0x00001C00
//#define _IPC41_SPI4TXIP_LENGTH                   0x00000003

//#define _IPC41_RTCCIS_POSITION                   0x00000010
//#define _IPC41_RTCCIS_MASK                       0x00030000
//#define _IPC41_RTCCIS_LENGTH                     0x00000002

//#define _IPC41_RTCCIP_POSITION                   0x00000012
//#define _IPC41_RTCCIP_MASK                       0x001C0000
//#define _IPC41_RTCCIP_LENGTH                     0x00000003

//#define _IPC41_FCEIS_POSITION                    0x00000018
//#define _IPC41_FCEIS_MASK                        0x03000000
//#define _IPC41_FCEIS_LENGTH                      0x00000002

//#define _IPC41_FCEIP_POSITION                    0x0000001A
//#define _IPC41_FCEIP_MASK                        0x1C000000
//#define _IPC41_FCEIP_LENGTH                      0x00000003

//#define _IPC41_w_POSITION                        0x00000000
//#define _IPC41_w_MASK                            0xFFFFFFFF
//#define _IPC41_w_LENGTH                          0x00000020

//#define _IPC42_PREIS_POSITION                    0x00000000
//#define _IPC42_PREIS_MASK                        0x00000003
//#define _IPC42_PREIS_LENGTH                      0x00000002

//#define _IPC42_PREIP_POSITION                    0x00000002
//#define _IPC42_PREIP_MASK                        0x0000001C
//#define _IPC42_PREIP_LENGTH                      0x00000003

//#define _IPC42_SQI1IS_POSITION                   0x00000008
//#define _IPC42_SQI1IS_MASK                       0x00000300
//#define _IPC42_SQI1IS_LENGTH                     0x00000002

//#define _IPC42_SQI1IP_POSITION                   0x0000000A
//#define _IPC42_SQI1IP_MASK                       0x00001C00
//#define _IPC42_SQI1IP_LENGTH                     0x00000003

//#define _IPC42_U4EIS_POSITION                    0x00000010
//#define _IPC42_U4EIS_MASK                        0x00030000
//#define _IPC42_U4EIS_LENGTH                      0x00000002

//#define _IPC42_U4EIP_POSITION                    0x00000012
//#define _IPC42_U4EIP_MASK                        0x001C0000
//#define _IPC42_U4EIP_LENGTH                      0x00000003

//#define _IPC42_U4RXIS_POSITION                   0x00000018
//#define _IPC42_U4RXIS_MASK                       0x03000000
//#define _IPC42_U4RXIS_LENGTH                     0x00000002

//#define _IPC42_U4RXIP_POSITION                   0x0000001A
//#define _IPC42_U4RXIP_MASK                       0x1C000000
//#define _IPC42_U4RXIP_LENGTH                     0x00000003

//#define _IPC42_w_POSITION                        0x00000000
//#define _IPC42_w_MASK                            0xFFFFFFFF
//#define _IPC42_w_LENGTH                          0x00000020

//#define _IPC43_U4TXIS_POSITION                   0x00000000
//#define _IPC43_U4TXIS_MASK                       0x00000003
//#define _IPC43_U4TXIS_LENGTH                     0x00000002

//#define _IPC43_U4TXIP_POSITION                   0x00000002
//#define _IPC43_U4TXIP_MASK                       0x0000001C
//#define _IPC43_U4TXIP_LENGTH                     0x00000003

//#define _IPC43_I2C4BIS_POSITION                  0x00000008
//#define _IPC43_I2C4BIS_MASK                      0x00000300
//#define _IPC43_I2C4BIS_LENGTH                    0x00000002

//#define _IPC43_I2C4BIP_POSITION                  0x0000000A
//#define _IPC43_I2C4BIP_MASK                      0x00001C00
//#define _IPC43_I2C4BIP_LENGTH                    0x00000003

//#define _IPC43_I2C4SIS_POSITION                  0x00000010
//#define _IPC43_I2C4SIS_MASK                      0x00030000
//#define _IPC43_I2C4SIS_LENGTH                    0x00000002

//#define _IPC43_I2C4SIP_POSITION                  0x00000012
//#define _IPC43_I2C4SIP_MASK                      0x001C0000
//#define _IPC43_I2C4SIP_LENGTH                    0x00000003

//#define _IPC43_I2C4MIS_POSITION                  0x00000018
//#define _IPC43_I2C4MIS_MASK                      0x03000000
//#define _IPC43_I2C4MIS_LENGTH                    0x00000002

//#define _IPC43_I2C4MIP_POSITION                  0x0000001A
//#define _IPC43_I2C4MIP_MASK                      0x1C000000
//#define _IPC43_I2C4MIP_LENGTH                    0x00000003

//#define _IPC43_w_POSITION                        0x00000000
//#define _IPC43_w_MASK                            0xFFFFFFFF
//#define _IPC43_w_LENGTH                          0x00000020

