HomuraVehicle/homuraLib_v2/machine/device/p32mz2048efg100_forVC.c
//#define _IPC44_SPI5EIS_POSITION                  0x00000000
//#define _IPC44_SPI5EIS_MASK                      0x00000003
//#define _IPC44_SPI5EIS_LENGTH                    0x00000002

//#define _IPC44_SPI5EIP_POSITION                  0x00000002
//#define _IPC44_SPI5EIP_MASK                      0x0000001C
//#define _IPC44_SPI5EIP_LENGTH                    0x00000003

//#define _IPC44_SPI5RXIS_POSITION                 0x00000008
//#define _IPC44_SPI5RXIS_MASK                     0x00000300
//#define _IPC44_SPI5RXIS_LENGTH                   0x00000002

//#define _IPC44_SPI5RXIP_POSITION                 0x0000000A
//#define _IPC44_SPI5RXIP_MASK                     0x00001C00
//#define _IPC44_SPI5RXIP_LENGTH                   0x00000003

//#define _IPC44_SPI5TXIS_POSITION                 0x00000010
//#define _IPC44_SPI5TXIS_MASK                     0x00030000
//#define _IPC44_SPI5TXIS_LENGTH                   0x00000002

//#define _IPC44_SPI5TXIP_POSITION                 0x00000012
//#define _IPC44_SPI5TXIP_MASK                     0x001C0000
//#define _IPC44_SPI5TXIP_LENGTH                   0x00000003

//#define _IPC44_U5EIS_POSITION                    0x00000018
//#define _IPC44_U5EIS_MASK                        0x03000000
//#define _IPC44_U5EIS_LENGTH                      0x00000002

//#define _IPC44_U5EIP_POSITION                    0x0000001A
//#define _IPC44_U5EIP_MASK                        0x1C000000
//#define _IPC44_U5EIP_LENGTH                      0x00000003

//#define _IPC44_w_POSITION                        0x00000000
//#define _IPC44_w_MASK                            0xFFFFFFFF
//#define _IPC44_w_LENGTH                          0x00000020

//#define _IPC45_U5RXIS_POSITION                   0x00000000
//#define _IPC45_U5RXIS_MASK                       0x00000003
//#define _IPC45_U5RXIS_LENGTH                     0x00000002

//#define _IPC45_U5RXIP_POSITION                   0x00000002
//#define _IPC45_U5RXIP_MASK                       0x0000001C
//#define _IPC45_U5RXIP_LENGTH                     0x00000003

//#define _IPC45_U5TXIS_POSITION                   0x00000008
//#define _IPC45_U5TXIS_MASK                       0x00000300
//#define _IPC45_U5TXIS_LENGTH                     0x00000002

//#define _IPC45_U5TXIP_POSITION                   0x0000000A
//#define _IPC45_U5TXIP_MASK                       0x00001C00
//#define _IPC45_U5TXIP_LENGTH                     0x00000003

//#define _IPC45_I2C5BIS_POSITION                  0x00000010
//#define _IPC45_I2C5BIS_MASK                      0x00030000
//#define _IPC45_I2C5BIS_LENGTH                    0x00000002

//#define _IPC45_I2C5BIP_POSITION                  0x00000012
//#define _IPC45_I2C5BIP_MASK                      0x001C0000
//#define _IPC45_I2C5BIP_LENGTH                    0x00000003

//#define _IPC45_I2C5SIS_POSITION                  0x00000018
//#define _IPC45_I2C5SIS_MASK                      0x03000000
//#define _IPC45_I2C5SIS_LENGTH                    0x00000002

//#define _IPC45_I2C5SIP_POSITION                  0x0000001A
//#define _IPC45_I2C5SIP_MASK                      0x1C000000
//#define _IPC45_I2C5SIP_LENGTH                    0x00000003

//#define _IPC45_w_POSITION                        0x00000000
//#define _IPC45_w_MASK                            0xFFFFFFFF
//#define _IPC45_w_LENGTH                          0x00000020

//#define _IPC46_I2C5MIS_POSITION                  0x00000000
//#define _IPC46_I2C5MIS_MASK                      0x00000003
//#define _IPC46_I2C5MIS_LENGTH                    0x00000002

//#define _IPC46_I2C5MIP_POSITION                  0x00000002
//#define _IPC46_I2C5MIP_MASK                      0x0000001C
//#define _IPC46_I2C5MIP_LENGTH                    0x00000003

//#define _IPC46_SPI6EIS_POSITION                  0x00000008
//#define _IPC46_SPI6EIS_MASK                      0x00000300
//#define _IPC46_SPI6EIS_LENGTH                    0x00000002

//#define _IPC46_SPI6EIP_POSITION                  0x0000000A
//#define _IPC46_SPI6EIP_MASK                      0x00001C00
//#define _IPC46_SPI6EIP_LENGTH                    0x00000003

//#define _IPC46_SPI6RXIS_POSITION                 0x00000010
//#define _IPC46_SPI6RXIS_MASK                     0x00030000
//#define _IPC46_SPI6RXIS_LENGTH                   0x00000002

//#define _IPC46_SPI6RXIP_POSITION                 0x00000012
//#define _IPC46_SPI6RXIP_MASK                     0x001C0000
//#define _IPC46_SPI6RXIP_LENGTH                   0x00000003

//#define _IPC46_SPI6TXIS_POSITION                 0x00000018
//#define _IPC46_SPI6TXIS_MASK                     0x03000000
//#define _IPC46_SPI6TXIS_LENGTH                   0x00000002

//#define _IPC46_SPI6TXIP_POSITION                 0x0000001A
//#define _IPC46_SPI6TXIP_MASK                     0x1C000000
//#define _IPC46_SPI6TXIP_LENGTH                   0x00000003

//#define _IPC46_w_POSITION                        0x00000000
//#define _IPC46_w_MASK                            0xFFFFFFFF
//#define _IPC46_w_LENGTH                          0x00000020

//#define _IPC47_U6EIS_POSITION                    0x00000000
//#define _IPC47_U6EIS_MASK                        0x00000003
//#define _IPC47_U6EIS_LENGTH                      0x00000002

//#define _IPC47_U6EIP_POSITION                    0x00000002
//#define _IPC47_U6EIP_MASK                        0x0000001C
//#define _IPC47_U6EIP_LENGTH                      0x00000003

//#define _IPC47_U6RXIS_POSITION                   0x00000008
//#define _IPC47_U6RXIS_MASK                       0x00000300
//#define _IPC47_U6RXIS_LENGTH                     0x00000002

//#define _IPC47_U6RXIP_POSITION                   0x0000000A
//#define _IPC47_U6RXIP_MASK                       0x00001C00
//#define _IPC47_U6RXIP_LENGTH                     0x00000003

//#define _IPC47_U6TXIS_POSITION                   0x00000010
//#define _IPC47_U6TXIS_MASK                       0x00030000
//#define _IPC47_U6TXIS_LENGTH                     0x00000002

//#define _IPC47_U6TXIP_POSITION                   0x00000012
//#define _IPC47_U6TXIP_MASK                       0x001C0000
//#define _IPC47_U6TXIP_LENGTH                     0x00000003

//#define _IPC47_w_POSITION                        0x00000000
//#define _IPC47_w_MASK                            0xFFFFFFFF
//#define _IPC47_w_LENGTH                          0x00000020

//#define _IPC48_ADCEOSIS_POSITION                 0x00000000
//#define _IPC48_ADCEOSIS_MASK                     0x00000003
//#define _IPC48_ADCEOSIS_LENGTH                   0x00000002

//#define _IPC48_ADCEOSIP_POSITION                 0x00000002
//#define _IPC48_ADCEOSIP_MASK                     0x0000001C
//#define _IPC48_ADCEOSIP_LENGTH                   0x00000003

//#define _IPC48_ADCARDYIS_POSITION                0x00000008
//#define _IPC48_ADCARDYIS_MASK                    0x00000300
//#define _IPC48_ADCARDYIS_LENGTH                  0x00000002

//#define _IPC48_ADCARDYIP_POSITION                0x0000000A
//#define _IPC48_ADCARDYIP_MASK                    0x00001C00
//#define _IPC48_ADCARDYIP_LENGTH                  0x00000003

//#define _IPC48_ADCURDYIS_POSITION                0x00000010
//#define _IPC48_ADCURDYIS_MASK                    0x00030000
//#define _IPC48_ADCURDYIS_LENGTH                  0x00000002

