HomuraVehicle/homuraLib_v2/machine/device/p32mz2048efg100_forVC.c
//#define _IPC48_ADCURDYIP_POSITION                0x00000012
//#define _IPC48_ADCURDYIP_MASK                    0x001C0000
//#define _IPC48_ADCURDYIP_LENGTH                  0x00000003

//#define _IPC48_w_POSITION                        0x00000000
//#define _IPC48_w_MASK                            0xFFFFFFFF
//#define _IPC48_w_LENGTH                          0x00000020

//#define _IPC49_ADCGRPIS_POSITION                 0x00000000
//#define _IPC49_ADCGRPIS_MASK                     0x00000003
//#define _IPC49_ADCGRPIS_LENGTH                   0x00000002

//#define _IPC49_ADCGRPIP_POSITION                 0x00000002
//#define _IPC49_ADCGRPIP_MASK                     0x0000001C
//#define _IPC49_ADCGRPIP_LENGTH                   0x00000003

//#define _IPC49_ADC0EIS_POSITION                  0x00000010
//#define _IPC49_ADC0EIS_MASK                      0x00030000
//#define _IPC49_ADC0EIS_LENGTH                    0x00000002

//#define _IPC49_ADC0EIP_POSITION                  0x00000012
//#define _IPC49_ADC0EIP_MASK                      0x001C0000
//#define _IPC49_ADC0EIP_LENGTH                    0x00000003

//#define _IPC49_ADC1EIS_POSITION                  0x00000018
//#define _IPC49_ADC1EIS_MASK                      0x03000000
//#define _IPC49_ADC1EIS_LENGTH                    0x00000002

//#define _IPC49_ADC1EIP_POSITION                  0x0000001A
//#define _IPC49_ADC1EIP_MASK                      0x1C000000
//#define _IPC49_ADC1EIP_LENGTH                    0x00000003

//#define _IPC49_w_POSITION                        0x00000000
//#define _IPC49_w_MASK                            0xFFFFFFFF
//#define _IPC49_w_LENGTH                          0x00000020

//#define _IPC50_ADC2EIS_POSITION                  0x00000000
//#define _IPC50_ADC2EIS_MASK                      0x00000003
//#define _IPC50_ADC2EIS_LENGTH                    0x00000002

//#define _IPC50_ADC2EIP_POSITION                  0x00000002
//#define _IPC50_ADC2EIP_MASK                      0x0000001C
//#define _IPC50_ADC2EIP_LENGTH                    0x00000003

//#define _IPC50_ADC3EIS_POSITION                  0x00000008
//#define _IPC50_ADC3EIS_MASK                      0x00000300
//#define _IPC50_ADC3EIS_LENGTH                    0x00000002

//#define _IPC50_ADC3EIP_POSITION                  0x0000000A
//#define _IPC50_ADC3EIP_MASK                      0x00001C00
//#define _IPC50_ADC3EIP_LENGTH                    0x00000003

//#define _IPC50_ADC4EIS_POSITION                  0x00000010
//#define _IPC50_ADC4EIS_MASK                      0x00030000
//#define _IPC50_ADC4EIS_LENGTH                    0x00000002

//#define _IPC50_ADC4EIP_POSITION                  0x00000012
//#define _IPC50_ADC4EIP_MASK                      0x001C0000
//#define _IPC50_ADC4EIP_LENGTH                    0x00000003

//#define _IPC50_w_POSITION                        0x00000000
//#define _IPC50_w_MASK                            0xFFFFFFFF
//#define _IPC50_w_LENGTH                          0x00000020

//#define _IPC51_ADC7EIS_POSITION                  0x00000008
//#define _IPC51_ADC7EIS_MASK                      0x00000300
//#define _IPC51_ADC7EIS_LENGTH                    0x00000002

//#define _IPC51_ADC7EIP_POSITION                  0x0000000A
//#define _IPC51_ADC7EIP_MASK                      0x00001C00
//#define _IPC51_ADC7EIP_LENGTH                    0x00000003

//#define _IPC51_ADC0WIS_POSITION                  0x00000010
//#define _IPC51_ADC0WIS_MASK                      0x00030000
//#define _IPC51_ADC0WIS_LENGTH                    0x00000002

//#define _IPC51_ADC0WIP_POSITION                  0x00000012
//#define _IPC51_ADC0WIP_MASK                      0x001C0000
//#define _IPC51_ADC0WIP_LENGTH                    0x00000003

//#define _IPC51_ADC1WIS_POSITION                  0x00000018
//#define _IPC51_ADC1WIS_MASK                      0x03000000
//#define _IPC51_ADC1WIS_LENGTH                    0x00000002

//#define _IPC51_ADC1WIP_POSITION                  0x0000001A
//#define _IPC51_ADC1WIP_MASK                      0x1C000000
//#define _IPC51_ADC1WIP_LENGTH                    0x00000003

//#define _IPC51_w_POSITION                        0x00000000
//#define _IPC51_w_MASK                            0xFFFFFFFF
//#define _IPC51_w_LENGTH                          0x00000020

//#define _IPC52_ADC2WIS_POSITION                  0x00000000
//#define _IPC52_ADC2WIS_MASK                      0x00000003
//#define _IPC52_ADC2WIS_LENGTH                    0x00000002

//#define _IPC52_ADC2WIP_POSITION                  0x00000002
//#define _IPC52_ADC2WIP_MASK                      0x0000001C
//#define _IPC52_ADC2WIP_LENGTH                    0x00000003

//#define _IPC52_ADC3WIS_POSITION                  0x00000008
//#define _IPC52_ADC3WIS_MASK                      0x00000300
//#define _IPC52_ADC3WIS_LENGTH                    0x00000002

//#define _IPC52_ADC3WIP_POSITION                  0x0000000A
//#define _IPC52_ADC3WIP_MASK                      0x00001C00
//#define _IPC52_ADC3WIP_LENGTH                    0x00000003

//#define _IPC52_ADC4WIS_POSITION                  0x00000010
//#define _IPC52_ADC4WIS_MASK                      0x00030000
//#define _IPC52_ADC4WIS_LENGTH                    0x00000002

//#define _IPC52_ADC4WIP_POSITION                  0x00000012
//#define _IPC52_ADC4WIP_MASK                      0x001C0000
//#define _IPC52_ADC4WIP_LENGTH                    0x00000003

//#define _IPC52_w_POSITION                        0x00000000
//#define _IPC52_w_MASK                            0xFFFFFFFF
//#define _IPC52_w_LENGTH                          0x00000020

//#define _IPC53_ADC7WIS_POSITION                  0x00000008
//#define _IPC53_ADC7WIS_MASK                      0x00000300
//#define _IPC53_ADC7WIS_LENGTH                    0x00000002

//#define _IPC53_ADC7WIP_POSITION                  0x0000000A
//#define _IPC53_ADC7WIP_MASK                      0x00001C00
//#define _IPC53_ADC7WIP_LENGTH                    0x00000003

//#define _IPC53_w_POSITION                        0x00000000
//#define _IPC53_w_MASK                            0xFFFFFFFF
//#define _IPC53_w_LENGTH                          0x00000020

//#define _OFF000_VOFF_POSITION                    0x00000001
//#define _OFF000_VOFF_MASK                        0x0003FFFE
//#define _OFF000_VOFF_LENGTH                      0x00000011

//#define _OFF001_VOFF_POSITION                    0x00000001
//#define _OFF001_VOFF_MASK                        0x0003FFFE
//#define _OFF001_VOFF_LENGTH                      0x00000011

//#define _OFF002_VOFF_POSITION                    0x00000001
//#define _OFF002_VOFF_MASK                        0x0003FFFE
//#define _OFF002_VOFF_LENGTH                      0x00000011

//#define _OFF003_VOFF_POSITION                    0x00000001
//#define _OFF003_VOFF_MASK                        0x0003FFFE
//#define _OFF003_VOFF_LENGTH                      0x00000011

