HomuraVehicle/homuraLib_v2/machine/device/p32mz2048efg100_forVC.c
//#define _OFF004_VOFF_POSITION                    0x00000001
//#define _OFF004_VOFF_MASK                        0x0003FFFE
//#define _OFF004_VOFF_LENGTH                      0x00000011

//#define _OFF005_VOFF_POSITION                    0x00000001
//#define _OFF005_VOFF_MASK                        0x0003FFFE
//#define _OFF005_VOFF_LENGTH                      0x00000011

//#define _OFF006_VOFF_POSITION                    0x00000001
//#define _OFF006_VOFF_MASK                        0x0003FFFE
//#define _OFF006_VOFF_LENGTH                      0x00000011

//#define _OFF007_VOFF_POSITION                    0x00000001
//#define _OFF007_VOFF_MASK                        0x0003FFFE
//#define _OFF007_VOFF_LENGTH                      0x00000011

//#define _OFF008_VOFF_POSITION                    0x00000001
//#define _OFF008_VOFF_MASK                        0x0003FFFE
//#define _OFF008_VOFF_LENGTH                      0x00000011

//#define _OFF009_VOFF_POSITION                    0x00000001
//#define _OFF009_VOFF_MASK                        0x0003FFFE
//#define _OFF009_VOFF_LENGTH                      0x00000011

//#define _OFF010_VOFF_POSITION                    0x00000001
//#define _OFF010_VOFF_MASK                        0x0003FFFE
//#define _OFF010_VOFF_LENGTH                      0x00000011

//#define _OFF011_VOFF_POSITION                    0x00000001
//#define _OFF011_VOFF_MASK                        0x0003FFFE
//#define _OFF011_VOFF_LENGTH                      0x00000011

//#define _OFF012_VOFF_POSITION                    0x00000001
//#define _OFF012_VOFF_MASK                        0x0003FFFE
//#define _OFF012_VOFF_LENGTH                      0x00000011

//#define _OFF013_VOFF_POSITION                    0x00000001
//#define _OFF013_VOFF_MASK                        0x0003FFFE
//#define _OFF013_VOFF_LENGTH                      0x00000011

//#define _OFF014_VOFF_POSITION                    0x00000001
//#define _OFF014_VOFF_MASK                        0x0003FFFE
//#define _OFF014_VOFF_LENGTH                      0x00000011

//#define _OFF015_VOFF_POSITION                    0x00000001
//#define _OFF015_VOFF_MASK                        0x0003FFFE
//#define _OFF015_VOFF_LENGTH                      0x00000011

//#define _OFF016_VOFF_POSITION                    0x00000001
//#define _OFF016_VOFF_MASK                        0x0003FFFE
//#define _OFF016_VOFF_LENGTH                      0x00000011

//#define _OFF017_VOFF_POSITION                    0x00000001
//#define _OFF017_VOFF_MASK                        0x0003FFFE
//#define _OFF017_VOFF_LENGTH                      0x00000011

//#define _OFF018_VOFF_POSITION                    0x00000001
//#define _OFF018_VOFF_MASK                        0x0003FFFE
//#define _OFF018_VOFF_LENGTH                      0x00000011

//#define _OFF019_VOFF_POSITION                    0x00000001
//#define _OFF019_VOFF_MASK                        0x0003FFFE
//#define _OFF019_VOFF_LENGTH                      0x00000011

//#define _OFF020_VOFF_POSITION                    0x00000001
//#define _OFF020_VOFF_MASK                        0x0003FFFE
//#define _OFF020_VOFF_LENGTH                      0x00000011

//#define _OFF021_VOFF_POSITION                    0x00000001
//#define _OFF021_VOFF_MASK                        0x0003FFFE
//#define _OFF021_VOFF_LENGTH                      0x00000011

//#define _OFF022_VOFF_POSITION                    0x00000001
//#define _OFF022_VOFF_MASK                        0x0003FFFE
//#define _OFF022_VOFF_LENGTH                      0x00000011

//#define _OFF023_VOFF_POSITION                    0x00000001
//#define _OFF023_VOFF_MASK                        0x0003FFFE
//#define _OFF023_VOFF_LENGTH                      0x00000011

//#define _OFF024_VOFF_POSITION                    0x00000001
//#define _OFF024_VOFF_MASK                        0x0003FFFE
//#define _OFF024_VOFF_LENGTH                      0x00000011

//#define _OFF025_VOFF_POSITION                    0x00000001
//#define _OFF025_VOFF_MASK                        0x0003FFFE
//#define _OFF025_VOFF_LENGTH                      0x00000011

//#define _OFF026_VOFF_POSITION                    0x00000001
//#define _OFF026_VOFF_MASK                        0x0003FFFE
//#define _OFF026_VOFF_LENGTH                      0x00000011

//#define _OFF027_VOFF_POSITION                    0x00000001
//#define _OFF027_VOFF_MASK                        0x0003FFFE
//#define _OFF027_VOFF_LENGTH                      0x00000011

//#define _OFF028_VOFF_POSITION                    0x00000001
//#define _OFF028_VOFF_MASK                        0x0003FFFE
//#define _OFF028_VOFF_LENGTH                      0x00000011

//#define _OFF029_VOFF_POSITION                    0x00000001
//#define _OFF029_VOFF_MASK                        0x0003FFFE
//#define _OFF029_VOFF_LENGTH                      0x00000011

//#define _OFF030_VOFF_POSITION                    0x00000001
//#define _OFF030_VOFF_MASK                        0x0003FFFE
//#define _OFF030_VOFF_LENGTH                      0x00000011

//#define _OFF031_VOFF_POSITION                    0x00000001
//#define _OFF031_VOFF_MASK                        0x0003FFFE
//#define _OFF031_VOFF_LENGTH                      0x00000011

//#define _OFF032_VOFF_POSITION                    0x00000001
//#define _OFF032_VOFF_MASK                        0x0003FFFE
//#define _OFF032_VOFF_LENGTH                      0x00000011

//#define _OFF033_VOFF_POSITION                    0x00000001
//#define _OFF033_VOFF_MASK                        0x0003FFFE
//#define _OFF033_VOFF_LENGTH                      0x00000011

//#define _OFF034_VOFF_POSITION                    0x00000001
//#define _OFF034_VOFF_MASK                        0x0003FFFE
//#define _OFF034_VOFF_LENGTH                      0x00000011

//#define _OFF035_VOFF_POSITION                    0x00000001
//#define _OFF035_VOFF_MASK                        0x0003FFFE
//#define _OFF035_VOFF_LENGTH                      0x00000011

//#define _OFF036_VOFF_POSITION                    0x00000001
//#define _OFF036_VOFF_MASK                        0x0003FFFE
//#define _OFF036_VOFF_LENGTH                      0x00000011

