HomuraVehicle/homuraLib_v2/machine/device/p32mz2048efg100_forVC.c
//#define _OFF074_VOFF_POSITION                    0x00000001
//#define _OFF074_VOFF_MASK                        0x0003FFFE
//#define _OFF074_VOFF_LENGTH                      0x00000011

//#define _OFF075_VOFF_POSITION                    0x00000001
//#define _OFF075_VOFF_MASK                        0x0003FFFE
//#define _OFF075_VOFF_LENGTH                      0x00000011

//#define _OFF076_VOFF_POSITION                    0x00000001
//#define _OFF076_VOFF_MASK                        0x0003FFFE
//#define _OFF076_VOFF_LENGTH                      0x00000011

//#define _OFF077_VOFF_POSITION                    0x00000001
//#define _OFF077_VOFF_MASK                        0x0003FFFE
//#define _OFF077_VOFF_LENGTH                      0x00000011

//#define _OFF078_VOFF_POSITION                    0x00000001
//#define _OFF078_VOFF_MASK                        0x0003FFFE
//#define _OFF078_VOFF_LENGTH                      0x00000011

//#define _OFF079_VOFF_POSITION                    0x00000001
//#define _OFF079_VOFF_MASK                        0x0003FFFE
//#define _OFF079_VOFF_LENGTH                      0x00000011

//#define _OFF080_VOFF_POSITION                    0x00000001
//#define _OFF080_VOFF_MASK                        0x0003FFFE
//#define _OFF080_VOFF_LENGTH                      0x00000011

//#define _OFF081_VOFF_POSITION                    0x00000001
//#define _OFF081_VOFF_MASK                        0x0003FFFE
//#define _OFF081_VOFF_LENGTH                      0x00000011

//#define _OFF082_VOFF_POSITION                    0x00000001
//#define _OFF082_VOFF_MASK                        0x0003FFFE
//#define _OFF082_VOFF_LENGTH                      0x00000011

//#define _OFF083_VOFF_POSITION                    0x00000001
//#define _OFF083_VOFF_MASK                        0x0003FFFE
//#define _OFF083_VOFF_LENGTH                      0x00000011

//#define _OFF084_VOFF_POSITION                    0x00000001
//#define _OFF084_VOFF_MASK                        0x0003FFFE
//#define _OFF084_VOFF_LENGTH                      0x00000011

//#define _OFF085_VOFF_POSITION                    0x00000001
//#define _OFF085_VOFF_MASK                        0x0003FFFE
//#define _OFF085_VOFF_LENGTH                      0x00000011

//#define _OFF086_VOFF_POSITION                    0x00000001
//#define _OFF086_VOFF_MASK                        0x0003FFFE
//#define _OFF086_VOFF_LENGTH                      0x00000011

//#define _OFF087_VOFF_POSITION                    0x00000001
//#define _OFF087_VOFF_MASK                        0x0003FFFE
//#define _OFF087_VOFF_LENGTH                      0x00000011

//#define _OFF088_VOFF_POSITION                    0x00000001
//#define _OFF088_VOFF_MASK                        0x0003FFFE
//#define _OFF088_VOFF_LENGTH                      0x00000011

//#define _OFF089_VOFF_POSITION                    0x00000001
//#define _OFF089_VOFF_MASK                        0x0003FFFE
//#define _OFF089_VOFF_LENGTH                      0x00000011

//#define _OFF090_VOFF_POSITION                    0x00000001
//#define _OFF090_VOFF_MASK                        0x0003FFFE
//#define _OFF090_VOFF_LENGTH                      0x00000011

//#define _OFF091_VOFF_POSITION                    0x00000001
//#define _OFF091_VOFF_MASK                        0x0003FFFE
//#define _OFF091_VOFF_LENGTH                      0x00000011

//#define _OFF092_VOFF_POSITION                    0x00000001
//#define _OFF092_VOFF_MASK                        0x0003FFFE
//#define _OFF092_VOFF_LENGTH                      0x00000011

//#define _OFF093_VOFF_POSITION                    0x00000001
//#define _OFF093_VOFF_MASK                        0x0003FFFE
//#define _OFF093_VOFF_LENGTH                      0x00000011

//#define _OFF102_VOFF_POSITION                    0x00000001
//#define _OFF102_VOFF_MASK                        0x0003FFFE
//#define _OFF102_VOFF_LENGTH                      0x00000011

//#define _OFF103_VOFF_POSITION                    0x00000001
//#define _OFF103_VOFF_MASK                        0x0003FFFE
//#define _OFF103_VOFF_LENGTH                      0x00000011

//#define _OFF104_VOFF_POSITION                    0x00000001
//#define _OFF104_VOFF_MASK                        0x0003FFFE
//#define _OFF104_VOFF_LENGTH                      0x00000011

//#define _OFF105_VOFF_POSITION                    0x00000001
//#define _OFF105_VOFF_MASK                        0x0003FFFE
//#define _OFF105_VOFF_LENGTH                      0x00000011

//#define _OFF106_VOFF_POSITION                    0x00000001
//#define _OFF106_VOFF_MASK                        0x0003FFFE
//#define _OFF106_VOFF_LENGTH                      0x00000011

//#define _OFF109_VOFF_POSITION                    0x00000001
//#define _OFF109_VOFF_MASK                        0x0003FFFE
//#define _OFF109_VOFF_LENGTH                      0x00000011

//#define _OFF110_VOFF_POSITION                    0x00000001
//#define _OFF110_VOFF_MASK                        0x0003FFFE
//#define _OFF110_VOFF_LENGTH                      0x00000011

//#define _OFF111_VOFF_POSITION                    0x00000001
//#define _OFF111_VOFF_MASK                        0x0003FFFE
//#define _OFF111_VOFF_LENGTH                      0x00000011

//#define _OFF112_VOFF_POSITION                    0x00000001
//#define _OFF112_VOFF_MASK                        0x0003FFFE
//#define _OFF112_VOFF_LENGTH                      0x00000011

//#define _OFF113_VOFF_POSITION                    0x00000001
//#define _OFF113_VOFF_MASK                        0x0003FFFE
//#define _OFF113_VOFF_LENGTH                      0x00000011

//#define _OFF114_VOFF_POSITION                    0x00000001
//#define _OFF114_VOFF_MASK                        0x0003FFFE
//#define _OFF114_VOFF_LENGTH                      0x00000011

//#define _OFF115_VOFF_POSITION                    0x00000001
//#define _OFF115_VOFF_MASK                        0x0003FFFE
//#define _OFF115_VOFF_LENGTH                      0x00000011

//#define _OFF116_VOFF_POSITION                    0x00000001
//#define _OFF116_VOFF_MASK                        0x0003FFFE
//#define _OFF116_VOFF_LENGTH                      0x00000011

//#define _OFF117_VOFF_POSITION                    0x00000001
//#define _OFF117_VOFF_MASK                        0x0003FFFE
//#define _OFF117_VOFF_LENGTH                      0x00000011

//#define _OFF118_VOFF_POSITION                    0x00000001
//#define _OFF118_VOFF_MASK                        0x0003FFFE
//#define _OFF118_VOFF_LENGTH                      0x00000011

//#define _OFF119_VOFF_POSITION                    0x00000001
//#define _OFF119_VOFF_MASK                        0x0003FFFE
//#define _OFF119_VOFF_LENGTH                      0x00000011

