HomuraVehicle/homuraLib_v2/machine/device/p32mz2048efg100_forVC.c
//#define _OFF198_VOFF_POSITION                    0x00000001
//#define _OFF198_VOFF_MASK                        0x0003FFFE
//#define _OFF198_VOFF_LENGTH                      0x00000011

//#define _OFF199_VOFF_POSITION                    0x00000001
//#define _OFF199_VOFF_MASK                        0x0003FFFE
//#define _OFF199_VOFF_LENGTH                      0x00000011

//#define _OFF200_VOFF_POSITION                    0x00000001
//#define _OFF200_VOFF_MASK                        0x0003FFFE
//#define _OFF200_VOFF_LENGTH                      0x00000011

//#define _OFF201_VOFF_POSITION                    0x00000001
//#define _OFF201_VOFF_MASK                        0x0003FFFE
//#define _OFF201_VOFF_LENGTH                      0x00000011

//#define _OFF202_VOFF_POSITION                    0x00000001
//#define _OFF202_VOFF_MASK                        0x0003FFFE
//#define _OFF202_VOFF_LENGTH                      0x00000011

//#define _OFF205_VOFF_POSITION                    0x00000001
//#define _OFF205_VOFF_MASK                        0x0003FFFE
//#define _OFF205_VOFF_LENGTH                      0x00000011

//#define _OFF206_VOFF_POSITION                    0x00000001
//#define _OFF206_VOFF_MASK                        0x0003FFFE
//#define _OFF206_VOFF_LENGTH                      0x00000011

//#define _OFF207_VOFF_POSITION                    0x00000001
//#define _OFF207_VOFF_MASK                        0x0003FFFE
//#define _OFF207_VOFF_LENGTH                      0x00000011

//#define _OFF208_VOFF_POSITION                    0x00000001
//#define _OFF208_VOFF_MASK                        0x0003FFFE
//#define _OFF208_VOFF_LENGTH                      0x00000011

//#define _OFF209_VOFF_POSITION                    0x00000001
//#define _OFF209_VOFF_MASK                        0x0003FFFE
//#define _OFF209_VOFF_LENGTH                      0x00000011

//#define _OFF210_VOFF_POSITION                    0x00000001
//#define _OFF210_VOFF_MASK                        0x0003FFFE
//#define _OFF210_VOFF_LENGTH                      0x00000011

//#define _OFF213_VOFF_POSITION                    0x00000001
//#define _OFF213_VOFF_MASK                        0x0003FFFE
//#define _OFF213_VOFF_LENGTH                      0x00000011

//#define _DMACON_DMABUSY_POSITION                 0x0000000B
//#define _DMACON_DMABUSY_MASK                     0x00000800
//#define _DMACON_DMABUSY_LENGTH                   0x00000001

//#define _DMACON_SUSPEND_POSITION                 0x0000000C
//#define _DMACON_SUSPEND_MASK                     0x00001000
//#define _DMACON_SUSPEND_LENGTH                   0x00000001

//#define _DMACON_ON_POSITION                      0x0000000F
//#define _DMACON_ON_MASK                          0x00008000
//#define _DMACON_ON_LENGTH                        0x00000001

//#define _DMASTAT_DMACH_POSITION                  0x00000000
//#define _DMASTAT_DMACH_MASK                      0x00000007
//#define _DMASTAT_DMACH_LENGTH                    0x00000003

//#define _DMASTAT_RDWR_POSITION                   0x0000001F
//#define _DMASTAT_RDWR_MASK                       0x80000000
//#define _DMASTAT_RDWR_LENGTH                     0x00000001

//#define _DMAADDR_DMAADDR_POSITION                0x00000000
//#define _DMAADDR_DMAADDR_MASK                    0xFFFFFFFF
//#define _DMAADDR_DMAADDR_LENGTH                  0x00000020

//#define _DCRCCON_CRCCH_POSITION                  0x00000000
//#define _DCRCCON_CRCCH_MASK                      0x00000007
//#define _DCRCCON_CRCCH_LENGTH                    0x00000003

//#define _DCRCCON_CRCTYP_POSITION                 0x00000005
//#define _DCRCCON_CRCTYP_MASK                     0x00000020
//#define _DCRCCON_CRCTYP_LENGTH                   0x00000001

//#define _DCRCCON_CRCAPP_POSITION                 0x00000006
//#define _DCRCCON_CRCAPP_MASK                     0x00000040
//#define _DCRCCON_CRCAPP_LENGTH                   0x00000001

//#define _DCRCCON_CRCEN_POSITION                  0x00000007
//#define _DCRCCON_CRCEN_MASK                      0x00000080
//#define _DCRCCON_CRCEN_LENGTH                    0x00000001

//#define _DCRCCON_PLEN_POSITION                   0x00000008
//#define _DCRCCON_PLEN_MASK                       0x00001F00
//#define _DCRCCON_PLEN_LENGTH                     0x00000005

//#define _DCRCCON_BITO_POSITION                   0x00000018
//#define _DCRCCON_BITO_MASK                       0x01000000
//#define _DCRCCON_BITO_LENGTH                     0x00000001

//#define _DCRCCON_WBO_POSITION                    0x0000001B
//#define _DCRCCON_WBO_MASK                        0x08000000
//#define _DCRCCON_WBO_LENGTH                      0x00000001

//#define _DCRCCON_BYTO_POSITION                   0x0000001C
//#define _DCRCCON_BYTO_MASK                       0x30000000
//#define _DCRCCON_BYTO_LENGTH                     0x00000002

//#define _DCRCDATA_DCRCDATA_POSITION              0x00000000
//#define _DCRCDATA_DCRCDATA_MASK                  0xFFFFFFFF
//#define _DCRCDATA_DCRCDATA_LENGTH                0x00000020

//#define _DCRCXOR_DCRCXOR_POSITION                0x00000000
//#define _DCRCXOR_DCRCXOR_MASK                    0xFFFFFFFF
//#define _DCRCXOR_DCRCXOR_LENGTH                  0x00000020

//#define _DCH0CON_CHPRI_POSITION                  0x00000000
//#define _DCH0CON_CHPRI_MASK                      0x00000003
//#define _DCH0CON_CHPRI_LENGTH                    0x00000002

//#define _DCH0CON_CHEDET_POSITION                 0x00000002
//#define _DCH0CON_CHEDET_MASK                     0x00000004
//#define _DCH0CON_CHEDET_LENGTH                   0x00000001

//#define _DCH0CON_CHAEN_POSITION                  0x00000004
//#define _DCH0CON_CHAEN_MASK                      0x00000010
//#define _DCH0CON_CHAEN_LENGTH                    0x00000001

//#define _DCH0CON_CHCHN_POSITION                  0x00000005
//#define _DCH0CON_CHCHN_MASK                      0x00000020
//#define _DCH0CON_CHCHN_LENGTH                    0x00000001

//#define _DCH0CON_CHAED_POSITION                  0x00000006
//#define _DCH0CON_CHAED_MASK                      0x00000040
//#define _DCH0CON_CHAED_LENGTH                    0x00000001

//#define _DCH0CON_CHEN_POSITION                   0x00000007
//#define _DCH0CON_CHEN_MASK                       0x00000080
//#define _DCH0CON_CHEN_LENGTH                     0x00000001

//#define _DCH0CON_CHCHNS_POSITION                 0x00000008
//#define _DCH0CON_CHCHNS_MASK                     0x00000100
//#define _DCH0CON_CHCHNS_LENGTH                   0x00000001

//#define _DCH0CON_CHPATLEN_POSITION               0x0000000B
//#define _DCH0CON_CHPATLEN_MASK                   0x00000800
//#define _DCH0CON_CHPATLEN_LENGTH                 0x00000001

