HomuraVehicle/homuraLib_v2/machine/device/p32mz2048efg100_forVC.c
//#define _DCH3ECON_CFORCE_POSITION                0x00000007
//#define _DCH3ECON_CFORCE_MASK                    0x00000080
//#define _DCH3ECON_CFORCE_LENGTH                  0x00000001

//#define _DCH3ECON_CHSIRQ_POSITION                0x00000008
//#define _DCH3ECON_CHSIRQ_MASK                    0x0000FF00
//#define _DCH3ECON_CHSIRQ_LENGTH                  0x00000008

//#define _DCH3ECON_CHAIRQ_POSITION                0x00000010
//#define _DCH3ECON_CHAIRQ_MASK                    0x00FF0000
//#define _DCH3ECON_CHAIRQ_LENGTH                  0x00000008

//#define _DCH3INT_CHERIF_POSITION                 0x00000000
//#define _DCH3INT_CHERIF_MASK                     0x00000001
//#define _DCH3INT_CHERIF_LENGTH                   0x00000001

//#define _DCH3INT_CHTAIF_POSITION                 0x00000001
//#define _DCH3INT_CHTAIF_MASK                     0x00000002
//#define _DCH3INT_CHTAIF_LENGTH                   0x00000001

//#define _DCH3INT_CHCCIF_POSITION                 0x00000002
//#define _DCH3INT_CHCCIF_MASK                     0x00000004
//#define _DCH3INT_CHCCIF_LENGTH                   0x00000001

//#define _DCH3INT_CHBCIF_POSITION                 0x00000003
//#define _DCH3INT_CHBCIF_MASK                     0x00000008
//#define _DCH3INT_CHBCIF_LENGTH                   0x00000001

//#define _DCH3INT_CHDHIF_POSITION                 0x00000004
//#define _DCH3INT_CHDHIF_MASK                     0x00000010
//#define _DCH3INT_CHDHIF_LENGTH                   0x00000001

//#define _DCH3INT_CHDDIF_POSITION                 0x00000005
//#define _DCH3INT_CHDDIF_MASK                     0x00000020
//#define _DCH3INT_CHDDIF_LENGTH                   0x00000001

//#define _DCH3INT_CHSHIF_POSITION                 0x00000006
//#define _DCH3INT_CHSHIF_MASK                     0x00000040
//#define _DCH3INT_CHSHIF_LENGTH                   0x00000001

//#define _DCH3INT_CHSDIF_POSITION                 0x00000007
//#define _DCH3INT_CHSDIF_MASK                     0x00000080
//#define _DCH3INT_CHSDIF_LENGTH                   0x00000001

//#define _DCH3INT_CHERIE_POSITION                 0x00000010
//#define _DCH3INT_CHERIE_MASK                     0x00010000
//#define _DCH3INT_CHERIE_LENGTH                   0x00000001

//#define _DCH3INT_CHTAIE_POSITION                 0x00000011
//#define _DCH3INT_CHTAIE_MASK                     0x00020000
//#define _DCH3INT_CHTAIE_LENGTH                   0x00000001

//#define _DCH3INT_CHCCIE_POSITION                 0x00000012
//#define _DCH3INT_CHCCIE_MASK                     0x00040000
//#define _DCH3INT_CHCCIE_LENGTH                   0x00000001

//#define _DCH3INT_CHBCIE_POSITION                 0x00000013
//#define _DCH3INT_CHBCIE_MASK                     0x00080000
//#define _DCH3INT_CHBCIE_LENGTH                   0x00000001

//#define _DCH3INT_CHDHIE_POSITION                 0x00000014
//#define _DCH3INT_CHDHIE_MASK                     0x00100000
//#define _DCH3INT_CHDHIE_LENGTH                   0x00000001

//#define _DCH3INT_CHDDIE_POSITION                 0x00000015
//#define _DCH3INT_CHDDIE_MASK                     0x00200000
//#define _DCH3INT_CHDDIE_LENGTH                   0x00000001

//#define _DCH3INT_CHSHIE_POSITION                 0x00000016
//#define _DCH3INT_CHSHIE_MASK                     0x00400000
//#define _DCH3INT_CHSHIE_LENGTH                   0x00000001

//#define _DCH3INT_CHSDIE_POSITION                 0x00000017
//#define _DCH3INT_CHSDIE_MASK                     0x00800000
//#define _DCH3INT_CHSDIE_LENGTH                   0x00000001

//#define _DCH3SSA_CHSSA_POSITION                  0x00000000
//#define _DCH3SSA_CHSSA_MASK                      0xFFFFFFFF
//#define _DCH3SSA_CHSSA_LENGTH                    0x00000020

//#define _DCH3DSA_CHDSA_POSITION                  0x00000000
//#define _DCH3DSA_CHDSA_MASK                      0xFFFFFFFF
//#define _DCH3DSA_CHDSA_LENGTH                    0x00000020

//#define _DCH3SSIZ_CHSSIZ_POSITION                0x00000000
//#define _DCH3SSIZ_CHSSIZ_MASK                    0x0000FFFF
//#define _DCH3SSIZ_CHSSIZ_LENGTH                  0x00000010

//#define _DCH3DSIZ_CHDSIZ_POSITION                0x00000000
//#define _DCH3DSIZ_CHDSIZ_MASK                    0x0000FFFF
//#define _DCH3DSIZ_CHDSIZ_LENGTH                  0x00000010

//#define _DCH3SPTR_CHSPTR_POSITION                0x00000000
//#define _DCH3SPTR_CHSPTR_MASK                    0x0000FFFF
//#define _DCH3SPTR_CHSPTR_LENGTH                  0x00000010

//#define _DCH3DPTR_CHDPTR_POSITION                0x00000000
//#define _DCH3DPTR_CHDPTR_MASK                    0x0000FFFF
//#define _DCH3DPTR_CHDPTR_LENGTH                  0x00000010

//#define _DCH3CSIZ_CHCSIZ_POSITION                0x00000000
//#define _DCH3CSIZ_CHCSIZ_MASK                    0x0000FFFF
//#define _DCH3CSIZ_CHCSIZ_LENGTH                  0x00000010

//#define _DCH3CPTR_CHCPTR_POSITION                0x00000000
//#define _DCH3CPTR_CHCPTR_MASK                    0x0000FFFF
//#define _DCH3CPTR_CHCPTR_LENGTH                  0x00000010

//#define _DCS3CPTR_CHCPTR_POSITION                0x00000000
//#define _DCS3CPTR_CHCPTR_MASK                    0x0000FFFF
//#define _DCS3CPTR_CHCPTR_LENGTH                  0x00000010

//#define _DCH3DAT_CHPDAT_POSITION                 0x00000000
//#define _DCH3DAT_CHPDAT_MASK                     0x0000FFFF
//#define _DCH3DAT_CHPDAT_LENGTH                   0x00000010

//#define _DCH4CON_CHPRI_POSITION                  0x00000000
//#define _DCH4CON_CHPRI_MASK                      0x00000003
//#define _DCH4CON_CHPRI_LENGTH                    0x00000002

//#define _DCH4CON_CHEDET_POSITION                 0x00000002
//#define _DCH4CON_CHEDET_MASK                     0x00000004
//#define _DCH4CON_CHEDET_LENGTH                   0x00000001

//#define _DCH4CON_CHAEN_POSITION                  0x00000004
//#define _DCH4CON_CHAEN_MASK                      0x00000010
//#define _DCH4CON_CHAEN_LENGTH                    0x00000001

//#define _DCH4CON_CHCHN_POSITION                  0x00000005
//#define _DCH4CON_CHCHN_MASK                      0x00000020
//#define _DCH4CON_CHCHN_LENGTH                    0x00000001

//#define _DCH4CON_CHAED_POSITION                  0x00000006
//#define _DCH4CON_CHAED_MASK                      0x00000040
//#define _DCH4CON_CHAED_LENGTH                    0x00000001

//#define _DCH4CON_CHEN_POSITION                   0x00000007
//#define _DCH4CON_CHEN_MASK                       0x00000080
//#define _DCH4CON_CHEN_LENGTH                     0x00000001

