HomuraVehicle/homuraLib_v2/machine/device/p32mz2048efg100_forVC.c
//#define _DCH7INT_CHDHIF_POSITION                 0x00000004
//#define _DCH7INT_CHDHIF_MASK                     0x00000010
//#define _DCH7INT_CHDHIF_LENGTH                   0x00000001

//#define _DCH7INT_CHDDIF_POSITION                 0x00000005
//#define _DCH7INT_CHDDIF_MASK                     0x00000020
//#define _DCH7INT_CHDDIF_LENGTH                   0x00000001

//#define _DCH7INT_CHSHIF_POSITION                 0x00000006
//#define _DCH7INT_CHSHIF_MASK                     0x00000040
//#define _DCH7INT_CHSHIF_LENGTH                   0x00000001

//#define _DCH7INT_CHSDIF_POSITION                 0x00000007
//#define _DCH7INT_CHSDIF_MASK                     0x00000080
//#define _DCH7INT_CHSDIF_LENGTH                   0x00000001

//#define _DCH7INT_CHERIE_POSITION                 0x00000010
//#define _DCH7INT_CHERIE_MASK                     0x00010000
//#define _DCH7INT_CHERIE_LENGTH                   0x00000001

//#define _DCH7INT_CHTAIE_POSITION                 0x00000011
//#define _DCH7INT_CHTAIE_MASK                     0x00020000
//#define _DCH7INT_CHTAIE_LENGTH                   0x00000001

//#define _DCH7INT_CHCCIE_POSITION                 0x00000012
//#define _DCH7INT_CHCCIE_MASK                     0x00040000
//#define _DCH7INT_CHCCIE_LENGTH                   0x00000001

//#define _DCH7INT_CHBCIE_POSITION                 0x00000013
//#define _DCH7INT_CHBCIE_MASK                     0x00080000
//#define _DCH7INT_CHBCIE_LENGTH                   0x00000001

//#define _DCH7INT_CHDHIE_POSITION                 0x00000014
//#define _DCH7INT_CHDHIE_MASK                     0x00100000
//#define _DCH7INT_CHDHIE_LENGTH                   0x00000001

//#define _DCH7INT_CHDDIE_POSITION                 0x00000015
//#define _DCH7INT_CHDDIE_MASK                     0x00200000
//#define _DCH7INT_CHDDIE_LENGTH                   0x00000001

//#define _DCH7INT_CHSHIE_POSITION                 0x00000016
//#define _DCH7INT_CHSHIE_MASK                     0x00400000
//#define _DCH7INT_CHSHIE_LENGTH                   0x00000001

//#define _DCH7INT_CHSDIE_POSITION                 0x00000017
//#define _DCH7INT_CHSDIE_MASK                     0x00800000
//#define _DCH7INT_CHSDIE_LENGTH                   0x00000001

//#define _DCH7SSA_CHSSA_POSITION                  0x00000000
//#define _DCH7SSA_CHSSA_MASK                      0xFFFFFFFF
//#define _DCH7SSA_CHSSA_LENGTH                    0x00000020

//#define _DCH7DSA_CHDSA_POSITION                  0x00000000
//#define _DCH7DSA_CHDSA_MASK                      0xFFFFFFFF
//#define _DCH7DSA_CHDSA_LENGTH                    0x00000020

//#define _DCH7SSIZ_CHSSIZ_POSITION                0x00000000
//#define _DCH7SSIZ_CHSSIZ_MASK                    0x0000FFFF
//#define _DCH7SSIZ_CHSSIZ_LENGTH                  0x00000010

//#define _DCH7DSIZ_CHDSIZ_POSITION                0x00000000
//#define _DCH7DSIZ_CHDSIZ_MASK                    0x0000FFFF
//#define _DCH7DSIZ_CHDSIZ_LENGTH                  0x00000010

//#define _DCH7SPTR_CHSPTR_POSITION                0x00000000
//#define _DCH7SPTR_CHSPTR_MASK                    0x0000FFFF
//#define _DCH7SPTR_CHSPTR_LENGTH                  0x00000010

//#define _DCH7DPTR_CHDPTR_POSITION                0x00000000
//#define _DCH7DPTR_CHDPTR_MASK                    0x0000FFFF
//#define _DCH7DPTR_CHDPTR_LENGTH                  0x00000010

//#define _DCH7CSIZ_CHCSIZ_POSITION                0x00000000
//#define _DCH7CSIZ_CHCSIZ_MASK                    0x0000FFFF
//#define _DCH7CSIZ_CHCSIZ_LENGTH                  0x00000010

//#define _DCH7CPTR_CHCPTR_POSITION                0x00000000
//#define _DCH7CPTR_CHCPTR_MASK                    0x0000FFFF
//#define _DCH7CPTR_CHCPTR_LENGTH                  0x00000010

//#define _DCS7CPTR_CHCPTR_POSITION                0x00000000
//#define _DCS7CPTR_CHCPTR_MASK                    0x0000FFFF
//#define _DCS7CPTR_CHCPTR_LENGTH                  0x00000010

//#define _DCH7DAT_CHPDAT_POSITION                 0x00000000
//#define _DCH7DAT_CHPDAT_MASK                     0x0000FFFF
//#define _DCH7DAT_CHPDAT_LENGTH                   0x00000010

//#define _I2C1CON_SEN_POSITION                    0x00000000
//#define _I2C1CON_SEN_MASK                        0x00000001
//#define _I2C1CON_SEN_LENGTH                      0x00000001

//#define _I2C1CON_RSEN_POSITION                   0x00000001
//#define _I2C1CON_RSEN_MASK                       0x00000002
//#define _I2C1CON_RSEN_LENGTH                     0x00000001

//#define _I2C1CON_PEN_POSITION                    0x00000002
//#define _I2C1CON_PEN_MASK                        0x00000004
//#define _I2C1CON_PEN_LENGTH                      0x00000001

//#define _I2C1CON_RCEN_POSITION                   0x00000003
//#define _I2C1CON_RCEN_MASK                       0x00000008
//#define _I2C1CON_RCEN_LENGTH                     0x00000001

//#define _I2C1CON_ACKEN_POSITION                  0x00000004
//#define _I2C1CON_ACKEN_MASK                      0x00000010
//#define _I2C1CON_ACKEN_LENGTH                    0x00000001

//#define _I2C1CON_ACKDT_POSITION                  0x00000005
//#define _I2C1CON_ACKDT_MASK                      0x00000020
//#define _I2C1CON_ACKDT_LENGTH                    0x00000001

//#define _I2C1CON_STREN_POSITION                  0x00000006
//#define _I2C1CON_STREN_MASK                      0x00000040
//#define _I2C1CON_STREN_LENGTH                    0x00000001

//#define _I2C1CON_GCEN_POSITION                   0x00000007
//#define _I2C1CON_GCEN_MASK                       0x00000080
//#define _I2C1CON_GCEN_LENGTH                     0x00000001

//#define _I2C1CON_SMEN_POSITION                   0x00000008
//#define _I2C1CON_SMEN_MASK                       0x00000100
//#define _I2C1CON_SMEN_LENGTH                     0x00000001

//#define _I2C1CON_DISSLW_POSITION                 0x00000009
//#define _I2C1CON_DISSLW_MASK                     0x00000200
//#define _I2C1CON_DISSLW_LENGTH                   0x00000001

//#define _I2C1CON_A10M_POSITION                   0x0000000A
//#define _I2C1CON_A10M_MASK                       0x00000400
//#define _I2C1CON_A10M_LENGTH                     0x00000001

//#define _I2C1CON_STRICT_POSITION                 0x0000000B
//#define _I2C1CON_STRICT_MASK                     0x00000800
//#define _I2C1CON_STRICT_LENGTH                   0x00000001

//#define _I2C1CON_SCLREL_POSITION                 0x0000000C
//#define _I2C1CON_SCLREL_MASK                     0x00001000
//#define _I2C1CON_SCLREL_LENGTH                   0x00000001

