HomuraVehicle/homuraLib_v2/machine/device/p32mz2048efg100_forVC.c
//#define _I2C3STAT_TBF_POSITION                   0x00000000
//#define _I2C3STAT_TBF_MASK                       0x00000001
//#define _I2C3STAT_TBF_LENGTH                     0x00000001

//#define _I2C3STAT_RBF_POSITION                   0x00000001
//#define _I2C3STAT_RBF_MASK                       0x00000002
//#define _I2C3STAT_RBF_LENGTH                     0x00000001

//#define _I2C3STAT_R_W_POSITION                   0x00000002
//#define _I2C3STAT_R_W_MASK                       0x00000004
//#define _I2C3STAT_R_W_LENGTH                     0x00000001

//#define _I2C3STAT_S_POSITION                     0x00000003
//#define _I2C3STAT_S_MASK                         0x00000008
//#define _I2C3STAT_S_LENGTH                       0x00000001

//#define _I2C3STAT_P_POSITION                     0x00000004
//#define _I2C3STAT_P_MASK                         0x00000010
//#define _I2C3STAT_P_LENGTH                       0x00000001

//#define _I2C3STAT_D_A_POSITION                   0x00000005
//#define _I2C3STAT_D_A_MASK                       0x00000020
//#define _I2C3STAT_D_A_LENGTH                     0x00000001

//#define _I2C3STAT_I2COV_POSITION                 0x00000006
//#define _I2C3STAT_I2COV_MASK                     0x00000040
//#define _I2C3STAT_I2COV_LENGTH                   0x00000001

//#define _I2C3STAT_IWCOL_POSITION                 0x00000007
//#define _I2C3STAT_IWCOL_MASK                     0x00000080
//#define _I2C3STAT_IWCOL_LENGTH                   0x00000001

//#define _I2C3STAT_ADD10_POSITION                 0x00000008
//#define _I2C3STAT_ADD10_MASK                     0x00000100
//#define _I2C3STAT_ADD10_LENGTH                   0x00000001

//#define _I2C3STAT_GCSTAT_POSITION                0x00000009
//#define _I2C3STAT_GCSTAT_MASK                    0x00000200
//#define _I2C3STAT_GCSTAT_LENGTH                  0x00000001

//#define _I2C3STAT_BCL_POSITION                   0x0000000A
//#define _I2C3STAT_BCL_MASK                       0x00000400
//#define _I2C3STAT_BCL_LENGTH                     0x00000001

//#define _I2C3STAT_ACKTIM_POSITION                0x0000000D
//#define _I2C3STAT_ACKTIM_MASK                    0x00002000
//#define _I2C3STAT_ACKTIM_LENGTH                  0x00000001

//#define _I2C3STAT_TRSTAT_POSITION                0x0000000E
//#define _I2C3STAT_TRSTAT_MASK                    0x00004000
//#define _I2C3STAT_TRSTAT_LENGTH                  0x00000001

//#define _I2C3STAT_ACKSTAT_POSITION               0x0000000F
//#define _I2C3STAT_ACKSTAT_MASK                   0x00008000
//#define _I2C3STAT_ACKSTAT_LENGTH                 0x00000001

//#define _I2C3STAT_I2CPOV_POSITION                0x00000006
//#define _I2C3STAT_I2CPOV_MASK                    0x00000040
//#define _I2C3STAT_I2CPOV_LENGTH                  0x00000001

//#define _I2C3ADD_I2CADD_POSITION                 0x00000000
//#define _I2C3ADD_I2CADD_MASK                     0x000003FF
//#define _I2C3ADD_I2CADD_LENGTH                   0x0000000A

//#define _I2C3MSK_I2CMSK_POSITION                 0x00000000
//#define _I2C3MSK_I2CMSK_MASK                     0x000003FF
//#define _I2C3MSK_I2CMSK_LENGTH                   0x0000000A

//#define _I2C3MSK_AMSK_POSITION                   0x00000000
//#define _I2C3MSK_AMSK_MASK                       0x000003FF
//#define _I2C3MSK_AMSK_LENGTH                     0x0000000A

//#define _I2C3BRG_I2CBRG_POSITION                 0x00000000
//#define _I2C3BRG_I2CBRG_MASK                     0x0000FFFF
//#define _I2C3BRG_I2CBRG_LENGTH                   0x00000010

//#define _I2C3TRN_I2CTRN_POSITION                 0x00000000
//#define _I2C3TRN_I2CTRN_MASK                     0x000000FF
//#define _I2C3TRN_I2CTRN_LENGTH                   0x00000008

//#define _I2C3RCV_I2CRCV_POSITION                 0x00000000
//#define _I2C3RCV_I2CRCV_MASK                     0x000000FF
//#define _I2C3RCV_I2CRCV_LENGTH                   0x00000008

//#define _I2C4CON_SEN_POSITION                    0x00000000
//#define _I2C4CON_SEN_MASK                        0x00000001
//#define _I2C4CON_SEN_LENGTH                      0x00000001

//#define _I2C4CON_RSEN_POSITION                   0x00000001
//#define _I2C4CON_RSEN_MASK                       0x00000002
//#define _I2C4CON_RSEN_LENGTH                     0x00000001

//#define _I2C4CON_PEN_POSITION                    0x00000002
//#define _I2C4CON_PEN_MASK                        0x00000004
//#define _I2C4CON_PEN_LENGTH                      0x00000001

//#define _I2C4CON_RCEN_POSITION                   0x00000003
//#define _I2C4CON_RCEN_MASK                       0x00000008
//#define _I2C4CON_RCEN_LENGTH                     0x00000001

//#define _I2C4CON_ACKEN_POSITION                  0x00000004
//#define _I2C4CON_ACKEN_MASK                      0x00000010
//#define _I2C4CON_ACKEN_LENGTH                    0x00000001

//#define _I2C4CON_ACKDT_POSITION                  0x00000005
//#define _I2C4CON_ACKDT_MASK                      0x00000020
//#define _I2C4CON_ACKDT_LENGTH                    0x00000001

//#define _I2C4CON_STREN_POSITION                  0x00000006
//#define _I2C4CON_STREN_MASK                      0x00000040
//#define _I2C4CON_STREN_LENGTH                    0x00000001

//#define _I2C4CON_GCEN_POSITION                   0x00000007
//#define _I2C4CON_GCEN_MASK                       0x00000080
//#define _I2C4CON_GCEN_LENGTH                     0x00000001

//#define _I2C4CON_SMEN_POSITION                   0x00000008
//#define _I2C4CON_SMEN_MASK                       0x00000100
//#define _I2C4CON_SMEN_LENGTH                     0x00000001

//#define _I2C4CON_DISSLW_POSITION                 0x00000009
//#define _I2C4CON_DISSLW_MASK                     0x00000200
//#define _I2C4CON_DISSLW_LENGTH                   0x00000001

//#define _I2C4CON_A10M_POSITION                   0x0000000A
//#define _I2C4CON_A10M_MASK                       0x00000400
//#define _I2C4CON_A10M_LENGTH                     0x00000001

//#define _I2C4CON_STRICT_POSITION                 0x0000000B
//#define _I2C4CON_STRICT_MASK                     0x00000800
//#define _I2C4CON_STRICT_LENGTH                   0x00000001

//#define _I2C4CON_SCLREL_POSITION                 0x0000000C
//#define _I2C4CON_SCLREL_MASK                     0x00001000
//#define _I2C4CON_SCLREL_LENGTH                   0x00000001

