HomuraVehicle/homuraLib_v2/machine/device/p32mz2048efg100_forVC.c
//#define _SPI3CON_SSEN_POSITION                   0x00000007
//#define _SPI3CON_SSEN_MASK                       0x00000080
//#define _SPI3CON_SSEN_LENGTH                     0x00000001

//#define _SPI3CON_CKE_POSITION                    0x00000008
//#define _SPI3CON_CKE_MASK                        0x00000100
//#define _SPI3CON_CKE_LENGTH                      0x00000001

//#define _SPI3CON_SMP_POSITION                    0x00000009
//#define _SPI3CON_SMP_MASK                        0x00000200
//#define _SPI3CON_SMP_LENGTH                      0x00000001

//#define _SPI3CON_MODE16_POSITION                 0x0000000A
//#define _SPI3CON_MODE16_MASK                     0x00000400
//#define _SPI3CON_MODE16_LENGTH                   0x00000001

//#define _SPI3CON_MODE32_POSITION                 0x0000000B
//#define _SPI3CON_MODE32_MASK                     0x00000800
//#define _SPI3CON_MODE32_LENGTH                   0x00000001

//#define _SPI3CON_DISSDO_POSITION                 0x0000000C
//#define _SPI3CON_DISSDO_MASK                     0x00001000
//#define _SPI3CON_DISSDO_LENGTH                   0x00000001

//#define _SPI3CON_SIDL_POSITION                   0x0000000D
//#define _SPI3CON_SIDL_MASK                       0x00002000
//#define _SPI3CON_SIDL_LENGTH                     0x00000001

//#define _SPI3CON_ON_POSITION                     0x0000000F
//#define _SPI3CON_ON_MASK                         0x00008000
//#define _SPI3CON_ON_LENGTH                       0x00000001

//#define _SPI3CON_ENHBUF_POSITION                 0x00000010
//#define _SPI3CON_ENHBUF_MASK                     0x00010000
//#define _SPI3CON_ENHBUF_LENGTH                   0x00000001

//#define _SPI3CON_SPIFE_POSITION                  0x00000011
//#define _SPI3CON_SPIFE_MASK                      0x00020000
//#define _SPI3CON_SPIFE_LENGTH                    0x00000001

//#define _SPI3CON_MCLKSEL_POSITION                0x00000017
//#define _SPI3CON_MCLKSEL_MASK                    0x00800000
//#define _SPI3CON_MCLKSEL_LENGTH                  0x00000001

//#define _SPI3CON_FRMCNT_POSITION                 0x00000018
//#define _SPI3CON_FRMCNT_MASK                     0x07000000
//#define _SPI3CON_FRMCNT_LENGTH                   0x00000003

//#define _SPI3CON_FRMSYPW_POSITION                0x0000001B
//#define _SPI3CON_FRMSYPW_MASK                    0x08000000
//#define _SPI3CON_FRMSYPW_LENGTH                  0x00000001

//#define _SPI3CON_MSSEN_POSITION                  0x0000001C
//#define _SPI3CON_MSSEN_MASK                      0x10000000
//#define _SPI3CON_MSSEN_LENGTH                    0x00000001

//#define _SPI3CON_FRMPOL_POSITION                 0x0000001D
//#define _SPI3CON_FRMPOL_MASK                     0x20000000
//#define _SPI3CON_FRMPOL_LENGTH                   0x00000001

//#define _SPI3CON_FRMSYNC_POSITION                0x0000001E
//#define _SPI3CON_FRMSYNC_MASK                    0x40000000
//#define _SPI3CON_FRMSYNC_LENGTH                  0x00000001

//#define _SPI3CON_FRMEN_POSITION                  0x0000001F
//#define _SPI3CON_FRMEN_MASK                      0x80000000
//#define _SPI3CON_FRMEN_LENGTH                    0x00000001

//#define _SPI3CON_w_POSITION                      0x00000000
//#define _SPI3CON_w_MASK                          0xFFFFFFFF
//#define _SPI3CON_w_LENGTH                        0x00000020

//#define _SPI3STAT_SPIRBF_POSITION                0x00000000
//#define _SPI3STAT_SPIRBF_MASK                    0x00000001
//#define _SPI3STAT_SPIRBF_LENGTH                  0x00000001

//#define _SPI3STAT_SPITBF_POSITION                0x00000001
//#define _SPI3STAT_SPITBF_MASK                    0x00000002
//#define _SPI3STAT_SPITBF_LENGTH                  0x00000001

//#define _SPI3STAT_SPITBE_POSITION                0x00000003
//#define _SPI3STAT_SPITBE_MASK                    0x00000008
//#define _SPI3STAT_SPITBE_LENGTH                  0x00000001

//#define _SPI3STAT_SPIRBE_POSITION                0x00000005
//#define _SPI3STAT_SPIRBE_MASK                    0x00000020
//#define _SPI3STAT_SPIRBE_LENGTH                  0x00000001

//#define _SPI3STAT_SPIROV_POSITION                0x00000006
//#define _SPI3STAT_SPIROV_MASK                    0x00000040
//#define _SPI3STAT_SPIROV_LENGTH                  0x00000001

//#define _SPI3STAT_SRMT_POSITION                  0x00000007
//#define _SPI3STAT_SRMT_MASK                      0x00000080
//#define _SPI3STAT_SRMT_LENGTH                    0x00000001

//#define _SPI3STAT_SPITUR_POSITION                0x00000008
//#define _SPI3STAT_SPITUR_MASK                    0x00000100
//#define _SPI3STAT_SPITUR_LENGTH                  0x00000001

//#define _SPI3STAT_SPIBUSY_POSITION               0x0000000B
//#define _SPI3STAT_SPIBUSY_MASK                   0x00000800
//#define _SPI3STAT_SPIBUSY_LENGTH                 0x00000001

//#define _SPI3STAT_FRMERR_POSITION                0x0000000C
//#define _SPI3STAT_FRMERR_MASK                    0x00001000
//#define _SPI3STAT_FRMERR_LENGTH                  0x00000001

//#define _SPI3STAT_TXBUFELM_POSITION              0x00000010
//#define _SPI3STAT_TXBUFELM_MASK                  0x001F0000
//#define _SPI3STAT_TXBUFELM_LENGTH                0x00000005

//#define _SPI3STAT_RXBUFELM_POSITION              0x00000018
//#define _SPI3STAT_RXBUFELM_MASK                  0x1F000000
//#define _SPI3STAT_RXBUFELM_LENGTH                0x00000005

//#define _SPI3STAT_w_POSITION                     0x00000000
//#define _SPI3STAT_w_MASK                         0xFFFFFFFF
//#define _SPI3STAT_w_LENGTH                       0x00000020

//#define _SPI3CON2_AUDMOD_POSITION                0x00000000
//#define _SPI3CON2_AUDMOD_MASK                    0x00000003
//#define _SPI3CON2_AUDMOD_LENGTH                  0x00000002

//#define _SPI3CON2_AUDMONO_POSITION               0x00000003
//#define _SPI3CON2_AUDMONO_MASK                   0x00000008
//#define _SPI3CON2_AUDMONO_LENGTH                 0x00000001

//#define _SPI3CON2_AUDEN_POSITION                 0x00000007
//#define _SPI3CON2_AUDEN_MASK                     0x00000080
//#define _SPI3CON2_AUDEN_LENGTH                   0x00000001

