HomuraVehicle/homuraLib_v2/machine/device/p32mz2048efg100_forVC.c
//#define _SPI4STAT_SPIRBE_POSITION                0x00000005
//#define _SPI4STAT_SPIRBE_MASK                    0x00000020
//#define _SPI4STAT_SPIRBE_LENGTH                  0x00000001

//#define _SPI4STAT_SPIROV_POSITION                0x00000006
//#define _SPI4STAT_SPIROV_MASK                    0x00000040
//#define _SPI4STAT_SPIROV_LENGTH                  0x00000001

//#define _SPI4STAT_SRMT_POSITION                  0x00000007
//#define _SPI4STAT_SRMT_MASK                      0x00000080
//#define _SPI4STAT_SRMT_LENGTH                    0x00000001

//#define _SPI4STAT_SPITUR_POSITION                0x00000008
//#define _SPI4STAT_SPITUR_MASK                    0x00000100
//#define _SPI4STAT_SPITUR_LENGTH                  0x00000001

//#define _SPI4STAT_SPIBUSY_POSITION               0x0000000B
//#define _SPI4STAT_SPIBUSY_MASK                   0x00000800
//#define _SPI4STAT_SPIBUSY_LENGTH                 0x00000001

//#define _SPI4STAT_FRMERR_POSITION                0x0000000C
//#define _SPI4STAT_FRMERR_MASK                    0x00001000
//#define _SPI4STAT_FRMERR_LENGTH                  0x00000001

//#define _SPI4STAT_TXBUFELM_POSITION              0x00000010
//#define _SPI4STAT_TXBUFELM_MASK                  0x001F0000
//#define _SPI4STAT_TXBUFELM_LENGTH                0x00000005

//#define _SPI4STAT_RXBUFELM_POSITION              0x00000018
//#define _SPI4STAT_RXBUFELM_MASK                  0x1F000000
//#define _SPI4STAT_RXBUFELM_LENGTH                0x00000005

//#define _SPI4STAT_w_POSITION                     0x00000000
//#define _SPI4STAT_w_MASK                         0xFFFFFFFF
//#define _SPI4STAT_w_LENGTH                       0x00000020

//#define _SPI4CON2_AUDMOD_POSITION                0x00000000
//#define _SPI4CON2_AUDMOD_MASK                    0x00000003
//#define _SPI4CON2_AUDMOD_LENGTH                  0x00000002

//#define _SPI4CON2_AUDMONO_POSITION               0x00000003
//#define _SPI4CON2_AUDMONO_MASK                   0x00000008
//#define _SPI4CON2_AUDMONO_LENGTH                 0x00000001

//#define _SPI4CON2_AUDEN_POSITION                 0x00000007
//#define _SPI4CON2_AUDEN_MASK                     0x00000080
//#define _SPI4CON2_AUDEN_LENGTH                   0x00000001

//#define _SPI4CON2_IGNTUR_POSITION                0x00000008
//#define _SPI4CON2_IGNTUR_MASK                    0x00000100
//#define _SPI4CON2_IGNTUR_LENGTH                  0x00000001

//#define _SPI4CON2_IGNROV_POSITION                0x00000009
//#define _SPI4CON2_IGNROV_MASK                    0x00000200
//#define _SPI4CON2_IGNROV_LENGTH                  0x00000001

//#define _SPI4CON2_SPITUREN_POSITION              0x0000000A
//#define _SPI4CON2_SPITUREN_MASK                  0x00000400
//#define _SPI4CON2_SPITUREN_LENGTH                0x00000001

//#define _SPI4CON2_SPIROVEN_POSITION              0x0000000B
//#define _SPI4CON2_SPIROVEN_MASK                  0x00000800
//#define _SPI4CON2_SPIROVEN_LENGTH                0x00000001

//#define _SPI4CON2_FRMERREN_POSITION              0x0000000C
//#define _SPI4CON2_FRMERREN_MASK                  0x00001000
//#define _SPI4CON2_FRMERREN_LENGTH                0x00000001

//#define _SPI4CON2_SPISGNEXT_POSITION             0x0000000F
//#define _SPI4CON2_SPISGNEXT_MASK                 0x00008000
//#define _SPI4CON2_SPISGNEXT_LENGTH               0x00000001

//#define _SPI4CON2_AUDMOD0_POSITION               0x00000000
//#define _SPI4CON2_AUDMOD0_MASK                   0x00000001
//#define _SPI4CON2_AUDMOD0_LENGTH                 0x00000001

//#define _SPI4CON2_AUDMOD1_POSITION               0x00000001
//#define _SPI4CON2_AUDMOD1_MASK                   0x00000002
//#define _SPI4CON2_AUDMOD1_LENGTH                 0x00000001

//#define _SPI4CON2_w_POSITION                     0x00000000
//#define _SPI4CON2_w_MASK                         0xFFFFFFFF
//#define _SPI4CON2_w_LENGTH                       0x00000020

//#define _SPI5CON_SRXISEL_POSITION                0x00000000
//#define _SPI5CON_SRXISEL_MASK                    0x00000003
//#define _SPI5CON_SRXISEL_LENGTH                  0x00000002

//#define _SPI5CON_STXISEL_POSITION                0x00000002
//#define _SPI5CON_STXISEL_MASK                    0x0000000C
//#define _SPI5CON_STXISEL_LENGTH                  0x00000002

//#define _SPI5CON_DISSDI_POSITION                 0x00000004
//#define _SPI5CON_DISSDI_MASK                     0x00000010
//#define _SPI5CON_DISSDI_LENGTH                   0x00000001

//#define _SPI5CON_MSTEN_POSITION                  0x00000005
//#define _SPI5CON_MSTEN_MASK                      0x00000020
//#define _SPI5CON_MSTEN_LENGTH                    0x00000001

//#define _SPI5CON_CKP_POSITION                    0x00000006
//#define _SPI5CON_CKP_MASK                        0x00000040
//#define _SPI5CON_CKP_LENGTH                      0x00000001

//#define _SPI5CON_SSEN_POSITION                   0x00000007
//#define _SPI5CON_SSEN_MASK                       0x00000080
//#define _SPI5CON_SSEN_LENGTH                     0x00000001

//#define _SPI5CON_CKE_POSITION                    0x00000008
//#define _SPI5CON_CKE_MASK                        0x00000100
//#define _SPI5CON_CKE_LENGTH                      0x00000001

//#define _SPI5CON_SMP_POSITION                    0x00000009
//#define _SPI5CON_SMP_MASK                        0x00000200
//#define _SPI5CON_SMP_LENGTH                      0x00000001

//#define _SPI5CON_MODE16_POSITION                 0x0000000A
//#define _SPI5CON_MODE16_MASK                     0x00000400
//#define _SPI5CON_MODE16_LENGTH                   0x00000001

//#define _SPI5CON_MODE32_POSITION                 0x0000000B
//#define _SPI5CON_MODE32_MASK                     0x00000800
//#define _SPI5CON_MODE32_LENGTH                   0x00000001

//#define _SPI5CON_DISSDO_POSITION                 0x0000000C
//#define _SPI5CON_DISSDO_MASK                     0x00001000
//#define _SPI5CON_DISSDO_LENGTH                   0x00000001

//#define _SPI5CON_SIDL_POSITION                   0x0000000D
//#define _SPI5CON_SIDL_MASK                       0x00002000
//#define _SPI5CON_SIDL_LENGTH                     0x00000001

//#define _SPI5CON_ON_POSITION                     0x0000000F
//#define _SPI5CON_ON_MASK                         0x00008000
//#define _SPI5CON_ON_LENGTH                       0x00000001

//#define _SPI5CON_ENHBUF_POSITION                 0x00000010
//#define _SPI5CON_ENHBUF_MASK                     0x00010000
//#define _SPI5CON_ENHBUF_LENGTH                   0x00000001

