HomuraVehicle/homuraLib_v2/machine/device/p32mz2048efg100_forVC.c
//#define _U1STA_UTXISEL0_POSITION                 0x0000000E
//#define _U1STA_UTXISEL0_MASK                     0x00004000
//#define _U1STA_UTXISEL0_LENGTH                   0x00000001

//#define _U1STA_UTXISEL1_POSITION                 0x0000000F
//#define _U1STA_UTXISEL1_MASK                     0x00008000
//#define _U1STA_UTXISEL1_LENGTH                   0x00000001

//#define _U1STA_UTXSEL_POSITION                   0x0000000E
//#define _U1STA_UTXSEL_MASK                       0x0000C000
//#define _U1STA_UTXSEL_LENGTH                     0x00000002

//#define _U1STA_w_POSITION                        0x00000000
//#define _U1STA_w_MASK                            0xFFFFFFFF
//#define _U1STA_w_LENGTH                          0x00000020

//#define _UABSTA_URXDA_POSITION                   0x00000000
//#define _UABSTA_URXDA_MASK                       0x00000001
//#define _UABSTA_URXDA_LENGTH                     0x00000001

//#define _UABSTA_OERR_POSITION                    0x00000001
//#define _UABSTA_OERR_MASK                        0x00000002
//#define _UABSTA_OERR_LENGTH                      0x00000001

//#define _UABSTA_FERR_POSITION                    0x00000002
//#define _UABSTA_FERR_MASK                        0x00000004
//#define _UABSTA_FERR_LENGTH                      0x00000001

//#define _UABSTA_PERR_POSITION                    0x00000003
//#define _UABSTA_PERR_MASK                        0x00000008
//#define _UABSTA_PERR_LENGTH                      0x00000001

//#define _UABSTA_RIDLE_POSITION                   0x00000004
//#define _UABSTA_RIDLE_MASK                       0x00000010
//#define _UABSTA_RIDLE_LENGTH                     0x00000001

//#define _UABSTA_ADDEN_POSITION                   0x00000005
//#define _UABSTA_ADDEN_MASK                       0x00000020
//#define _UABSTA_ADDEN_LENGTH                     0x00000001

//#define _UABSTA_URXISEL_POSITION                 0x00000006
//#define _UABSTA_URXISEL_MASK                     0x000000C0
//#define _UABSTA_URXISEL_LENGTH                   0x00000002

//#define _UABSTA_TRMT_POSITION                    0x00000008
//#define _UABSTA_TRMT_MASK                        0x00000100
//#define _UABSTA_TRMT_LENGTH                      0x00000001

//#define _UABSTA_UTXBF_POSITION                   0x00000009
//#define _UABSTA_UTXBF_MASK                       0x00000200
//#define _UABSTA_UTXBF_LENGTH                     0x00000001

//#define _UABSTA_UTXEN_POSITION                   0x0000000A
//#define _UABSTA_UTXEN_MASK                       0x00000400
//#define _UABSTA_UTXEN_LENGTH                     0x00000001

//#define _UABSTA_UTXBRK_POSITION                  0x0000000B
//#define _UABSTA_UTXBRK_MASK                      0x00000800
//#define _UABSTA_UTXBRK_LENGTH                    0x00000001

//#define _UABSTA_URXEN_POSITION                   0x0000000C
//#define _UABSTA_URXEN_MASK                       0x00001000
//#define _UABSTA_URXEN_LENGTH                     0x00000001

//#define _UABSTA_UTXINV_POSITION                  0x0000000D
//#define _UABSTA_UTXINV_MASK                      0x00002000
//#define _UABSTA_UTXINV_LENGTH                    0x00000001

//#define _UABSTA_UTXISEL_POSITION                 0x0000000E
//#define _UABSTA_UTXISEL_MASK                     0x0000C000
//#define _UABSTA_UTXISEL_LENGTH                   0x00000002

//#define _UABSTA_ADDR_POSITION                    0x00000010
//#define _UABSTA_ADDR_MASK                        0x00FF0000
//#define _UABSTA_ADDR_LENGTH                      0x00000008

//#define _UABSTA_ADM_EN_POSITION                  0x00000018
//#define _UABSTA_ADM_EN_MASK                      0x01000000
//#define _UABSTA_ADM_EN_LENGTH                    0x00000001

//#define _UABSTA_URXISEL0_POSITION                0x00000006
//#define _UABSTA_URXISEL0_MASK                    0x00000040
//#define _UABSTA_URXISEL0_LENGTH                  0x00000001

//#define _UABSTA_URXISEL1_POSITION                0x00000007
//#define _UABSTA_URXISEL1_MASK                    0x00000080
//#define _UABSTA_URXISEL1_LENGTH                  0x00000001

//#define _UABSTA_UTXISEL0_POSITION                0x0000000E
//#define _UABSTA_UTXISEL0_MASK                    0x00004000
//#define _UABSTA_UTXISEL0_LENGTH                  0x00000001

//#define _UABSTA_UTXISEL1_POSITION                0x0000000F
//#define _UABSTA_UTXISEL1_MASK                    0x00008000
//#define _UABSTA_UTXISEL1_LENGTH                  0x00000001

//#define _UABSTA_UTXSEL_POSITION                  0x0000000E
//#define _UABSTA_UTXSEL_MASK                      0x0000C000
//#define _UABSTA_UTXSEL_LENGTH                    0x00000002

//#define _UABSTA_w_POSITION                       0x00000000
//#define _UABSTA_w_MASK                           0xFFFFFFFF
//#define _UABSTA_w_LENGTH                         0x00000020

//#define _U2MODE_STSEL_POSITION                   0x00000000
//#define _U2MODE_STSEL_MASK                       0x00000001
//#define _U2MODE_STSEL_LENGTH                     0x00000001

//#define _U2MODE_PDSEL_POSITION                   0x00000001
//#define _U2MODE_PDSEL_MASK                       0x00000006
//#define _U2MODE_PDSEL_LENGTH                     0x00000002

//#define _U2MODE_BRGH_POSITION                    0x00000003
//#define _U2MODE_BRGH_MASK                        0x00000008
//#define _U2MODE_BRGH_LENGTH                      0x00000001

//#define _U2MODE_RXINV_POSITION                   0x00000004
//#define _U2MODE_RXINV_MASK                       0x00000010
//#define _U2MODE_RXINV_LENGTH                     0x00000001

//#define _U2MODE_ABAUD_POSITION                   0x00000005
//#define _U2MODE_ABAUD_MASK                       0x00000020
//#define _U2MODE_ABAUD_LENGTH                     0x00000001

//#define _U2MODE_LPBACK_POSITION                  0x00000006
//#define _U2MODE_LPBACK_MASK                      0x00000040
//#define _U2MODE_LPBACK_LENGTH                    0x00000001

//#define _U2MODE_WAKE_POSITION                    0x00000007
//#define _U2MODE_WAKE_MASK                        0x00000080
//#define _U2MODE_WAKE_LENGTH                      0x00000001

//#define _U2MODE_UEN_POSITION                     0x00000008
//#define _U2MODE_UEN_MASK                         0x00000300
//#define _U2MODE_UEN_LENGTH                       0x00000002

