HomuraVehicle/homuraLib_v2/machine/device/p32mz2048efg100_forVC.c
//#define _PMMODE_WAITM_POSITION                   0x00000002
//#define _PMMODE_WAITM_MASK                       0x0000003C
//#define _PMMODE_WAITM_LENGTH                     0x00000004

//#define _PMMODE_WAITB_POSITION                   0x00000006
//#define _PMMODE_WAITB_MASK                       0x000000C0
//#define _PMMODE_WAITB_LENGTH                     0x00000002

//#define _PMMODE_MODE_POSITION                    0x00000008
//#define _PMMODE_MODE_MASK                        0x00000300
//#define _PMMODE_MODE_LENGTH                      0x00000002

//#define _PMMODE_MODE16_POSITION                  0x0000000A
//#define _PMMODE_MODE16_MASK                      0x00000400
//#define _PMMODE_MODE16_LENGTH                    0x00000001

//#define _PMMODE_INCM_POSITION                    0x0000000B
//#define _PMMODE_INCM_MASK                        0x00001800
//#define _PMMODE_INCM_LENGTH                      0x00000002

//#define _PMMODE_IRQM_POSITION                    0x0000000D
//#define _PMMODE_IRQM_MASK                        0x00006000
//#define _PMMODE_IRQM_LENGTH                      0x00000002

//#define _PMMODE_BUSY_POSITION                    0x0000000F
//#define _PMMODE_BUSY_MASK                        0x00008000
//#define _PMMODE_BUSY_LENGTH                      0x00000001

//#define _PMMODE_WAITE0_POSITION                  0x00000000
//#define _PMMODE_WAITE0_MASK                      0x00000001
//#define _PMMODE_WAITE0_LENGTH                    0x00000001

//#define _PMMODE_WAITE1_POSITION                  0x00000001
//#define _PMMODE_WAITE1_MASK                      0x00000002
//#define _PMMODE_WAITE1_LENGTH                    0x00000001

//#define _PMMODE_WAITM0_POSITION                  0x00000002
//#define _PMMODE_WAITM0_MASK                      0x00000004
//#define _PMMODE_WAITM0_LENGTH                    0x00000001

//#define _PMMODE_WAITM1_POSITION                  0x00000003
//#define _PMMODE_WAITM1_MASK                      0x00000008
//#define _PMMODE_WAITM1_LENGTH                    0x00000001

//#define _PMMODE_WAITM2_POSITION                  0x00000004
//#define _PMMODE_WAITM2_MASK                      0x00000010
//#define _PMMODE_WAITM2_LENGTH                    0x00000001

//#define _PMMODE_WAITM3_POSITION                  0x00000005
//#define _PMMODE_WAITM3_MASK                      0x00000020
//#define _PMMODE_WAITM3_LENGTH                    0x00000001

//#define _PMMODE_WAITB0_POSITION                  0x00000006
//#define _PMMODE_WAITB0_MASK                      0x00000040
//#define _PMMODE_WAITB0_LENGTH                    0x00000001

//#define _PMMODE_WAITB1_POSITION                  0x00000007
//#define _PMMODE_WAITB1_MASK                      0x00000080
//#define _PMMODE_WAITB1_LENGTH                    0x00000001

//#define _PMMODE_MODE0_POSITION                   0x00000008
//#define _PMMODE_MODE0_MASK                       0x00000100
//#define _PMMODE_MODE0_LENGTH                     0x00000001

//#define _PMMODE_MODE1_POSITION                   0x00000009
//#define _PMMODE_MODE1_MASK                       0x00000200
//#define _PMMODE_MODE1_LENGTH                     0x00000001

//#define _PMMODE_INCM0_POSITION                   0x0000000B
//#define _PMMODE_INCM0_MASK                       0x00000800
//#define _PMMODE_INCM0_LENGTH                     0x00000001

//#define _PMMODE_INCM1_POSITION                   0x0000000C
//#define _PMMODE_INCM1_MASK                       0x00001000
//#define _PMMODE_INCM1_LENGTH                     0x00000001

//#define _PMMODE_IRQM0_POSITION                   0x0000000D
//#define _PMMODE_IRQM0_MASK                       0x00002000
//#define _PMMODE_IRQM0_LENGTH                     0x00000001

//#define _PMMODE_IRQM1_POSITION                   0x0000000E
//#define _PMMODE_IRQM1_MASK                       0x00004000
//#define _PMMODE_IRQM1_LENGTH                     0x00000001

//#define _PMMODE_w_POSITION                       0x00000000
//#define _PMMODE_w_MASK                           0xFFFFFFFF
//#define _PMMODE_w_LENGTH                         0x00000020

//#define _PMADDR_ADDR_POSITION                    0x00000000
//#define _PMADDR_ADDR_MASK                        0x00003FFF
//#define _PMADDR_ADDR_LENGTH                      0x0000000E

//#define _PMADDR_ADDR14_POSITION                  0x0000000E
//#define _PMADDR_ADDR14_MASK                      0x00004000
//#define _PMADDR_ADDR14_LENGTH                    0x00000001

//#define _PMADDR_ADDR15_POSITION                  0x0000000F
//#define _PMADDR_ADDR15_MASK                      0x00008000
//#define _PMADDR_ADDR15_LENGTH                    0x00000001

//#define _PMADDR_CS_POSITION                      0x0000000E
//#define _PMADDR_CS_MASK                          0x0000C000
//#define _PMADDR_CS_LENGTH                        0x00000002

//#define _PMADDR_CS1_POSITION                     0x0000000E
//#define _PMADDR_CS1_MASK                         0x00004000
//#define _PMADDR_CS1_LENGTH                       0x00000001

//#define _PMADDR_CS2_POSITION                     0x0000000F
//#define _PMADDR_CS2_MASK                         0x00008000
//#define _PMADDR_CS2_LENGTH                       0x00000001

//#define _PMADDR_w_POSITION                       0x00000000
//#define _PMADDR_w_MASK                           0xFFFFFFFF
//#define _PMADDR_w_LENGTH                         0x00000020

//#define _PMDOUT_DATAOUT_POSITION                 0x00000000
//#define _PMDOUT_DATAOUT_MASK                     0xFFFFFFFF
//#define _PMDOUT_DATAOUT_LENGTH                   0x00000020

//#define _PMDOUT_w_POSITION                       0x00000000
//#define _PMDOUT_w_MASK                           0xFFFFFFFF
//#define _PMDOUT_w_LENGTH                         0x00000020

//#define _PMDIN_DATAIN_POSITION                   0x00000000
//#define _PMDIN_DATAIN_MASK                       0xFFFFFFFF
//#define _PMDIN_DATAIN_LENGTH                     0x00000020

//#define _PMDIN_w_POSITION                        0x00000000
//#define _PMDIN_w_MASK                            0xFFFFFFFF
//#define _PMDIN_w_LENGTH                          0x00000020

//#define _PMAEN_PTEN_POSITION                     0x00000000
//#define _PMAEN_PTEN_MASK                         0x00FFFFFF
//#define _PMAEN_PTEN_LENGTH                       0x00000018

//#define _PMAEN_w_POSITION                        0x00000000
//#define _PMAEN_w_MASK                            0xFFFFFFFF
//#define _PMAEN_w_LENGTH                          0x00000020

//#define _PMSTAT_OB0E_POSITION                    0x00000000
//#define _PMSTAT_OB0E_MASK                        0x00000001
//#define _PMSTAT_OB0E_LENGTH                      0x00000001

//#define _PMSTAT_OB1E_POSITION                    0x00000001
//#define _PMSTAT_OB1E_MASK                        0x00000002
//#define _PMSTAT_OB1E_LENGTH                      0x00000001

//#define _PMSTAT_OB2E_POSITION                    0x00000002
//#define _PMSTAT_OB2E_MASK                        0x00000004
//#define _PMSTAT_OB2E_LENGTH                      0x00000001

//#define _PMSTAT_OB3E_POSITION                    0x00000003
//#define _PMSTAT_OB3E_MASK                        0x00000008
//#define _PMSTAT_OB3E_LENGTH                      0x00000001

//#define _PMSTAT_OBUF_POSITION                    0x00000006
//#define _PMSTAT_OBUF_MASK                        0x00000040
//#define _PMSTAT_OBUF_LENGTH                      0x00000001

//#define _PMSTAT_OBE_POSITION                     0x00000007
//#define _PMSTAT_OBE_MASK                         0x00000080
//#define _PMSTAT_OBE_LENGTH                       0x00000001

//#define _PMSTAT_IB0F_POSITION                    0x00000008
//#define _PMSTAT_IB0F_MASK                        0x00000100
//#define _PMSTAT_IB0F_LENGTH                      0x00000001

