HomuraVehicle/homuraLib_v2/machine/device/p32mz2048efg100_forVC.c
//#define _ADCCON3_DIGEN4_POSITION                 0x00000014
//#define _ADCCON3_DIGEN4_MASK                     0x00100000
//#define _ADCCON3_DIGEN4_LENGTH                   0x00000001

//#define _ADCCON3_DIGEN7_POSITION                 0x00000017
//#define _ADCCON3_DIGEN7_MASK                     0x00800000
//#define _ADCCON3_DIGEN7_LENGTH                   0x00000001

//#define _ADCCON3_CONCLKDIV_POSITION              0x00000018
//#define _ADCCON3_CONCLKDIV_MASK                  0x3F000000
//#define _ADCCON3_CONCLKDIV_LENGTH                0x00000006

//#define _ADCCON3_ADCSEL_POSITION                 0x0000001E
//#define _ADCCON3_ADCSEL_MASK                     0xC0000000
//#define _ADCCON3_ADCSEL_LENGTH                   0x00000002

//#define _ADCTRGMODE_SSAMPEN0_POSITION            0x00000000
//#define _ADCTRGMODE_SSAMPEN0_MASK                0x00000001
//#define _ADCTRGMODE_SSAMPEN0_LENGTH              0x00000001

//#define _ADCTRGMODE_SSAMPEN1_POSITION            0x00000001
//#define _ADCTRGMODE_SSAMPEN1_MASK                0x00000002
//#define _ADCTRGMODE_SSAMPEN1_LENGTH              0x00000001

//#define _ADCTRGMODE_SSAMPEN2_POSITION            0x00000002
//#define _ADCTRGMODE_SSAMPEN2_MASK                0x00000004
//#define _ADCTRGMODE_SSAMPEN2_LENGTH              0x00000001

//#define _ADCTRGMODE_SSAMPEN3_POSITION            0x00000003
//#define _ADCTRGMODE_SSAMPEN3_MASK                0x00000008
//#define _ADCTRGMODE_SSAMPEN3_LENGTH              0x00000001

//#define _ADCTRGMODE_SSAMPEN4_POSITION            0x00000004
//#define _ADCTRGMODE_SSAMPEN4_MASK                0x00000010
//#define _ADCTRGMODE_SSAMPEN4_LENGTH              0x00000001

//#define _ADCTRGMODE_STRGEN0_POSITION             0x00000008
//#define _ADCTRGMODE_STRGEN0_MASK                 0x00000100
//#define _ADCTRGMODE_STRGEN0_LENGTH               0x00000001

//#define _ADCTRGMODE_STRGEN1_POSITION             0x00000009
//#define _ADCTRGMODE_STRGEN1_MASK                 0x00000200
//#define _ADCTRGMODE_STRGEN1_LENGTH               0x00000001

//#define _ADCTRGMODE_STRGEN2_POSITION             0x0000000A
//#define _ADCTRGMODE_STRGEN2_MASK                 0x00000400
//#define _ADCTRGMODE_STRGEN2_LENGTH               0x00000001

//#define _ADCTRGMODE_STRGEN3_POSITION             0x0000000B
//#define _ADCTRGMODE_STRGEN3_MASK                 0x00000800
//#define _ADCTRGMODE_STRGEN3_LENGTH               0x00000001

//#define _ADCTRGMODE_STRGEN4_POSITION             0x0000000C
//#define _ADCTRGMODE_STRGEN4_MASK                 0x00001000
//#define _ADCTRGMODE_STRGEN4_LENGTH               0x00000001

//#define _ADCTRGMODE_SH0ALT_POSITION              0x00000010
//#define _ADCTRGMODE_SH0ALT_MASK                  0x00030000
//#define _ADCTRGMODE_SH0ALT_LENGTH                0x00000002

//#define _ADCTRGMODE_SH1ALT_POSITION              0x00000012
//#define _ADCTRGMODE_SH1ALT_MASK                  0x000C0000
//#define _ADCTRGMODE_SH1ALT_LENGTH                0x00000002

//#define _ADCTRGMODE_SH2ALT_POSITION              0x00000014
//#define _ADCTRGMODE_SH2ALT_MASK                  0x00300000
//#define _ADCTRGMODE_SH2ALT_LENGTH                0x00000002

//#define _ADCTRGMODE_SH3ALT_POSITION              0x00000016
//#define _ADCTRGMODE_SH3ALT_MASK                  0x00C00000
//#define _ADCTRGMODE_SH3ALT_LENGTH                0x00000002

//#define _ADCTRGMODE_SH4ALT_POSITION              0x00000018
//#define _ADCTRGMODE_SH4ALT_MASK                  0x03000000
//#define _ADCTRGMODE_SH4ALT_LENGTH                0x00000002

//#define _ADCIMCON1_SIGN0_POSITION                0x00000000
//#define _ADCIMCON1_SIGN0_MASK                    0x00000001
//#define _ADCIMCON1_SIGN0_LENGTH                  0x00000001

//#define _ADCIMCON1_DIFF0_POSITION                0x00000001
//#define _ADCIMCON1_DIFF0_MASK                    0x00000002
//#define _ADCIMCON1_DIFF0_LENGTH                  0x00000001

//#define _ADCIMCON1_SIGN1_POSITION                0x00000002
//#define _ADCIMCON1_SIGN1_MASK                    0x00000004
//#define _ADCIMCON1_SIGN1_LENGTH                  0x00000001

//#define _ADCIMCON1_DIFF1_POSITION                0x00000003
//#define _ADCIMCON1_DIFF1_MASK                    0x00000008
//#define _ADCIMCON1_DIFF1_LENGTH                  0x00000001

//#define _ADCIMCON1_SIGN2_POSITION                0x00000004
//#define _ADCIMCON1_SIGN2_MASK                    0x00000010
//#define _ADCIMCON1_SIGN2_LENGTH                  0x00000001

//#define _ADCIMCON1_DIFF2_POSITION                0x00000005
//#define _ADCIMCON1_DIFF2_MASK                    0x00000020
//#define _ADCIMCON1_DIFF2_LENGTH                  0x00000001

//#define _ADCIMCON1_SIGN3_POSITION                0x00000006
//#define _ADCIMCON1_SIGN3_MASK                    0x00000040
//#define _ADCIMCON1_SIGN3_LENGTH                  0x00000001

//#define _ADCIMCON1_DIFF3_POSITION                0x00000007
//#define _ADCIMCON1_DIFF3_MASK                    0x00000080
//#define _ADCIMCON1_DIFF3_LENGTH                  0x00000001

//#define _ADCIMCON1_SIGN4_POSITION                0x00000008
//#define _ADCIMCON1_SIGN4_MASK                    0x00000100
//#define _ADCIMCON1_SIGN4_LENGTH                  0x00000001

//#define _ADCIMCON1_DIFF4_POSITION                0x00000009
//#define _ADCIMCON1_DIFF4_MASK                    0x00000200
//#define _ADCIMCON1_DIFF4_LENGTH                  0x00000001

//#define _ADCIMCON1_SIGN5_POSITION                0x0000000A
//#define _ADCIMCON1_SIGN5_MASK                    0x00000400
//#define _ADCIMCON1_SIGN5_LENGTH                  0x00000001

//#define _ADCIMCON1_DIFF5_POSITION                0x0000000B
//#define _ADCIMCON1_DIFF5_MASK                    0x00000800
//#define _ADCIMCON1_DIFF5_LENGTH                  0x00000001

//#define _ADCIMCON1_SIGN6_POSITION                0x0000000C
//#define _ADCIMCON1_SIGN6_MASK                    0x00001000
//#define _ADCIMCON1_SIGN6_LENGTH                  0x00000001

//#define _ADCIMCON1_DIFF6_POSITION                0x0000000D
//#define _ADCIMCON1_DIFF6_MASK                    0x00002000
//#define _ADCIMCON1_DIFF6_LENGTH                  0x00000001

//#define _ADCIMCON1_SIGN7_POSITION                0x0000000E
//#define _ADCIMCON1_SIGN7_MASK                    0x00004000
//#define _ADCIMCON1_SIGN7_LENGTH                  0x00000001

//#define _ADCIMCON1_DIFF7_POSITION                0x0000000F
//#define _ADCIMCON1_DIFF7_MASK                    0x00008000
//#define _ADCIMCON1_DIFF7_LENGTH                  0x00000001

