HomuraVehicle/homuraLib_v2/machine/device/p32mz2048efg100_forVC.c
//#define _ADCIMCON2_SIGN25_POSITION               0x00000012
//#define _ADCIMCON2_SIGN25_MASK                   0x00040000
//#define _ADCIMCON2_SIGN25_LENGTH                 0x00000001

//#define _ADCIMCON2_DIFF25_POSITION               0x00000013
//#define _ADCIMCON2_DIFF25_MASK                   0x00080000
//#define _ADCIMCON2_DIFF25_LENGTH                 0x00000001

//#define _ADCIMCON2_SIGN26_POSITION               0x00000014
//#define _ADCIMCON2_SIGN26_MASK                   0x00100000
//#define _ADCIMCON2_SIGN26_LENGTH                 0x00000001

//#define _ADCIMCON2_DIFF26_POSITION               0x00000015
//#define _ADCIMCON2_DIFF26_MASK                   0x00200000
//#define _ADCIMCON2_DIFF26_LENGTH                 0x00000001

//#define _ADCIMCON2_SIGN27_POSITION               0x00000016
//#define _ADCIMCON2_SIGN27_MASK                   0x00400000
//#define _ADCIMCON2_SIGN27_LENGTH                 0x00000001

//#define _ADCIMCON2_DIFF27_POSITION               0x00000017
//#define _ADCIMCON2_DIFF27_MASK                   0x00800000
//#define _ADCIMCON2_DIFF27_LENGTH                 0x00000001

//#define _ADCIMCON2_SIGN28_POSITION               0x00000018
//#define _ADCIMCON2_SIGN28_MASK                   0x01000000
//#define _ADCIMCON2_SIGN28_LENGTH                 0x00000001

//#define _ADCIMCON2_DIFF28_POSITION               0x00000019
//#define _ADCIMCON2_DIFF28_MASK                   0x02000000
//#define _ADCIMCON2_DIFF28_LENGTH                 0x00000001

//#define _ADCIMCON2_SIGN29_POSITION               0x0000001A
//#define _ADCIMCON2_SIGN29_MASK                   0x04000000
//#define _ADCIMCON2_SIGN29_LENGTH                 0x00000001

//#define _ADCIMCON2_DIFF29_POSITION               0x0000001B
//#define _ADCIMCON2_DIFF29_MASK                   0x08000000
//#define _ADCIMCON2_DIFF29_LENGTH                 0x00000001

//#define _ADCIMCON2_SIGN30_POSITION               0x0000001C
//#define _ADCIMCON2_SIGN30_MASK                   0x10000000
//#define _ADCIMCON2_SIGN30_LENGTH                 0x00000001

//#define _ADCIMCON2_DIFF30_POSITION               0x0000001D
//#define _ADCIMCON2_DIFF30_MASK                   0x20000000
//#define _ADCIMCON2_DIFF30_LENGTH                 0x00000001

//#define _ADCIMCON2_SIGN31_POSITION               0x0000001E
//#define _ADCIMCON2_SIGN31_MASK                   0x40000000
//#define _ADCIMCON2_SIGN31_LENGTH                 0x00000001

//#define _ADCIMCON2_DIFF31_POSITION               0x0000001F
//#define _ADCIMCON2_DIFF31_MASK                   0x80000000
//#define _ADCIMCON2_DIFF31_LENGTH                 0x00000001

//#define _ADCIMCON3_SIGN32_POSITION               0x00000000
//#define _ADCIMCON3_SIGN32_MASK                   0x00000001
//#define _ADCIMCON3_SIGN32_LENGTH                 0x00000001

//#define _ADCIMCON3_DIFF32_POSITION               0x00000001
//#define _ADCIMCON3_DIFF32_MASK                   0x00000002
//#define _ADCIMCON3_DIFF32_LENGTH                 0x00000001

//#define _ADCIMCON3_SIGN33_POSITION               0x00000002
//#define _ADCIMCON3_SIGN33_MASK                   0x00000004
//#define _ADCIMCON3_SIGN33_LENGTH                 0x00000001

//#define _ADCIMCON3_DIFF33_POSITION               0x00000003
//#define _ADCIMCON3_DIFF33_MASK                   0x00000008
//#define _ADCIMCON3_DIFF33_LENGTH                 0x00000001

//#define _ADCIMCON3_SIGN34_POSITION               0x00000004
//#define _ADCIMCON3_SIGN34_MASK                   0x00000010
//#define _ADCIMCON3_SIGN34_LENGTH                 0x00000001

//#define _ADCIMCON3_DIFF34_POSITION               0x00000005
//#define _ADCIMCON3_DIFF34_MASK                   0x00000020
//#define _ADCIMCON3_DIFF34_LENGTH                 0x00000001

//#define _ADCIMCON3_SIGN35_POSITION               0x00000006
//#define _ADCIMCON3_SIGN35_MASK                   0x00000040
//#define _ADCIMCON3_SIGN35_LENGTH                 0x00000001

//#define _ADCIMCON3_DIFF35_POSITION               0x00000007
//#define _ADCIMCON3_DIFF35_MASK                   0x00000080
//#define _ADCIMCON3_DIFF35_LENGTH                 0x00000001

//#define _ADCIMCON3_SIGN36_POSITION               0x00000008
//#define _ADCIMCON3_SIGN36_MASK                   0x00000100
//#define _ADCIMCON3_SIGN36_LENGTH                 0x00000001

//#define _ADCIMCON3_DIFF36_POSITION               0x00000009
//#define _ADCIMCON3_DIFF36_MASK                   0x00000200
//#define _ADCIMCON3_DIFF36_LENGTH                 0x00000001

//#define _ADCIMCON3_SIGN37_POSITION               0x0000000A
//#define _ADCIMCON3_SIGN37_MASK                   0x00000400
//#define _ADCIMCON3_SIGN37_LENGTH                 0x00000001

//#define _ADCIMCON3_DIFF37_POSITION               0x0000000B
//#define _ADCIMCON3_DIFF37_MASK                   0x00000800
//#define _ADCIMCON3_DIFF37_LENGTH                 0x00000001

//#define _ADCIMCON3_SIGN38_POSITION               0x0000000C
//#define _ADCIMCON3_SIGN38_MASK                   0x00001000
//#define _ADCIMCON3_SIGN38_LENGTH                 0x00000001

//#define _ADCIMCON3_DIFF38_POSITION               0x0000000D
//#define _ADCIMCON3_DIFF38_MASK                   0x00002000
//#define _ADCIMCON3_DIFF38_LENGTH                 0x00000001

//#define _ADCIMCON3_SIGN39_POSITION               0x0000000E
//#define _ADCIMCON3_SIGN39_MASK                   0x00004000
//#define _ADCIMCON3_SIGN39_LENGTH                 0x00000001

//#define _ADCIMCON3_DIFF39_POSITION               0x0000000F
//#define _ADCIMCON3_DIFF39_MASK                   0x00008000
//#define _ADCIMCON3_DIFF39_LENGTH                 0x00000001

//#define _ADCIMCON3_SIGN40_POSITION               0x00000010
//#define _ADCIMCON3_SIGN40_MASK                   0x00010000
//#define _ADCIMCON3_SIGN40_LENGTH                 0x00000001

//#define _ADCIMCON3_DIFF40_POSITION               0x00000011
//#define _ADCIMCON3_DIFF40_MASK                   0x00020000
//#define _ADCIMCON3_DIFF40_LENGTH                 0x00000001

//#define _ADCIMCON3_SIGN41_POSITION               0x00000012
//#define _ADCIMCON3_SIGN41_MASK                   0x00040000
//#define _ADCIMCON3_SIGN41_LENGTH                 0x00000001

//#define _ADCIMCON3_DIFF41_POSITION               0x00000013
//#define _ADCIMCON3_DIFF41_MASK                   0x00080000
//#define _ADCIMCON3_DIFF41_LENGTH                 0x00000001

