HomuraVehicle/homuraLib_v2/machine/device/p32mz2048efg100_forVC.c
//#define _ADCIMCON3_SIGN42_POSITION               0x00000014
//#define _ADCIMCON3_SIGN42_MASK                   0x00100000
//#define _ADCIMCON3_SIGN42_LENGTH                 0x00000001

//#define _ADCIMCON3_DIFF42_POSITION               0x00000015
//#define _ADCIMCON3_DIFF42_MASK                   0x00200000
//#define _ADCIMCON3_DIFF42_LENGTH                 0x00000001

//#define _ADCIMCON3_SIGN43_POSITION               0x00000016
//#define _ADCIMCON3_SIGN43_MASK                   0x00400000
//#define _ADCIMCON3_SIGN43_LENGTH                 0x00000001

//#define _ADCIMCON3_DIFF43_POSITION               0x00000017
//#define _ADCIMCON3_DIFF43_MASK                   0x00800000
//#define _ADCIMCON3_DIFF43_LENGTH                 0x00000001

//#define _ADCIMCON3_SIGN44_POSITION               0x00000018
//#define _ADCIMCON3_SIGN44_MASK                   0x01000000
//#define _ADCIMCON3_SIGN44_LENGTH                 0x00000001

//#define _ADCIMCON3_DIFF44_POSITION               0x00000019
//#define _ADCIMCON3_DIFF44_MASK                   0x02000000
//#define _ADCIMCON3_DIFF44_LENGTH                 0x00000001

//#define _ADCGIRQEN1_AGIEN0_POSITION              0x00000000
//#define _ADCGIRQEN1_AGIEN0_MASK                  0x00000001
//#define _ADCGIRQEN1_AGIEN0_LENGTH                0x00000001

//#define _ADCGIRQEN1_AGIEN1_POSITION              0x00000001
//#define _ADCGIRQEN1_AGIEN1_MASK                  0x00000002
//#define _ADCGIRQEN1_AGIEN1_LENGTH                0x00000001

//#define _ADCGIRQEN1_AGIEN2_POSITION              0x00000002
//#define _ADCGIRQEN1_AGIEN2_MASK                  0x00000004
//#define _ADCGIRQEN1_AGIEN2_LENGTH                0x00000001

//#define _ADCGIRQEN1_AGIEN3_POSITION              0x00000003
//#define _ADCGIRQEN1_AGIEN3_MASK                  0x00000008
//#define _ADCGIRQEN1_AGIEN3_LENGTH                0x00000001

//#define _ADCGIRQEN1_AGIEN4_POSITION              0x00000004
//#define _ADCGIRQEN1_AGIEN4_MASK                  0x00000010
//#define _ADCGIRQEN1_AGIEN4_LENGTH                0x00000001

//#define _ADCGIRQEN1_AGIEN5_POSITION              0x00000005
//#define _ADCGIRQEN1_AGIEN5_MASK                  0x00000020
//#define _ADCGIRQEN1_AGIEN5_LENGTH                0x00000001

//#define _ADCGIRQEN1_AGIEN6_POSITION              0x00000006
//#define _ADCGIRQEN1_AGIEN6_MASK                  0x00000040
//#define _ADCGIRQEN1_AGIEN6_LENGTH                0x00000001

//#define _ADCGIRQEN1_AGIEN7_POSITION              0x00000007
//#define _ADCGIRQEN1_AGIEN7_MASK                  0x00000080
//#define _ADCGIRQEN1_AGIEN7_LENGTH                0x00000001

//#define _ADCGIRQEN1_AGIEN8_POSITION              0x00000008
//#define _ADCGIRQEN1_AGIEN8_MASK                  0x00000100
//#define _ADCGIRQEN1_AGIEN8_LENGTH                0x00000001

//#define _ADCGIRQEN1_AGIEN9_POSITION              0x00000009
//#define _ADCGIRQEN1_AGIEN9_MASK                  0x00000200
//#define _ADCGIRQEN1_AGIEN9_LENGTH                0x00000001

//#define _ADCGIRQEN1_AGIEN10_POSITION             0x0000000A
//#define _ADCGIRQEN1_AGIEN10_MASK                 0x00000400
//#define _ADCGIRQEN1_AGIEN10_LENGTH               0x00000001

//#define _ADCGIRQEN1_AGIEN11_POSITION             0x0000000B
//#define _ADCGIRQEN1_AGIEN11_MASK                 0x00000800
//#define _ADCGIRQEN1_AGIEN11_LENGTH               0x00000001

//#define _ADCGIRQEN1_AGIEN12_POSITION             0x0000000C
//#define _ADCGIRQEN1_AGIEN12_MASK                 0x00001000
//#define _ADCGIRQEN1_AGIEN12_LENGTH               0x00000001

//#define _ADCGIRQEN1_AGIEN13_POSITION             0x0000000D
//#define _ADCGIRQEN1_AGIEN13_MASK                 0x00002000
//#define _ADCGIRQEN1_AGIEN13_LENGTH               0x00000001

//#define _ADCGIRQEN1_AGIEN14_POSITION             0x0000000E
//#define _ADCGIRQEN1_AGIEN14_MASK                 0x00004000
//#define _ADCGIRQEN1_AGIEN14_LENGTH               0x00000001

//#define _ADCGIRQEN1_AGIEN15_POSITION             0x0000000F
//#define _ADCGIRQEN1_AGIEN15_MASK                 0x00008000
//#define _ADCGIRQEN1_AGIEN15_LENGTH               0x00000001

//#define _ADCGIRQEN1_AGIEN16_POSITION             0x00000010
//#define _ADCGIRQEN1_AGIEN16_MASK                 0x00010000
//#define _ADCGIRQEN1_AGIEN16_LENGTH               0x00000001

//#define _ADCGIRQEN1_AGIEN17_POSITION             0x00000011
//#define _ADCGIRQEN1_AGIEN17_MASK                 0x00020000
//#define _ADCGIRQEN1_AGIEN17_LENGTH               0x00000001

//#define _ADCGIRQEN1_AGIEN18_POSITION             0x00000012
//#define _ADCGIRQEN1_AGIEN18_MASK                 0x00040000
//#define _ADCGIRQEN1_AGIEN18_LENGTH               0x00000001

//#define _ADCGIRQEN1_AGIEN19_POSITION             0x00000013
//#define _ADCGIRQEN1_AGIEN19_MASK                 0x00080000
//#define _ADCGIRQEN1_AGIEN19_LENGTH               0x00000001

//#define _ADCGIRQEN1_AGIEN20_POSITION             0x00000014
//#define _ADCGIRQEN1_AGIEN20_MASK                 0x00100000
//#define _ADCGIRQEN1_AGIEN20_LENGTH               0x00000001

//#define _ADCGIRQEN1_AGIEN21_POSITION             0x00000015
//#define _ADCGIRQEN1_AGIEN21_MASK                 0x00200000
//#define _ADCGIRQEN1_AGIEN21_LENGTH               0x00000001

//#define _ADCGIRQEN1_AGIEN22_POSITION             0x00000016
//#define _ADCGIRQEN1_AGIEN22_MASK                 0x00400000
//#define _ADCGIRQEN1_AGIEN22_LENGTH               0x00000001

//#define _ADCGIRQEN1_AGIEN23_POSITION             0x00000017
//#define _ADCGIRQEN1_AGIEN23_MASK                 0x00800000
//#define _ADCGIRQEN1_AGIEN23_LENGTH               0x00000001

//#define _ADCGIRQEN1_AGIEN24_POSITION             0x00000018
//#define _ADCGIRQEN1_AGIEN24_MASK                 0x01000000
//#define _ADCGIRQEN1_AGIEN24_LENGTH               0x00000001

//#define _ADCGIRQEN1_AGIEN25_POSITION             0x00000019
//#define _ADCGIRQEN1_AGIEN25_MASK                 0x02000000
//#define _ADCGIRQEN1_AGIEN25_LENGTH               0x00000001

//#define _ADCGIRQEN1_AGIEN26_POSITION             0x0000001A
//#define _ADCGIRQEN1_AGIEN26_MASK                 0x04000000
//#define _ADCGIRQEN1_AGIEN26_LENGTH               0x00000001

//#define _ADCGIRQEN1_AGIEN27_POSITION             0x0000001B
//#define _ADCGIRQEN1_AGIEN27_MASK                 0x08000000
//#define _ADCGIRQEN1_AGIEN27_LENGTH               0x00000001

//#define _ADCGIRQEN1_AGIEN28_POSITION             0x0000001C
//#define _ADCGIRQEN1_AGIEN28_MASK                 0x10000000
//#define _ADCGIRQEN1_AGIEN28_LENGTH               0x00000001

//#define _ADCGIRQEN1_AGIEN29_POSITION             0x0000001D
//#define _ADCGIRQEN1_AGIEN29_MASK                 0x20000000
//#define _ADCGIRQEN1_AGIEN29_LENGTH               0x00000001

//#define _ADCGIRQEN1_AGIEN30_POSITION             0x0000001E
//#define _ADCGIRQEN1_AGIEN30_MASK                 0x40000000
//#define _ADCGIRQEN1_AGIEN30_LENGTH               0x00000001

//#define _ADCGIRQEN1_AGIEN31_POSITION             0x0000001F
//#define _ADCGIRQEN1_AGIEN31_MASK                 0x80000000
//#define _ADCGIRQEN1_AGIEN31_LENGTH               0x00000001

//#define _ADCGIRQEN2_AGIEN32_POSITION             0x00000000
//#define _ADCGIRQEN2_AGIEN32_MASK                 0x00000001
//#define _ADCGIRQEN2_AGIEN32_LENGTH               0x00000001

