HomuraVehicle/homuraLib_v2/machine/device/p32mz2048efg100_forVC.c
//#define _ADCCSS1_CSS21_POSITION                  0x00000015
//#define _ADCCSS1_CSS21_MASK                      0x00200000
//#define _ADCCSS1_CSS21_LENGTH                    0x00000001

//#define _ADCCSS1_CSS22_POSITION                  0x00000016
//#define _ADCCSS1_CSS22_MASK                      0x00400000
//#define _ADCCSS1_CSS22_LENGTH                    0x00000001

//#define _ADCCSS1_CSS23_POSITION                  0x00000017
//#define _ADCCSS1_CSS23_MASK                      0x00800000
//#define _ADCCSS1_CSS23_LENGTH                    0x00000001

//#define _ADCCSS1_CSS24_POSITION                  0x00000018
//#define _ADCCSS1_CSS24_MASK                      0x01000000
//#define _ADCCSS1_CSS24_LENGTH                    0x00000001

//#define _ADCCSS1_CSS25_POSITION                  0x00000019
//#define _ADCCSS1_CSS25_MASK                      0x02000000
//#define _ADCCSS1_CSS25_LENGTH                    0x00000001

//#define _ADCCSS1_CSS26_POSITION                  0x0000001A
//#define _ADCCSS1_CSS26_MASK                      0x04000000
//#define _ADCCSS1_CSS26_LENGTH                    0x00000001

//#define _ADCCSS1_CSS27_POSITION                  0x0000001B
//#define _ADCCSS1_CSS27_MASK                      0x08000000
//#define _ADCCSS1_CSS27_LENGTH                    0x00000001

//#define _ADCCSS1_CSS28_POSITION                  0x0000001C
//#define _ADCCSS1_CSS28_MASK                      0x10000000
//#define _ADCCSS1_CSS28_LENGTH                    0x00000001

//#define _ADCCSS1_CSS29_POSITION                  0x0000001D
//#define _ADCCSS1_CSS29_MASK                      0x20000000
//#define _ADCCSS1_CSS29_LENGTH                    0x00000001

//#define _ADCCSS1_CSS30_POSITION                  0x0000001E
//#define _ADCCSS1_CSS30_MASK                      0x40000000
//#define _ADCCSS1_CSS30_LENGTH                    0x00000001

//#define _ADCCSS1_CSS31_POSITION                  0x0000001F
//#define _ADCCSS1_CSS31_MASK                      0x80000000
//#define _ADCCSS1_CSS31_LENGTH                    0x00000001

//#define _ADCCSS2_CSS32_POSITION                  0x00000000
//#define _ADCCSS2_CSS32_MASK                      0x00000001
//#define _ADCCSS2_CSS32_LENGTH                    0x00000001

//#define _ADCCSS2_CSS33_POSITION                  0x00000001
//#define _ADCCSS2_CSS33_MASK                      0x00000002
//#define _ADCCSS2_CSS33_LENGTH                    0x00000001

//#define _ADCCSS2_CSS34_POSITION                  0x00000002
//#define _ADCCSS2_CSS34_MASK                      0x00000004
//#define _ADCCSS2_CSS34_LENGTH                    0x00000001

//#define _ADCCSS2_CSS35_POSITION                  0x00000003
//#define _ADCCSS2_CSS35_MASK                      0x00000008
//#define _ADCCSS2_CSS35_LENGTH                    0x00000001

//#define _ADCCSS2_CSS36_POSITION                  0x00000004
//#define _ADCCSS2_CSS36_MASK                      0x00000010
//#define _ADCCSS2_CSS36_LENGTH                    0x00000001

//#define _ADCCSS2_CSS37_POSITION                  0x00000005
//#define _ADCCSS2_CSS37_MASK                      0x00000020
//#define _ADCCSS2_CSS37_LENGTH                    0x00000001

//#define _ADCCSS2_CSS38_POSITION                  0x00000006
//#define _ADCCSS2_CSS38_MASK                      0x00000040
//#define _ADCCSS2_CSS38_LENGTH                    0x00000001

//#define _ADCCSS2_CSS39_POSITION                  0x00000007
//#define _ADCCSS2_CSS39_MASK                      0x00000080
//#define _ADCCSS2_CSS39_LENGTH                    0x00000001

//#define _ADCCSS2_CSS40_POSITION                  0x00000008
//#define _ADCCSS2_CSS40_MASK                      0x00000100
//#define _ADCCSS2_CSS40_LENGTH                    0x00000001

//#define _ADCCSS2_CSS41_POSITION                  0x00000009
//#define _ADCCSS2_CSS41_MASK                      0x00000200
//#define _ADCCSS2_CSS41_LENGTH                    0x00000001

//#define _ADCCSS2_CSS42_POSITION                  0x0000000A
//#define _ADCCSS2_CSS42_MASK                      0x00000400
//#define _ADCCSS2_CSS42_LENGTH                    0x00000001

//#define _ADCCSS2_CSS43_POSITION                  0x0000000B
//#define _ADCCSS2_CSS43_MASK                      0x00000800
//#define _ADCCSS2_CSS43_LENGTH                    0x00000001

//#define _ADCCSS2_CSS44_POSITION                  0x0000000C
//#define _ADCCSS2_CSS44_MASK                      0x00001000
//#define _ADCCSS2_CSS44_LENGTH                    0x00000001

//#define _ADCDSTAT1_ARDY0_POSITION                0x00000000
//#define _ADCDSTAT1_ARDY0_MASK                    0x00000001
//#define _ADCDSTAT1_ARDY0_LENGTH                  0x00000001

//#define _ADCDSTAT1_ARDY1_POSITION                0x00000001
//#define _ADCDSTAT1_ARDY1_MASK                    0x00000002
//#define _ADCDSTAT1_ARDY1_LENGTH                  0x00000001

//#define _ADCDSTAT1_ARDY2_POSITION                0x00000002
//#define _ADCDSTAT1_ARDY2_MASK                    0x00000004
//#define _ADCDSTAT1_ARDY2_LENGTH                  0x00000001

//#define _ADCDSTAT1_ARDY3_POSITION                0x00000003
//#define _ADCDSTAT1_ARDY3_MASK                    0x00000008
//#define _ADCDSTAT1_ARDY3_LENGTH                  0x00000001

//#define _ADCDSTAT1_ARDY4_POSITION                0x00000004
//#define _ADCDSTAT1_ARDY4_MASK                    0x00000010
//#define _ADCDSTAT1_ARDY4_LENGTH                  0x00000001

//#define _ADCDSTAT1_ARDY5_POSITION                0x00000005
//#define _ADCDSTAT1_ARDY5_MASK                    0x00000020
//#define _ADCDSTAT1_ARDY5_LENGTH                  0x00000001

//#define _ADCDSTAT1_ARDY6_POSITION                0x00000006
//#define _ADCDSTAT1_ARDY6_MASK                    0x00000040
//#define _ADCDSTAT1_ARDY6_LENGTH                  0x00000001

//#define _ADCDSTAT1_ARDY7_POSITION                0x00000007
//#define _ADCDSTAT1_ARDY7_MASK                    0x00000080
//#define _ADCDSTAT1_ARDY7_LENGTH                  0x00000001

//#define _ADCDSTAT1_ARDY8_POSITION                0x00000008
//#define _ADCDSTAT1_ARDY8_MASK                    0x00000100
//#define _ADCDSTAT1_ARDY8_LENGTH                  0x00000001

//#define _ADCDSTAT1_ARDY9_POSITION                0x00000009
//#define _ADCDSTAT1_ARDY9_MASK                    0x00000200
//#define _ADCDSTAT1_ARDY9_LENGTH                  0x00000001

//#define _ADCDSTAT1_ARDY10_POSITION               0x0000000A
//#define _ADCDSTAT1_ARDY10_MASK                   0x00000400
//#define _ADCDSTAT1_ARDY10_LENGTH                 0x00000001

//#define _ADCDSTAT1_ARDY11_POSITION               0x0000000B
//#define _ADCDSTAT1_ARDY11_MASK                   0x00000800
//#define _ADCDSTAT1_ARDY11_LENGTH                 0x00000001

//#define _ADCDSTAT1_ARDY12_POSITION               0x0000000C
//#define _ADCDSTAT1_ARDY12_MASK                   0x00001000
//#define _ADCDSTAT1_ARDY12_LENGTH                 0x00000001

//#define _ADCDSTAT1_ARDY13_POSITION               0x0000000D
//#define _ADCDSTAT1_ARDY13_MASK                   0x00002000
//#define _ADCDSTAT1_ARDY13_LENGTH                 0x00000001

