HomuraVehicle/homuraLib_v2/machine/device/p32mz2048efg100_forVC.c
//#define _ADCDSTAT1_ARDY14_POSITION               0x0000000E
//#define _ADCDSTAT1_ARDY14_MASK                   0x00004000
//#define _ADCDSTAT1_ARDY14_LENGTH                 0x00000001

//#define _ADCDSTAT1_ARDY15_POSITION               0x0000000F
//#define _ADCDSTAT1_ARDY15_MASK                   0x00008000
//#define _ADCDSTAT1_ARDY15_LENGTH                 0x00000001

//#define _ADCDSTAT1_ARDY16_POSITION               0x00000010
//#define _ADCDSTAT1_ARDY16_MASK                   0x00010000
//#define _ADCDSTAT1_ARDY16_LENGTH                 0x00000001

//#define _ADCDSTAT1_ARDY17_POSITION               0x00000011
//#define _ADCDSTAT1_ARDY17_MASK                   0x00020000
//#define _ADCDSTAT1_ARDY17_LENGTH                 0x00000001

//#define _ADCDSTAT1_ARDY18_POSITION               0x00000012
//#define _ADCDSTAT1_ARDY18_MASK                   0x00040000
//#define _ADCDSTAT1_ARDY18_LENGTH                 0x00000001

//#define _ADCDSTAT1_ARDY19_POSITION               0x00000013
//#define _ADCDSTAT1_ARDY19_MASK                   0x00080000
//#define _ADCDSTAT1_ARDY19_LENGTH                 0x00000001

//#define _ADCDSTAT1_ARDY20_POSITION               0x00000014
//#define _ADCDSTAT1_ARDY20_MASK                   0x00100000
//#define _ADCDSTAT1_ARDY20_LENGTH                 0x00000001

//#define _ADCDSTAT1_ARDY21_POSITION               0x00000015
//#define _ADCDSTAT1_ARDY21_MASK                   0x00200000
//#define _ADCDSTAT1_ARDY21_LENGTH                 0x00000001

//#define _ADCDSTAT1_ARDY22_POSITION               0x00000016
//#define _ADCDSTAT1_ARDY22_MASK                   0x00400000
//#define _ADCDSTAT1_ARDY22_LENGTH                 0x00000001

//#define _ADCDSTAT1_ARDY23_POSITION               0x00000017
//#define _ADCDSTAT1_ARDY23_MASK                   0x00800000
//#define _ADCDSTAT1_ARDY23_LENGTH                 0x00000001

//#define _ADCDSTAT1_ARDY24_POSITION               0x00000018
//#define _ADCDSTAT1_ARDY24_MASK                   0x01000000
//#define _ADCDSTAT1_ARDY24_LENGTH                 0x00000001

//#define _ADCDSTAT1_ARDY25_POSITION               0x00000019
//#define _ADCDSTAT1_ARDY25_MASK                   0x02000000
//#define _ADCDSTAT1_ARDY25_LENGTH                 0x00000001

//#define _ADCDSTAT1_ARDY26_POSITION               0x0000001A
//#define _ADCDSTAT1_ARDY26_MASK                   0x04000000
//#define _ADCDSTAT1_ARDY26_LENGTH                 0x00000001

//#define _ADCDSTAT1_ARDY27_POSITION               0x0000001B
//#define _ADCDSTAT1_ARDY27_MASK                   0x08000000
//#define _ADCDSTAT1_ARDY27_LENGTH                 0x00000001

//#define _ADCDSTAT1_ARDY28_POSITION               0x0000001C
//#define _ADCDSTAT1_ARDY28_MASK                   0x10000000
//#define _ADCDSTAT1_ARDY28_LENGTH                 0x00000001

//#define _ADCDSTAT1_ARDY29_POSITION               0x0000001D
//#define _ADCDSTAT1_ARDY29_MASK                   0x20000000
//#define _ADCDSTAT1_ARDY29_LENGTH                 0x00000001

//#define _ADCDSTAT1_ARDY30_POSITION               0x0000001E
//#define _ADCDSTAT1_ARDY30_MASK                   0x40000000
//#define _ADCDSTAT1_ARDY30_LENGTH                 0x00000001

//#define _ADCDSTAT1_ARDY31_POSITION               0x0000001F
//#define _ADCDSTAT1_ARDY31_MASK                   0x80000000
//#define _ADCDSTAT1_ARDY31_LENGTH                 0x00000001

//#define _ADCDSTAT2_ARDY32_POSITION               0x00000000
//#define _ADCDSTAT2_ARDY32_MASK                   0x00000001
//#define _ADCDSTAT2_ARDY32_LENGTH                 0x00000001

//#define _ADCDSTAT2_ARDY33_POSITION               0x00000001
//#define _ADCDSTAT2_ARDY33_MASK                   0x00000002
//#define _ADCDSTAT2_ARDY33_LENGTH                 0x00000001

//#define _ADCDSTAT2_ARDY34_POSITION               0x00000002
//#define _ADCDSTAT2_ARDY34_MASK                   0x00000004
//#define _ADCDSTAT2_ARDY34_LENGTH                 0x00000001

//#define _ADCDSTAT2_ARDY35_POSITION               0x00000003
//#define _ADCDSTAT2_ARDY35_MASK                   0x00000008
//#define _ADCDSTAT2_ARDY35_LENGTH                 0x00000001

//#define _ADCDSTAT2_ARDY36_POSITION               0x00000004
//#define _ADCDSTAT2_ARDY36_MASK                   0x00000010
//#define _ADCDSTAT2_ARDY36_LENGTH                 0x00000001

//#define _ADCDSTAT2_ARDY37_POSITION               0x00000005
//#define _ADCDSTAT2_ARDY37_MASK                   0x00000020
//#define _ADCDSTAT2_ARDY37_LENGTH                 0x00000001

//#define _ADCDSTAT2_ARDY38_POSITION               0x00000006
//#define _ADCDSTAT2_ARDY38_MASK                   0x00000040
//#define _ADCDSTAT2_ARDY38_LENGTH                 0x00000001

//#define _ADCDSTAT2_ARDY39_POSITION               0x00000007
//#define _ADCDSTAT2_ARDY39_MASK                   0x00000080
//#define _ADCDSTAT2_ARDY39_LENGTH                 0x00000001

//#define _ADCDSTAT2_ARDY40_POSITION               0x00000008
//#define _ADCDSTAT2_ARDY40_MASK                   0x00000100
//#define _ADCDSTAT2_ARDY40_LENGTH                 0x00000001

//#define _ADCDSTAT2_ARDY41_POSITION               0x00000009
//#define _ADCDSTAT2_ARDY41_MASK                   0x00000200
//#define _ADCDSTAT2_ARDY41_LENGTH                 0x00000001

//#define _ADCDSTAT2_ARDY42_POSITION               0x0000000A
//#define _ADCDSTAT2_ARDY42_MASK                   0x00000400
//#define _ADCDSTAT2_ARDY42_LENGTH                 0x00000001

//#define _ADCDSTAT2_ARDY43_POSITION               0x0000000B
//#define _ADCDSTAT2_ARDY43_MASK                   0x00000800
//#define _ADCDSTAT2_ARDY43_LENGTH                 0x00000001

//#define _ADCDSTAT2_ARDY44_POSITION               0x0000000C
//#define _ADCDSTAT2_ARDY44_MASK                   0x00001000
//#define _ADCDSTAT2_ARDY44_LENGTH                 0x00000001

//#define _ADCCMPEN1_CMPE0_POSITION                0x00000000
//#define _ADCCMPEN1_CMPE0_MASK                    0x00000001
//#define _ADCCMPEN1_CMPE0_LENGTH                  0x00000001

//#define _ADCCMPEN1_CMPE1_POSITION                0x00000001
//#define _ADCCMPEN1_CMPE1_MASK                    0x00000002
//#define _ADCCMPEN1_CMPE1_LENGTH                  0x00000001

//#define _ADCCMPEN1_CMPE2_POSITION                0x00000002
//#define _ADCCMPEN1_CMPE2_MASK                    0x00000004
//#define _ADCCMPEN1_CMPE2_LENGTH                  0x00000001

//#define _ADCCMPEN1_CMPE3_POSITION                0x00000003
//#define _ADCCMPEN1_CMPE3_MASK                    0x00000008
//#define _ADCCMPEN1_CMPE3_LENGTH                  0x00000001

//#define _ADCCMPEN1_CMPE4_POSITION                0x00000004
//#define _ADCCMPEN1_CMPE4_MASK                    0x00000010
//#define _ADCCMPEN1_CMPE4_LENGTH                  0x00000001

