HomuraVehicle/homuraLib_v2/machine/device/p32mz2048efg100_forVC.c
//#define _ADCFLTR1_DATA16EN_POSITION              0x0000001E
//#define _ADCFLTR1_DATA16EN_MASK                  0x40000000
//#define _ADCFLTR1_DATA16EN_LENGTH                0x00000001

//#define _ADCFLTR1_AFEN_POSITION                  0x0000001F
//#define _ADCFLTR1_AFEN_MASK                      0x80000000
//#define _ADCFLTR1_AFEN_LENGTH                    0x00000001

//#define _ADCFLTR2_FLTRDATA_POSITION              0x00000000
//#define _ADCFLTR2_FLTRDATA_MASK                  0x0000FFFF
//#define _ADCFLTR2_FLTRDATA_LENGTH                0x00000010

//#define _ADCFLTR2_CHNLID_POSITION                0x00000010
//#define _ADCFLTR2_CHNLID_MASK                    0x001F0000
//#define _ADCFLTR2_CHNLID_LENGTH                  0x00000005

//#define _ADCFLTR2_AFRDY_POSITION                 0x00000018
//#define _ADCFLTR2_AFRDY_MASK                     0x01000000
//#define _ADCFLTR2_AFRDY_LENGTH                   0x00000001

//#define _ADCFLTR2_AFGIEN_POSITION                0x00000019
//#define _ADCFLTR2_AFGIEN_MASK                    0x02000000
//#define _ADCFLTR2_AFGIEN_LENGTH                  0x00000001

//#define _ADCFLTR2_OVRSAM_POSITION                0x0000001A
//#define _ADCFLTR2_OVRSAM_MASK                    0x1C000000
//#define _ADCFLTR2_OVRSAM_LENGTH                  0x00000003

//#define _ADCFLTR2_DFMODE_POSITION                0x0000001D
//#define _ADCFLTR2_DFMODE_MASK                    0x20000000
//#define _ADCFLTR2_DFMODE_LENGTH                  0x00000001

//#define _ADCFLTR2_DATA16EN_POSITION              0x0000001E
//#define _ADCFLTR2_DATA16EN_MASK                  0x40000000
//#define _ADCFLTR2_DATA16EN_LENGTH                0x00000001

//#define _ADCFLTR2_AFEN_POSITION                  0x0000001F
//#define _ADCFLTR2_AFEN_MASK                      0x80000000
//#define _ADCFLTR2_AFEN_LENGTH                    0x00000001

//#define _ADCFLTR3_FLTRDATA_POSITION              0x00000000
//#define _ADCFLTR3_FLTRDATA_MASK                  0x0000FFFF
//#define _ADCFLTR3_FLTRDATA_LENGTH                0x00000010

//#define _ADCFLTR3_CHNLID_POSITION                0x00000010
//#define _ADCFLTR3_CHNLID_MASK                    0x001F0000
//#define _ADCFLTR3_CHNLID_LENGTH                  0x00000005

//#define _ADCFLTR3_AFRDY_POSITION                 0x00000018
//#define _ADCFLTR3_AFRDY_MASK                     0x01000000
//#define _ADCFLTR3_AFRDY_LENGTH                   0x00000001

//#define _ADCFLTR3_AFGIEN_POSITION                0x00000019
//#define _ADCFLTR3_AFGIEN_MASK                    0x02000000
//#define _ADCFLTR3_AFGIEN_LENGTH                  0x00000001

//#define _ADCFLTR3_OVRSAM_POSITION                0x0000001A
//#define _ADCFLTR3_OVRSAM_MASK                    0x1C000000
//#define _ADCFLTR3_OVRSAM_LENGTH                  0x00000003

//#define _ADCFLTR3_DFMODE_POSITION                0x0000001D
//#define _ADCFLTR3_DFMODE_MASK                    0x20000000
//#define _ADCFLTR3_DFMODE_LENGTH                  0x00000001

//#define _ADCFLTR3_DATA16EN_POSITION              0x0000001E
//#define _ADCFLTR3_DATA16EN_MASK                  0x40000000
//#define _ADCFLTR3_DATA16EN_LENGTH                0x00000001

//#define _ADCFLTR3_AFEN_POSITION                  0x0000001F
//#define _ADCFLTR3_AFEN_MASK                      0x80000000
//#define _ADCFLTR3_AFEN_LENGTH                    0x00000001

//#define _ADCFLTR4_FLTRDATA_POSITION              0x00000000
//#define _ADCFLTR4_FLTRDATA_MASK                  0x0000FFFF
//#define _ADCFLTR4_FLTRDATA_LENGTH                0x00000010

//#define _ADCFLTR4_CHNLID_POSITION                0x00000010
//#define _ADCFLTR4_CHNLID_MASK                    0x001F0000
//#define _ADCFLTR4_CHNLID_LENGTH                  0x00000005

//#define _ADCFLTR4_AFRDY_POSITION                 0x00000018
//#define _ADCFLTR4_AFRDY_MASK                     0x01000000
//#define _ADCFLTR4_AFRDY_LENGTH                   0x00000001

//#define _ADCFLTR4_AFGIEN_POSITION                0x00000019
//#define _ADCFLTR4_AFGIEN_MASK                    0x02000000
//#define _ADCFLTR4_AFGIEN_LENGTH                  0x00000001

//#define _ADCFLTR4_OVRSAM_POSITION                0x0000001A
//#define _ADCFLTR4_OVRSAM_MASK                    0x1C000000
//#define _ADCFLTR4_OVRSAM_LENGTH                  0x00000003

//#define _ADCFLTR4_DFMODE_POSITION                0x0000001D
//#define _ADCFLTR4_DFMODE_MASK                    0x20000000
//#define _ADCFLTR4_DFMODE_LENGTH                  0x00000001

//#define _ADCFLTR4_DATA16EN_POSITION              0x0000001E
//#define _ADCFLTR4_DATA16EN_MASK                  0x40000000
//#define _ADCFLTR4_DATA16EN_LENGTH                0x00000001

//#define _ADCFLTR4_AFEN_POSITION                  0x0000001F
//#define _ADCFLTR4_AFEN_MASK                      0x80000000
//#define _ADCFLTR4_AFEN_LENGTH                    0x00000001

//#define _ADCFLTR5_FLTRDATA_POSITION              0x00000000
//#define _ADCFLTR5_FLTRDATA_MASK                  0x0000FFFF
//#define _ADCFLTR5_FLTRDATA_LENGTH                0x00000010

//#define _ADCFLTR5_CHNLID_POSITION                0x00000010
//#define _ADCFLTR5_CHNLID_MASK                    0x001F0000
//#define _ADCFLTR5_CHNLID_LENGTH                  0x00000005

//#define _ADCFLTR5_AFRDY_POSITION                 0x00000018
//#define _ADCFLTR5_AFRDY_MASK                     0x01000000
//#define _ADCFLTR5_AFRDY_LENGTH                   0x00000001

//#define _ADCFLTR5_AFGIEN_POSITION                0x00000019
//#define _ADCFLTR5_AFGIEN_MASK                    0x02000000
//#define _ADCFLTR5_AFGIEN_LENGTH                  0x00000001

//#define _ADCFLTR5_OVRSAM_POSITION                0x0000001A
//#define _ADCFLTR5_OVRSAM_MASK                    0x1C000000
//#define _ADCFLTR5_OVRSAM_LENGTH                  0x00000003

//#define _ADCFLTR5_DFMODE_POSITION                0x0000001D
//#define _ADCFLTR5_DFMODE_MASK                    0x20000000
//#define _ADCFLTR5_DFMODE_LENGTH                  0x00000001

//#define _ADCFLTR5_DATA16EN_POSITION              0x0000001E
//#define _ADCFLTR5_DATA16EN_MASK                  0x40000000
//#define _ADCFLTR5_DATA16EN_LENGTH                0x00000001

//#define _ADCFLTR5_AFEN_POSITION                  0x0000001F
//#define _ADCFLTR5_AFEN_MASK                      0x80000000
//#define _ADCFLTR5_AFEN_LENGTH                    0x00000001

