HomuraVehicle/homuraLib_v2/machine/device/p32mz2048efg100_forVC.c
//#define _ADCFLTR6_FLTRDATA_POSITION              0x00000000
//#define _ADCFLTR6_FLTRDATA_MASK                  0x0000FFFF
//#define _ADCFLTR6_FLTRDATA_LENGTH                0x00000010

//#define _ADCFLTR6_CHNLID_POSITION                0x00000010
//#define _ADCFLTR6_CHNLID_MASK                    0x001F0000
//#define _ADCFLTR6_CHNLID_LENGTH                  0x00000005

//#define _ADCFLTR6_AFRDY_POSITION                 0x00000018
//#define _ADCFLTR6_AFRDY_MASK                     0x01000000
//#define _ADCFLTR6_AFRDY_LENGTH                   0x00000001

//#define _ADCFLTR6_AFGIEN_POSITION                0x00000019
//#define _ADCFLTR6_AFGIEN_MASK                    0x02000000
//#define _ADCFLTR6_AFGIEN_LENGTH                  0x00000001

//#define _ADCFLTR6_OVRSAM_POSITION                0x0000001A
//#define _ADCFLTR6_OVRSAM_MASK                    0x1C000000
//#define _ADCFLTR6_OVRSAM_LENGTH                  0x00000003

//#define _ADCFLTR6_DFMODE_POSITION                0x0000001D
//#define _ADCFLTR6_DFMODE_MASK                    0x20000000
//#define _ADCFLTR6_DFMODE_LENGTH                  0x00000001

//#define _ADCFLTR6_DATA16EN_POSITION              0x0000001E
//#define _ADCFLTR6_DATA16EN_MASK                  0x40000000
//#define _ADCFLTR6_DATA16EN_LENGTH                0x00000001

//#define _ADCFLTR6_AFEN_POSITION                  0x0000001F
//#define _ADCFLTR6_AFEN_MASK                      0x80000000
//#define _ADCFLTR6_AFEN_LENGTH                    0x00000001

//#define _ADCTRG1_TRGSRC0_POSITION                0x00000000
//#define _ADCTRG1_TRGSRC0_MASK                    0x0000001F
//#define _ADCTRG1_TRGSRC0_LENGTH                  0x00000005

//#define _ADCTRG1_TRGSRC1_POSITION                0x00000008
//#define _ADCTRG1_TRGSRC1_MASK                    0x00001F00
//#define _ADCTRG1_TRGSRC1_LENGTH                  0x00000005

//#define _ADCTRG1_TRGSRC2_POSITION                0x00000010
//#define _ADCTRG1_TRGSRC2_MASK                    0x001F0000
//#define _ADCTRG1_TRGSRC2_LENGTH                  0x00000005

//#define _ADCTRG1_TRGSRC3_POSITION                0x00000018
//#define _ADCTRG1_TRGSRC3_MASK                    0x1F000000
//#define _ADCTRG1_TRGSRC3_LENGTH                  0x00000005

//#define _ADCTRG2_TRGSRC4_POSITION                0x00000000
//#define _ADCTRG2_TRGSRC4_MASK                    0x0000001F
//#define _ADCTRG2_TRGSRC4_LENGTH                  0x00000005

//#define _ADCTRG2_TRGSRC5_POSITION                0x00000008
//#define _ADCTRG2_TRGSRC5_MASK                    0x00001F00
//#define _ADCTRG2_TRGSRC5_LENGTH                  0x00000005

//#define _ADCTRG2_TRGSRC6_POSITION                0x00000010
//#define _ADCTRG2_TRGSRC6_MASK                    0x001F0000
//#define _ADCTRG2_TRGSRC6_LENGTH                  0x00000005

//#define _ADCTRG2_TRGSRC7_POSITION                0x00000018
//#define _ADCTRG2_TRGSRC7_MASK                    0x1F000000
//#define _ADCTRG2_TRGSRC7_LENGTH                  0x00000005

//#define _ADCTRG3_TRGSRC8_POSITION                0x00000000
//#define _ADCTRG3_TRGSRC8_MASK                    0x0000001F
//#define _ADCTRG3_TRGSRC8_LENGTH                  0x00000005

//#define _ADCTRG3_TRGSRC9_POSITION                0x00000008
//#define _ADCTRG3_TRGSRC9_MASK                    0x00001F00
//#define _ADCTRG3_TRGSRC9_LENGTH                  0x00000005

//#define _ADCTRG3_TRGSRC10_POSITION               0x00000010
//#define _ADCTRG3_TRGSRC10_MASK                   0x001F0000
//#define _ADCTRG3_TRGSRC10_LENGTH                 0x00000005

//#define _ADCTRG3_TRGSRC11_POSITION               0x00000018
//#define _ADCTRG3_TRGSRC11_MASK                   0x1F000000
//#define _ADCTRG3_TRGSRC11_LENGTH                 0x00000005

//#define _ADCCMPCON1_IELOLO_POSITION              0x00000000
//#define _ADCCMPCON1_IELOLO_MASK                  0x00000001
//#define _ADCCMPCON1_IELOLO_LENGTH                0x00000001

//#define _ADCCMPCON1_IELOHI_POSITION              0x00000001
//#define _ADCCMPCON1_IELOHI_MASK                  0x00000002
//#define _ADCCMPCON1_IELOHI_LENGTH                0x00000001

//#define _ADCCMPCON1_IEHILO_POSITION              0x00000002
//#define _ADCCMPCON1_IEHILO_MASK                  0x00000004
//#define _ADCCMPCON1_IEHILO_LENGTH                0x00000001

//#define _ADCCMPCON1_IEHIHI_POSITION              0x00000003
//#define _ADCCMPCON1_IEHIHI_MASK                  0x00000008
//#define _ADCCMPCON1_IEHIHI_LENGTH                0x00000001

//#define _ADCCMPCON1_IEBTWN_POSITION              0x00000004
//#define _ADCCMPCON1_IEBTWN_MASK                  0x00000010
//#define _ADCCMPCON1_IEBTWN_LENGTH                0x00000001

//#define _ADCCMPCON1_DCMPED_POSITION              0x00000005
//#define _ADCCMPCON1_DCMPED_MASK                  0x00000020
//#define _ADCCMPCON1_DCMPED_LENGTH                0x00000001

//#define _ADCCMPCON1_DCMPGIEN_POSITION            0x00000006
//#define _ADCCMPCON1_DCMPGIEN_MASK                0x00000040
//#define _ADCCMPCON1_DCMPGIEN_LENGTH              0x00000001

//#define _ADCCMPCON1_ENDCMP_POSITION              0x00000007
//#define _ADCCMPCON1_ENDCMP_MASK                  0x00000080
//#define _ADCCMPCON1_ENDCMP_LENGTH                0x00000001

//#define _ADCCMPCON1_AINID_POSITION               0x00000008
//#define _ADCCMPCON1_AINID_MASK                   0x00003F00
//#define _ADCCMPCON1_AINID_LENGTH                 0x00000006

//#define _ADCCMPCON1_CVDDATA_POSITION             0x00000010
//#define _ADCCMPCON1_CVDDATA_MASK                 0xFFFF0000
//#define _ADCCMPCON1_CVDDATA_LENGTH               0x00000010

//#define _ADCCMPCON2_IELOLO_POSITION              0x00000000
//#define _ADCCMPCON2_IELOLO_MASK                  0x00000001
//#define _ADCCMPCON2_IELOLO_LENGTH                0x00000001

//#define _ADCCMPCON2_IELOHI_POSITION              0x00000001
//#define _ADCCMPCON2_IELOHI_MASK                  0x00000002
//#define _ADCCMPCON2_IELOHI_LENGTH                0x00000001

//#define _ADCCMPCON2_IEHILO_POSITION              0x00000002
//#define _ADCCMPCON2_IEHILO_MASK                  0x00000004
//#define _ADCCMPCON2_IEHILO_LENGTH                0x00000001

