HomuraVehicle/homuraLib_v2/machine/device/p32mz2048efg100_forVC.c
//#define _ADCCMPCON2_IEHIHI_POSITION              0x00000003
//#define _ADCCMPCON2_IEHIHI_MASK                  0x00000008
//#define _ADCCMPCON2_IEHIHI_LENGTH                0x00000001

//#define _ADCCMPCON2_IEBTWN_POSITION              0x00000004
//#define _ADCCMPCON2_IEBTWN_MASK                  0x00000010
//#define _ADCCMPCON2_IEBTWN_LENGTH                0x00000001

//#define _ADCCMPCON2_DCMPED_POSITION              0x00000005
//#define _ADCCMPCON2_DCMPED_MASK                  0x00000020
//#define _ADCCMPCON2_DCMPED_LENGTH                0x00000001

//#define _ADCCMPCON2_DCMPGIEN_POSITION            0x00000006
//#define _ADCCMPCON2_DCMPGIEN_MASK                0x00000040
//#define _ADCCMPCON2_DCMPGIEN_LENGTH              0x00000001

//#define _ADCCMPCON2_ENDCMP_POSITION              0x00000007
//#define _ADCCMPCON2_ENDCMP_MASK                  0x00000080
//#define _ADCCMPCON2_ENDCMP_LENGTH                0x00000001

//#define _ADCCMPCON2_AINID_POSITION               0x00000008
//#define _ADCCMPCON2_AINID_MASK                   0x00001F00
//#define _ADCCMPCON2_AINID_LENGTH                 0x00000005

//#define _ADCCMPCON3_IELOLO_POSITION              0x00000000
//#define _ADCCMPCON3_IELOLO_MASK                  0x00000001
//#define _ADCCMPCON3_IELOLO_LENGTH                0x00000001

//#define _ADCCMPCON3_IELOHI_POSITION              0x00000001
//#define _ADCCMPCON3_IELOHI_MASK                  0x00000002
//#define _ADCCMPCON3_IELOHI_LENGTH                0x00000001

//#define _ADCCMPCON3_IEHILO_POSITION              0x00000002
//#define _ADCCMPCON3_IEHILO_MASK                  0x00000004
//#define _ADCCMPCON3_IEHILO_LENGTH                0x00000001

//#define _ADCCMPCON3_IEHIHI_POSITION              0x00000003
//#define _ADCCMPCON3_IEHIHI_MASK                  0x00000008
//#define _ADCCMPCON3_IEHIHI_LENGTH                0x00000001

//#define _ADCCMPCON3_IEBTWN_POSITION              0x00000004
//#define _ADCCMPCON3_IEBTWN_MASK                  0x00000010
//#define _ADCCMPCON3_IEBTWN_LENGTH                0x00000001

//#define _ADCCMPCON3_DCMPED_POSITION              0x00000005
//#define _ADCCMPCON3_DCMPED_MASK                  0x00000020
//#define _ADCCMPCON3_DCMPED_LENGTH                0x00000001

//#define _ADCCMPCON3_DCMPGIEN_POSITION            0x00000006
//#define _ADCCMPCON3_DCMPGIEN_MASK                0x00000040
//#define _ADCCMPCON3_DCMPGIEN_LENGTH              0x00000001

//#define _ADCCMPCON3_ENDCMP_POSITION              0x00000007
//#define _ADCCMPCON3_ENDCMP_MASK                  0x00000080
//#define _ADCCMPCON3_ENDCMP_LENGTH                0x00000001

//#define _ADCCMPCON3_AINID_POSITION               0x00000008
//#define _ADCCMPCON3_AINID_MASK                   0x00001F00
//#define _ADCCMPCON3_AINID_LENGTH                 0x00000005

//#define _ADCCMPCON4_IELOLO_POSITION              0x00000000
//#define _ADCCMPCON4_IELOLO_MASK                  0x00000001
//#define _ADCCMPCON4_IELOLO_LENGTH                0x00000001

//#define _ADCCMPCON4_IELOHI_POSITION              0x00000001
//#define _ADCCMPCON4_IELOHI_MASK                  0x00000002
//#define _ADCCMPCON4_IELOHI_LENGTH                0x00000001

//#define _ADCCMPCON4_IEHILO_POSITION              0x00000002
//#define _ADCCMPCON4_IEHILO_MASK                  0x00000004
//#define _ADCCMPCON4_IEHILO_LENGTH                0x00000001

//#define _ADCCMPCON4_IEHIHI_POSITION              0x00000003
//#define _ADCCMPCON4_IEHIHI_MASK                  0x00000008
//#define _ADCCMPCON4_IEHIHI_LENGTH                0x00000001

//#define _ADCCMPCON4_IEBTWN_POSITION              0x00000004
//#define _ADCCMPCON4_IEBTWN_MASK                  0x00000010
//#define _ADCCMPCON4_IEBTWN_LENGTH                0x00000001

//#define _ADCCMPCON4_DCMPED_POSITION              0x00000005
//#define _ADCCMPCON4_DCMPED_MASK                  0x00000020
//#define _ADCCMPCON4_DCMPED_LENGTH                0x00000001

//#define _ADCCMPCON4_DCMPGIEN_POSITION            0x00000006
//#define _ADCCMPCON4_DCMPGIEN_MASK                0x00000040
//#define _ADCCMPCON4_DCMPGIEN_LENGTH              0x00000001

//#define _ADCCMPCON4_ENDCMP_POSITION              0x00000007
//#define _ADCCMPCON4_ENDCMP_MASK                  0x00000080
//#define _ADCCMPCON4_ENDCMP_LENGTH                0x00000001

//#define _ADCCMPCON4_AINID_POSITION               0x00000008
//#define _ADCCMPCON4_AINID_MASK                   0x00001F00
//#define _ADCCMPCON4_AINID_LENGTH                 0x00000005

//#define _ADCCMPCON5_IELOLO_POSITION              0x00000000
//#define _ADCCMPCON5_IELOLO_MASK                  0x00000001
//#define _ADCCMPCON5_IELOLO_LENGTH                0x00000001

//#define _ADCCMPCON5_IELOHI_POSITION              0x00000001
//#define _ADCCMPCON5_IELOHI_MASK                  0x00000002
//#define _ADCCMPCON5_IELOHI_LENGTH                0x00000001

//#define _ADCCMPCON5_IEHILO_POSITION              0x00000002
//#define _ADCCMPCON5_IEHILO_MASK                  0x00000004
//#define _ADCCMPCON5_IEHILO_LENGTH                0x00000001

//#define _ADCCMPCON5_IEHIHI_POSITION              0x00000003
//#define _ADCCMPCON5_IEHIHI_MASK                  0x00000008
//#define _ADCCMPCON5_IEHIHI_LENGTH                0x00000001

//#define _ADCCMPCON5_IEBTWN_POSITION              0x00000004
//#define _ADCCMPCON5_IEBTWN_MASK                  0x00000010
//#define _ADCCMPCON5_IEBTWN_LENGTH                0x00000001

//#define _ADCCMPCON5_DCMPED_POSITION              0x00000005
//#define _ADCCMPCON5_DCMPED_MASK                  0x00000020
//#define _ADCCMPCON5_DCMPED_LENGTH                0x00000001

//#define _ADCCMPCON5_DCMPGIEN_POSITION            0x00000006
//#define _ADCCMPCON5_DCMPGIEN_MASK                0x00000040
//#define _ADCCMPCON5_DCMPGIEN_LENGTH              0x00000001

//#define _ADCCMPCON5_ENDCMP_POSITION              0x00000007
//#define _ADCCMPCON5_ENDCMP_MASK                  0x00000080
//#define _ADCCMPCON5_ENDCMP_LENGTH                0x00000001

//#define _ADCCMPCON5_AINID_POSITION               0x00000008
//#define _ADCCMPCON5_AINID_MASK                   0x00001F00
//#define _ADCCMPCON5_AINID_LENGTH                 0x00000005

//#define _ADCCMPCON6_IELOLO_POSITION              0x00000000
//#define _ADCCMPCON6_IELOLO_MASK                  0x00000001
//#define _ADCCMPCON6_IELOLO_LENGTH                0x00000001

//#define _ADCCMPCON6_IELOHI_POSITION              0x00000001
//#define _ADCCMPCON6_IELOHI_MASK                  0x00000002
//#define _ADCCMPCON6_IELOHI_LENGTH                0x00000001

//#define _ADCCMPCON6_IEHILO_POSITION              0x00000002
//#define _ADCCMPCON6_IEHILO_MASK                  0x00000004
//#define _ADCCMPCON6_IEHILO_LENGTH                0x00000001

//#define _ADCCMPCON6_IEHIHI_POSITION              0x00000003
//#define _ADCCMPCON6_IEHIHI_MASK                  0x00000008
//#define _ADCCMPCON6_IEHIHI_LENGTH                0x00000001

//#define _ADCCMPCON6_IEBTWN_POSITION              0x00000004
//#define _ADCCMPCON6_IEBTWN_MASK                  0x00000010
//#define _ADCCMPCON6_IEBTWN_LENGTH                0x00000001

//#define _ADCCMPCON6_DCMPED_POSITION              0x00000005
//#define _ADCCMPCON6_DCMPED_MASK                  0x00000020
//#define _ADCCMPCON6_DCMPED_LENGTH                0x00000001

//#define _ADCCMPCON6_DCMPGIEN_POSITION            0x00000006
//#define _ADCCMPCON6_DCMPGIEN_MASK                0x00000040
//#define _ADCCMPCON6_DCMPGIEN_LENGTH              0x00000001

//#define _ADCCMPCON6_ENDCMP_POSITION              0x00000007
//#define _ADCCMPCON6_ENDCMP_MASK                  0x00000080
//#define _ADCCMPCON6_ENDCMP_LENGTH                0x00000001

