HomuraVehicle/homuraLib_v2/machine/device/p32mz2048efg100_forVC.c
//#define _ADCEIEN2_EIEN36_POSITION                0x00000004
//#define _ADCEIEN2_EIEN36_MASK                    0x00000010
//#define _ADCEIEN2_EIEN36_LENGTH                  0x00000001

//#define _ADCEIEN2_EIEN37_POSITION                0x00000005
//#define _ADCEIEN2_EIEN37_MASK                    0x00000020
//#define _ADCEIEN2_EIEN37_LENGTH                  0x00000001

//#define _ADCEIEN2_EIEN38_POSITION                0x00000006
//#define _ADCEIEN2_EIEN38_MASK                    0x00000040
//#define _ADCEIEN2_EIEN38_LENGTH                  0x00000001

//#define _ADCEIEN2_EIEN39_POSITION                0x00000007
//#define _ADCEIEN2_EIEN39_MASK                    0x00000080
//#define _ADCEIEN2_EIEN39_LENGTH                  0x00000001

//#define _ADCEIEN2_EIEN40_POSITION                0x00000008
//#define _ADCEIEN2_EIEN40_MASK                    0x00000100
//#define _ADCEIEN2_EIEN40_LENGTH                  0x00000001

//#define _ADCEIEN2_EIEN41_POSITION                0x00000009
//#define _ADCEIEN2_EIEN41_MASK                    0x00000200
//#define _ADCEIEN2_EIEN41_LENGTH                  0x00000001

//#define _ADCEIEN2_EIEN42_POSITION                0x0000000A
//#define _ADCEIEN2_EIEN42_MASK                    0x00000400
//#define _ADCEIEN2_EIEN42_LENGTH                  0x00000001

//#define _ADCEIEN2_EIEN43_POSITION                0x0000000B
//#define _ADCEIEN2_EIEN43_MASK                    0x00000800
//#define _ADCEIEN2_EIEN43_LENGTH                  0x00000001

//#define _ADCEIEN2_EIEN44_POSITION                0x0000000C
//#define _ADCEIEN2_EIEN44_MASK                    0x00001000
//#define _ADCEIEN2_EIEN44_LENGTH                  0x00000001

//#define _ADCEISTAT1_EIRDY0_POSITION              0x00000000
//#define _ADCEISTAT1_EIRDY0_MASK                  0x00000001
//#define _ADCEISTAT1_EIRDY0_LENGTH                0x00000001

//#define _ADCEISTAT1_EIRDY1_POSITION              0x00000001
//#define _ADCEISTAT1_EIRDY1_MASK                  0x00000002
//#define _ADCEISTAT1_EIRDY1_LENGTH                0x00000001

//#define _ADCEISTAT1_EIRDY2_POSITION              0x00000002
//#define _ADCEISTAT1_EIRDY2_MASK                  0x00000004
//#define _ADCEISTAT1_EIRDY2_LENGTH                0x00000001

//#define _ADCEISTAT1_EIRDY3_POSITION              0x00000003
//#define _ADCEISTAT1_EIRDY3_MASK                  0x00000008
//#define _ADCEISTAT1_EIRDY3_LENGTH                0x00000001

//#define _ADCEISTAT1_EIRDY4_POSITION              0x00000004
//#define _ADCEISTAT1_EIRDY4_MASK                  0x00000010
//#define _ADCEISTAT1_EIRDY4_LENGTH                0x00000001

//#define _ADCEISTAT1_EIRDY5_POSITION              0x00000005
//#define _ADCEISTAT1_EIRDY5_MASK                  0x00000020
//#define _ADCEISTAT1_EIRDY5_LENGTH                0x00000001

//#define _ADCEISTAT1_EIRDY6_POSITION              0x00000006
//#define _ADCEISTAT1_EIRDY6_MASK                  0x00000040
//#define _ADCEISTAT1_EIRDY6_LENGTH                0x00000001

//#define _ADCEISTAT1_EIRDY7_POSITION              0x00000007
//#define _ADCEISTAT1_EIRDY7_MASK                  0x00000080
//#define _ADCEISTAT1_EIRDY7_LENGTH                0x00000001

//#define _ADCEISTAT1_EIRDY8_POSITION              0x00000008
//#define _ADCEISTAT1_EIRDY8_MASK                  0x00000100
//#define _ADCEISTAT1_EIRDY8_LENGTH                0x00000001

//#define _ADCEISTAT1_EIRDY9_POSITION              0x00000009
//#define _ADCEISTAT1_EIRDY9_MASK                  0x00000200
//#define _ADCEISTAT1_EIRDY9_LENGTH                0x00000001

//#define _ADCEISTAT1_EIRDY10_POSITION             0x0000000A
//#define _ADCEISTAT1_EIRDY10_MASK                 0x00000400
//#define _ADCEISTAT1_EIRDY10_LENGTH               0x00000001

//#define _ADCEISTAT1_EIRDY11_POSITION             0x0000000B
//#define _ADCEISTAT1_EIRDY11_MASK                 0x00000800
//#define _ADCEISTAT1_EIRDY11_LENGTH               0x00000001

//#define _ADCEISTAT1_EIRDY12_POSITION             0x0000000C
//#define _ADCEISTAT1_EIRDY12_MASK                 0x00001000
//#define _ADCEISTAT1_EIRDY12_LENGTH               0x00000001

//#define _ADCEISTAT1_EIRDY13_POSITION             0x0000000D
//#define _ADCEISTAT1_EIRDY13_MASK                 0x00002000
//#define _ADCEISTAT1_EIRDY13_LENGTH               0x00000001

//#define _ADCEISTAT1_EIRDY14_POSITION             0x0000000E
//#define _ADCEISTAT1_EIRDY14_MASK                 0x00004000
//#define _ADCEISTAT1_EIRDY14_LENGTH               0x00000001

//#define _ADCEISTAT1_EIRDY15_POSITION             0x0000000F
//#define _ADCEISTAT1_EIRDY15_MASK                 0x00008000
//#define _ADCEISTAT1_EIRDY15_LENGTH               0x00000001

//#define _ADCEISTAT1_EIRDY16_POSITION             0x00000010
//#define _ADCEISTAT1_EIRDY16_MASK                 0x00010000
//#define _ADCEISTAT1_EIRDY16_LENGTH               0x00000001

//#define _ADCEISTAT1_EIRDY17_POSITION             0x00000011
//#define _ADCEISTAT1_EIRDY17_MASK                 0x00020000
//#define _ADCEISTAT1_EIRDY17_LENGTH               0x00000001

//#define _ADCEISTAT1_EIRDY18_POSITION             0x00000012
//#define _ADCEISTAT1_EIRDY18_MASK                 0x00040000
//#define _ADCEISTAT1_EIRDY18_LENGTH               0x00000001

//#define _ADCEISTAT1_EIRDY19_POSITION             0x00000013
//#define _ADCEISTAT1_EIRDY19_MASK                 0x00080000
//#define _ADCEISTAT1_EIRDY19_LENGTH               0x00000001

//#define _ADCEISTAT1_EIRDY20_POSITION             0x00000014
//#define _ADCEISTAT1_EIRDY20_MASK                 0x00100000
//#define _ADCEISTAT1_EIRDY20_LENGTH               0x00000001

//#define _ADCEISTAT1_EIRDY21_POSITION             0x00000015
//#define _ADCEISTAT1_EIRDY21_MASK                 0x00200000
//#define _ADCEISTAT1_EIRDY21_LENGTH               0x00000001

//#define _ADCEISTAT1_EIRDY22_POSITION             0x00000016
//#define _ADCEISTAT1_EIRDY22_MASK                 0x00400000
//#define _ADCEISTAT1_EIRDY22_LENGTH               0x00000001

//#define _ADCEISTAT1_EIRDY23_POSITION             0x00000017
//#define _ADCEISTAT1_EIRDY23_MASK                 0x00800000
//#define _ADCEISTAT1_EIRDY23_LENGTH               0x00000001

//#define _ADCEISTAT1_EIRDY24_POSITION             0x00000018
//#define _ADCEISTAT1_EIRDY24_MASK                 0x01000000
//#define _ADCEISTAT1_EIRDY24_LENGTH               0x00000001

//#define _ADCEISTAT1_EIRDY25_POSITION             0x00000019
//#define _ADCEISTAT1_EIRDY25_MASK                 0x02000000
//#define _ADCEISTAT1_EIRDY25_LENGTH               0x00000001

