HomuraVehicle/homuraLib_v2/machine/device/p32mz2048efg100_forVC.c
//#define _ADCANCON_WKIEN3_POSITION                0x00000013
//#define _ADCANCON_WKIEN3_MASK                    0x00080000
//#define _ADCANCON_WKIEN3_LENGTH                  0x00000001

//#define _ADCANCON_WKIEN4_POSITION                0x00000014
//#define _ADCANCON_WKIEN4_MASK                    0x00100000
//#define _ADCANCON_WKIEN4_LENGTH                  0x00000001

//#define _ADCANCON_WKIEN7_POSITION                0x00000017
//#define _ADCANCON_WKIEN7_MASK                    0x00800000
//#define _ADCANCON_WKIEN7_LENGTH                  0x00000001

//#define _ADCANCON_WKUPCLKCNT_POSITION            0x00000018
//#define _ADCANCON_WKUPCLKCNT_MASK                0x0F000000
//#define _ADCANCON_WKUPCLKCNT_LENGTH              0x00000004

//#define _ADC0CFG_ADCCFG_POSITION                 0x00000000
//#define _ADC0CFG_ADCCFG_MASK                     0xFFFFFFFF
//#define _ADC0CFG_ADCCFG_LENGTH                   0x00000020

//#define _ADC1CFG_ADCCFG_POSITION                 0x00000000
//#define _ADC1CFG_ADCCFG_MASK                     0xFFFFFFFF
//#define _ADC1CFG_ADCCFG_LENGTH                   0x00000020

//#define _ADC2CFG_ADCCFG_POSITION                 0x00000000
//#define _ADC2CFG_ADCCFG_MASK                     0xFFFFFFFF
//#define _ADC2CFG_ADCCFG_LENGTH                   0x00000020

//#define _ADC3CFG_ADCCFG_POSITION                 0x00000000
//#define _ADC3CFG_ADCCFG_MASK                     0xFFFFFFFF
//#define _ADC3CFG_ADCCFG_LENGTH                   0x00000020

//#define _ADC4CFG_ADCCFG_POSITION                 0x00000000
//#define _ADC4CFG_ADCCFG_MASK                     0xFFFFFFFF
//#define _ADC4CFG_ADCCFG_LENGTH                   0x00000020

//#define _ADC7CFG_ADCCFG_POSITION                 0x00000000
//#define _ADC7CFG_ADCCFG_MASK                     0xFFFFFFFF
//#define _ADC7CFG_ADCCFG_LENGTH                   0x00000020

//#define _ADCSYSCFG0_AN0_POSITION                 0x00000000
//#define _ADCSYSCFG0_AN0_MASK                     0x00000001
//#define _ADCSYSCFG0_AN0_LENGTH                   0x00000001

//#define _ADCSYSCFG0_AN1_POSITION                 0x00000001
//#define _ADCSYSCFG0_AN1_MASK                     0x00000002
//#define _ADCSYSCFG0_AN1_LENGTH                   0x00000001

//#define _ADCSYSCFG0_AN2_POSITION                 0x00000002
//#define _ADCSYSCFG0_AN2_MASK                     0x00000004
//#define _ADCSYSCFG0_AN2_LENGTH                   0x00000001

//#define _ADCSYSCFG0_AN3_POSITION                 0x00000003
//#define _ADCSYSCFG0_AN3_MASK                     0x00000008
//#define _ADCSYSCFG0_AN3_LENGTH                   0x00000001

//#define _ADCSYSCFG0_AN4_POSITION                 0x00000004
//#define _ADCSYSCFG0_AN4_MASK                     0x00000010
//#define _ADCSYSCFG0_AN4_LENGTH                   0x00000001

//#define _ADCSYSCFG0_AN5_POSITION                 0x00000005
//#define _ADCSYSCFG0_AN5_MASK                     0x00000020
//#define _ADCSYSCFG0_AN5_LENGTH                   0x00000001

//#define _ADCSYSCFG0_AN6_POSITION                 0x00000006
//#define _ADCSYSCFG0_AN6_MASK                     0x00000040
//#define _ADCSYSCFG0_AN6_LENGTH                   0x00000001

//#define _ADCSYSCFG0_AN7_POSITION                 0x00000007
//#define _ADCSYSCFG0_AN7_MASK                     0x00000080
//#define _ADCSYSCFG0_AN7_LENGTH                   0x00000001

//#define _ADCSYSCFG0_AN8_POSITION                 0x00000008
//#define _ADCSYSCFG0_AN8_MASK                     0x00000100
//#define _ADCSYSCFG0_AN8_LENGTH                   0x00000001

//#define _ADCSYSCFG0_AN9_POSITION                 0x00000009
//#define _ADCSYSCFG0_AN9_MASK                     0x00000200
//#define _ADCSYSCFG0_AN9_LENGTH                   0x00000001

//#define _ADCSYSCFG0_AN10_POSITION                0x0000000A
//#define _ADCSYSCFG0_AN10_MASK                    0x00000400
//#define _ADCSYSCFG0_AN10_LENGTH                  0x00000001

//#define _ADCSYSCFG0_AN11_POSITION                0x0000000B
//#define _ADCSYSCFG0_AN11_MASK                    0x00000800
//#define _ADCSYSCFG0_AN11_LENGTH                  0x00000001

//#define _ADCSYSCFG0_AN12_POSITION                0x0000000C
//#define _ADCSYSCFG0_AN12_MASK                    0x00001000
//#define _ADCSYSCFG0_AN12_LENGTH                  0x00000001

//#define _ADCSYSCFG0_AN13_POSITION                0x0000000D
//#define _ADCSYSCFG0_AN13_MASK                    0x00002000
//#define _ADCSYSCFG0_AN13_LENGTH                  0x00000001

//#define _ADCSYSCFG0_AN14_POSITION                0x0000000E
//#define _ADCSYSCFG0_AN14_MASK                    0x00004000
//#define _ADCSYSCFG0_AN14_LENGTH                  0x00000001

//#define _ADCSYSCFG0_AN15_POSITION                0x0000000F
//#define _ADCSYSCFG0_AN15_MASK                    0x00008000
//#define _ADCSYSCFG0_AN15_LENGTH                  0x00000001

//#define _ADCSYSCFG0_AN16_POSITION                0x00000010
//#define _ADCSYSCFG0_AN16_MASK                    0x00010000
//#define _ADCSYSCFG0_AN16_LENGTH                  0x00000001

//#define _ADCSYSCFG0_AN17_POSITION                0x00000011
//#define _ADCSYSCFG0_AN17_MASK                    0x00020000
//#define _ADCSYSCFG0_AN17_LENGTH                  0x00000001

//#define _ADCSYSCFG0_AN18_POSITION                0x00000012
//#define _ADCSYSCFG0_AN18_MASK                    0x00040000
//#define _ADCSYSCFG0_AN18_LENGTH                  0x00000001

//#define _ADCSYSCFG0_AN19_POSITION                0x00000013
//#define _ADCSYSCFG0_AN19_MASK                    0x00080000
//#define _ADCSYSCFG0_AN19_LENGTH                  0x00000001

//#define _ADCSYSCFG0_AN20_POSITION                0x00000014
//#define _ADCSYSCFG0_AN20_MASK                    0x00100000
//#define _ADCSYSCFG0_AN20_LENGTH                  0x00000001

//#define _ADCSYSCFG0_AN21_POSITION                0x00000015
//#define _ADCSYSCFG0_AN21_MASK                    0x00200000
//#define _ADCSYSCFG0_AN21_LENGTH                  0x00000001

//#define _ADCSYSCFG0_AN22_POSITION                0x00000016
//#define _ADCSYSCFG0_AN22_MASK                    0x00400000
//#define _ADCSYSCFG0_AN22_LENGTH                  0x00000001

//#define _ADCSYSCFG0_AN23_POSITION                0x00000017
//#define _ADCSYSCFG0_AN23_MASK                    0x00800000
//#define _ADCSYSCFG0_AN23_LENGTH                  0x00000001

//#define _ADCSYSCFG0_AN24_POSITION                0x00000018
//#define _ADCSYSCFG0_AN24_MASK                    0x01000000
//#define _ADCSYSCFG0_AN24_LENGTH                  0x00000001

//#define _ADCSYSCFG0_AN25_POSITION                0x00000019
//#define _ADCSYSCFG0_AN25_MASK                    0x02000000
//#define _ADCSYSCFG0_AN25_LENGTH                  0x00000001

//#define _ADCSYSCFG0_AN26_POSITION                0x0000001A
//#define _ADCSYSCFG0_AN26_MASK                    0x04000000
//#define _ADCSYSCFG0_AN26_LENGTH                  0x00000001

//#define _ADCSYSCFG0_AN27_POSITION                0x0000001B
//#define _ADCSYSCFG0_AN27_MASK                    0x08000000
//#define _ADCSYSCFG0_AN27_LENGTH                  0x00000001

//#define _ADCSYSCFG0_AN28_POSITION                0x0000001C
//#define _ADCSYSCFG0_AN28_MASK                    0x10000000
//#define _ADCSYSCFG0_AN28_LENGTH                  0x00000001

//#define _ADCSYSCFG0_AN29_POSITION                0x0000001D
//#define _ADCSYSCFG0_AN29_MASK                    0x20000000
//#define _ADCSYSCFG0_AN29_LENGTH                  0x00000001

//#define _ADCSYSCFG0_AN30_POSITION                0x0000001E
//#define _ADCSYSCFG0_AN30_MASK                    0x40000000
//#define _ADCSYSCFG0_AN30_LENGTH                  0x00000001

