HomuraVehicle/homuraLib_v2/machine/device/p32mz2048efg100_forVC.c
//#define _ADCSYSCFG0_AN31_POSITION                0x0000001F
//#define _ADCSYSCFG0_AN31_MASK                    0x80000000
//#define _ADCSYSCFG0_AN31_LENGTH                  0x00000001

//#define _ADCSYSCFG1_AN32_POSITION                0x00000000
//#define _ADCSYSCFG1_AN32_MASK                    0x00000001
//#define _ADCSYSCFG1_AN32_LENGTH                  0x00000001

//#define _ADCSYSCFG1_AN33_POSITION                0x00000001
//#define _ADCSYSCFG1_AN33_MASK                    0x00000002
//#define _ADCSYSCFG1_AN33_LENGTH                  0x00000001

//#define _ADCSYSCFG1_AN34_POSITION                0x00000002
//#define _ADCSYSCFG1_AN34_MASK                    0x00000004
//#define _ADCSYSCFG1_AN34_LENGTH                  0x00000001

//#define _ADCSYSCFG1_AN35_POSITION                0x00000003
//#define _ADCSYSCFG1_AN35_MASK                    0x00000008
//#define _ADCSYSCFG1_AN35_LENGTH                  0x00000001

//#define _ADCSYSCFG1_AN36_POSITION                0x00000004
//#define _ADCSYSCFG1_AN36_MASK                    0x00000010
//#define _ADCSYSCFG1_AN36_LENGTH                  0x00000001

//#define _ADCSYSCFG1_AN37_POSITION                0x00000005
//#define _ADCSYSCFG1_AN37_MASK                    0x00000020
//#define _ADCSYSCFG1_AN37_LENGTH                  0x00000001

//#define _ADCSYSCFG1_AN38_POSITION                0x00000006
//#define _ADCSYSCFG1_AN38_MASK                    0x00000040
//#define _ADCSYSCFG1_AN38_LENGTH                  0x00000001

//#define _ADCSYSCFG1_AN39_POSITION                0x00000007
//#define _ADCSYSCFG1_AN39_MASK                    0x00000080
//#define _ADCSYSCFG1_AN39_LENGTH                  0x00000001

//#define _ADCSYSCFG1_AN40_POSITION                0x00000008
//#define _ADCSYSCFG1_AN40_MASK                    0x00000100
//#define _ADCSYSCFG1_AN40_LENGTH                  0x00000001

//#define _ADCSYSCFG1_AN41_POSITION                0x00000009
//#define _ADCSYSCFG1_AN41_MASK                    0x00000200
//#define _ADCSYSCFG1_AN41_LENGTH                  0x00000001

//#define _ADCSYSCFG1_AN42_POSITION                0x0000000A
//#define _ADCSYSCFG1_AN42_MASK                    0x00000400
//#define _ADCSYSCFG1_AN42_LENGTH                  0x00000001

//#define _ADCSYSCFG1_AN43_POSITION                0x0000000B
//#define _ADCSYSCFG1_AN43_MASK                    0x00000800
//#define _ADCSYSCFG1_AN43_LENGTH                  0x00000001

//#define _ADCSYSCFG1_AN44_POSITION                0x0000000C
//#define _ADCSYSCFG1_AN44_MASK                    0x00001000
//#define _ADCSYSCFG1_AN44_LENGTH                  0x00000001

//#define _ADCSYSCFG1_AN45_POSITION                0x0000000D
//#define _ADCSYSCFG1_AN45_MASK                    0x00002000
//#define _ADCSYSCFG1_AN45_LENGTH                  0x00000001

//#define _ADCSYSCFG1_AN46_POSITION                0x0000000E
//#define _ADCSYSCFG1_AN46_MASK                    0x00004000
//#define _ADCSYSCFG1_AN46_LENGTH                  0x00000001

//#define _ADCSYSCFG1_AN47_POSITION                0x0000000F
//#define _ADCSYSCFG1_AN47_MASK                    0x00008000
//#define _ADCSYSCFG1_AN47_LENGTH                  0x00000001

//#define _ADCSYSCFG1_AN48_POSITION                0x00000010
//#define _ADCSYSCFG1_AN48_MASK                    0x00010000
//#define _ADCSYSCFG1_AN48_LENGTH                  0x00000001

//#define _ADCSYSCFG1_AN49_POSITION                0x00000011
//#define _ADCSYSCFG1_AN49_MASK                    0x00020000
//#define _ADCSYSCFG1_AN49_LENGTH                  0x00000001

//#define _ADCSYSCFG1_AN50_POSITION                0x00000012
//#define _ADCSYSCFG1_AN50_MASK                    0x00040000
//#define _ADCSYSCFG1_AN50_LENGTH                  0x00000001

//#define _ADCSYSCFG1_AN51_POSITION                0x00000013
//#define _ADCSYSCFG1_AN51_MASK                    0x00080000
//#define _ADCSYSCFG1_AN51_LENGTH                  0x00000001

//#define _ADCSYSCFG1_AN52_POSITION                0x00000014
//#define _ADCSYSCFG1_AN52_MASK                    0x00100000
//#define _ADCSYSCFG1_AN52_LENGTH                  0x00000001

//#define _ADCSYSCFG1_AN53_POSITION                0x00000015
//#define _ADCSYSCFG1_AN53_MASK                    0x00200000
//#define _ADCSYSCFG1_AN53_LENGTH                  0x00000001

//#define _ADCSYSCFG1_AN54_POSITION                0x00000016
//#define _ADCSYSCFG1_AN54_MASK                    0x00400000
//#define _ADCSYSCFG1_AN54_LENGTH                  0x00000001

//#define _ADCSYSCFG1_AN55_POSITION                0x00000017
//#define _ADCSYSCFG1_AN55_MASK                    0x00800000
//#define _ADCSYSCFG1_AN55_LENGTH                  0x00000001

//#define _ADCSYSCFG1_AN56_POSITION                0x00000018
//#define _ADCSYSCFG1_AN56_MASK                    0x01000000
//#define _ADCSYSCFG1_AN56_LENGTH                  0x00000001

//#define _ADCSYSCFG1_AN57_POSITION                0x00000019
//#define _ADCSYSCFG1_AN57_MASK                    0x02000000
//#define _ADCSYSCFG1_AN57_LENGTH                  0x00000001

//#define _ADCSYSCFG1_AN58_POSITION                0x0000001A
//#define _ADCSYSCFG1_AN58_MASK                    0x04000000
//#define _ADCSYSCFG1_AN58_LENGTH                  0x00000001

//#define _ADCSYSCFG1_AN59_POSITION                0x0000001B
//#define _ADCSYSCFG1_AN59_MASK                    0x08000000
//#define _ADCSYSCFG1_AN59_LENGTH                  0x00000001

//#define _ADCSYSCFG1_AN60_POSITION                0x0000001C
//#define _ADCSYSCFG1_AN60_MASK                    0x10000000
//#define _ADCSYSCFG1_AN60_LENGTH                  0x00000001

//#define _ADCSYSCFG1_AN61_POSITION                0x0000001D
//#define _ADCSYSCFG1_AN61_MASK                    0x20000000
//#define _ADCSYSCFG1_AN61_LENGTH                  0x00000001

//#define _ADCSYSCFG1_AN62_POSITION                0x0000001E
//#define _ADCSYSCFG1_AN62_MASK                    0x40000000
//#define _ADCSYSCFG1_AN62_LENGTH                  0x00000001

//#define _ADCSYSCFG1_AN63_POSITION                0x0000001F
//#define _ADCSYSCFG1_AN63_MASK                    0x80000000
//#define _ADCSYSCFG1_AN63_LENGTH                  0x00000001

//#define _ADCDATA0_DATA_POSITION                  0x00000000
//#define _ADCDATA0_DATA_MASK                      0xFFFFFFFF
//#define _ADCDATA0_DATA_LENGTH                    0x00000020

//#define _ADCDATA1_DATA_POSITION                  0x00000000
//#define _ADCDATA1_DATA_MASK                      0xFFFFFFFF
//#define _ADCDATA1_DATA_LENGTH                    0x00000020

