HomuraVehicle/homuraLib_v2/machine/device/p32mz2048efg100_forVC.c
//#define _ADCDATA2_DATA_POSITION                  0x00000000
//#define _ADCDATA2_DATA_MASK                      0xFFFFFFFF
//#define _ADCDATA2_DATA_LENGTH                    0x00000020

//#define _ADCDATA3_DATA_POSITION                  0x00000000
//#define _ADCDATA3_DATA_MASK                      0xFFFFFFFF
//#define _ADCDATA3_DATA_LENGTH                    0x00000020

//#define _ADCDATA4_DATA_POSITION                  0x00000000
//#define _ADCDATA4_DATA_MASK                      0xFFFFFFFF
//#define _ADCDATA4_DATA_LENGTH                    0x00000020

//#define _ADCDATA5_DATA_POSITION                  0x00000000
//#define _ADCDATA5_DATA_MASK                      0xFFFFFFFF
//#define _ADCDATA5_DATA_LENGTH                    0x00000020

//#define _ADCDATA6_DATA_POSITION                  0x00000000
//#define _ADCDATA6_DATA_MASK                      0xFFFFFFFF
//#define _ADCDATA6_DATA_LENGTH                    0x00000020

//#define _ADCDATA7_DATA_POSITION                  0x00000000
//#define _ADCDATA7_DATA_MASK                      0xFFFFFFFF
//#define _ADCDATA7_DATA_LENGTH                    0x00000020

//#define _ADCDATA8_DATA_POSITION                  0x00000000
//#define _ADCDATA8_DATA_MASK                      0xFFFFFFFF
//#define _ADCDATA8_DATA_LENGTH                    0x00000020

//#define _ADCDATA9_DATA_POSITION                  0x00000000
//#define _ADCDATA9_DATA_MASK                      0xFFFFFFFF
//#define _ADCDATA9_DATA_LENGTH                    0x00000020

//#define _ADCDATA10_DATA_POSITION                 0x00000000
//#define _ADCDATA10_DATA_MASK                     0xFFFFFFFF
//#define _ADCDATA10_DATA_LENGTH                   0x00000020

//#define _ADCDATA11_DATA_POSITION                 0x00000000
//#define _ADCDATA11_DATA_MASK                     0xFFFFFFFF
//#define _ADCDATA11_DATA_LENGTH                   0x00000020

//#define _ADCDATA12_DATA_POSITION                 0x00000000
//#define _ADCDATA12_DATA_MASK                     0xFFFFFFFF
//#define _ADCDATA12_DATA_LENGTH                   0x00000020

//#define _ADCDATA13_DATA_POSITION                 0x00000000
//#define _ADCDATA13_DATA_MASK                     0xFFFFFFFF
//#define _ADCDATA13_DATA_LENGTH                   0x00000020

//#define _ADCDATA14_DATA_POSITION                 0x00000000
//#define _ADCDATA14_DATA_MASK                     0xFFFFFFFF
//#define _ADCDATA14_DATA_LENGTH                   0x00000020

//#define _ADCDATA15_DATA_POSITION                 0x00000000
//#define _ADCDATA15_DATA_MASK                     0xFFFFFFFF
//#define _ADCDATA15_DATA_LENGTH                   0x00000020

//#define _ADCDATA16_DATA_POSITION                 0x00000000
//#define _ADCDATA16_DATA_MASK                     0xFFFFFFFF
//#define _ADCDATA16_DATA_LENGTH                   0x00000020

//#define _ADCDATA17_DATA_POSITION                 0x00000000
//#define _ADCDATA17_DATA_MASK                     0xFFFFFFFF
//#define _ADCDATA17_DATA_LENGTH                   0x00000020

//#define _ADCDATA18_DATA_POSITION                 0x00000000
//#define _ADCDATA18_DATA_MASK                     0xFFFFFFFF
//#define _ADCDATA18_DATA_LENGTH                   0x00000020

//#define _ADCDATA19_DATA_POSITION                 0x00000000
//#define _ADCDATA19_DATA_MASK                     0xFFFFFFFF
//#define _ADCDATA19_DATA_LENGTH                   0x00000020

//#define _ADCDATA20_DATA_POSITION                 0x00000000
//#define _ADCDATA20_DATA_MASK                     0xFFFFFFFF
//#define _ADCDATA20_DATA_LENGTH                   0x00000020

//#define _ADCDATA21_DATA_POSITION                 0x00000000
//#define _ADCDATA21_DATA_MASK                     0xFFFFFFFF
//#define _ADCDATA21_DATA_LENGTH                   0x00000020

//#define _ADCDATA22_DATA_POSITION                 0x00000000
//#define _ADCDATA22_DATA_MASK                     0xFFFFFFFF
//#define _ADCDATA22_DATA_LENGTH                   0x00000020

//#define _ADCDATA23_DATA_POSITION                 0x00000000
//#define _ADCDATA23_DATA_MASK                     0xFFFFFFFF
//#define _ADCDATA23_DATA_LENGTH                   0x00000020

//#define _ADCDATA24_DATA_POSITION                 0x00000000
//#define _ADCDATA24_DATA_MASK                     0xFFFFFFFF
//#define _ADCDATA24_DATA_LENGTH                   0x00000020

//#define _ADCDATA25_DATA_POSITION                 0x00000000
//#define _ADCDATA25_DATA_MASK                     0xFFFFFFFF
//#define _ADCDATA25_DATA_LENGTH                   0x00000020

//#define _ADCDATA26_DATA_POSITION                 0x00000000
//#define _ADCDATA26_DATA_MASK                     0xFFFFFFFF
//#define _ADCDATA26_DATA_LENGTH                   0x00000020

//#define _ADCDATA27_DATA_POSITION                 0x00000000
//#define _ADCDATA27_DATA_MASK                     0xFFFFFFFF
//#define _ADCDATA27_DATA_LENGTH                   0x00000020

//#define _ADCDATA28_DATA_POSITION                 0x00000000
//#define _ADCDATA28_DATA_MASK                     0xFFFFFFFF
//#define _ADCDATA28_DATA_LENGTH                   0x00000020

//#define _ADCDATA29_DATA_POSITION                 0x00000000
//#define _ADCDATA29_DATA_MASK                     0xFFFFFFFF
//#define _ADCDATA29_DATA_LENGTH                   0x00000020

//#define _ADCDATA30_DATA_POSITION                 0x00000000
//#define _ADCDATA30_DATA_MASK                     0xFFFFFFFF
//#define _ADCDATA30_DATA_LENGTH                   0x00000020

//#define _ADCDATA31_DATA_POSITION                 0x00000000
//#define _ADCDATA31_DATA_MASK                     0xFFFFFFFF
//#define _ADCDATA31_DATA_LENGTH                   0x00000020

//#define _ADCDATA32_DATA_POSITION                 0x00000000
//#define _ADCDATA32_DATA_MASK                     0xFFFFFFFF
//#define _ADCDATA32_DATA_LENGTH                   0x00000020

//#define _ADCDATA33_DATA_POSITION                 0x00000000
//#define _ADCDATA33_DATA_MASK                     0xFFFFFFFF
//#define _ADCDATA33_DATA_LENGTH                   0x00000020

//#define _ADCDATA34_DATA_POSITION                 0x00000000
//#define _ADCDATA34_DATA_MASK                     0xFFFFFFFF
//#define _ADCDATA34_DATA_LENGTH                   0x00000020

//#define _ADCDATA43_DATA_POSITION                 0x00000000
//#define _ADCDATA43_DATA_MASK                     0xFFFFFFFF
//#define _ADCDATA43_DATA_LENGTH                   0x00000020

//#define _ADCDATA44_DATA_POSITION                 0x00000000
//#define _ADCDATA44_DATA_MASK                     0xFFFFFFFF
//#define _ADCDATA44_DATA_LENGTH                   0x00000020

//#define _CM1CON_CCH_POSITION                     0x00000000
//#define _CM1CON_CCH_MASK                         0x00000003
//#define _CM1CON_CCH_LENGTH                       0x00000002

//#define _CM1CON_CREF_POSITION                    0x00000004
//#define _CM1CON_CREF_MASK                        0x00000010
//#define _CM1CON_CREF_LENGTH                      0x00000001

//#define _CM1CON_EVPOL_POSITION                   0x00000006
//#define _CM1CON_EVPOL_MASK                       0x000000C0
//#define _CM1CON_EVPOL_LENGTH                     0x00000002

//#define _CM1CON_COUT_POSITION                    0x00000008
//#define _CM1CON_COUT_MASK                        0x00000100
//#define _CM1CON_COUT_LENGTH                      0x00000001

//#define _CM1CON_CPOL_POSITION                    0x0000000D
//#define _CM1CON_CPOL_MASK                        0x00002000
//#define _CM1CON_CPOL_LENGTH                      0x00000001

//#define _CM1CON_COE_POSITION                     0x0000000E
//#define _CM1CON_COE_MASK                         0x00004000
//#define _CM1CON_COE_LENGTH                       0x00000001

//#define _CM1CON_ON_POSITION                      0x0000000F
//#define _CM1CON_ON_MASK                          0x00008000
//#define _CM1CON_ON_LENGTH                        0x00000001

//#define _CM1CON_CCH0_POSITION                    0x00000000
//#define _CM1CON_CCH0_MASK                        0x00000001
//#define _CM1CON_CCH0_LENGTH                      0x00000001

//#define _CM1CON_CCH1_POSITION                    0x00000001
//#define _CM1CON_CCH1_MASK                        0x00000002
//#define _CM1CON_CCH1_LENGTH                      0x00000001

//#define _CM1CON_EVPOL0_POSITION                  0x00000006
//#define _CM1CON_EVPOL0_MASK                      0x00000040
//#define _CM1CON_EVPOL0_LENGTH                    0x00000001

//#define _CM1CON_EVPOL1_POSITION                  0x00000007
//#define _CM1CON_EVPOL1_MASK                      0x00000080
//#define _CM1CON_EVPOL1_LENGTH                    0x00000001

