HomuraVehicle/homuraLib_v2/machine/device/p32mz2048efg100_forVC.c
//#define _CM1CON_w_POSITION                       0x00000000
//#define _CM1CON_w_MASK                           0xFFFFFFFF
//#define _CM1CON_w_LENGTH                         0x00000020

//#define _CM2CON_CCH_POSITION                     0x00000000
//#define _CM2CON_CCH_MASK                         0x00000003
//#define _CM2CON_CCH_LENGTH                       0x00000002

//#define _CM2CON_CREF_POSITION                    0x00000004
//#define _CM2CON_CREF_MASK                        0x00000010
//#define _CM2CON_CREF_LENGTH                      0x00000001

//#define _CM2CON_EVPOL_POSITION                   0x00000006
//#define _CM2CON_EVPOL_MASK                       0x000000C0
//#define _CM2CON_EVPOL_LENGTH                     0x00000002

//#define _CM2CON_COUT_POSITION                    0x00000008
//#define _CM2CON_COUT_MASK                        0x00000100
//#define _CM2CON_COUT_LENGTH                      0x00000001

//#define _CM2CON_CPOL_POSITION                    0x0000000D
//#define _CM2CON_CPOL_MASK                        0x00002000
//#define _CM2CON_CPOL_LENGTH                      0x00000001

//#define _CM2CON_COE_POSITION                     0x0000000E
//#define _CM2CON_COE_MASK                         0x00004000
//#define _CM2CON_COE_LENGTH                       0x00000001

//#define _CM2CON_ON_POSITION                      0x0000000F
//#define _CM2CON_ON_MASK                          0x00008000
//#define _CM2CON_ON_LENGTH                        0x00000001

//#define _CM2CON_CCH0_POSITION                    0x00000000
//#define _CM2CON_CCH0_MASK                        0x00000001
//#define _CM2CON_CCH0_LENGTH                      0x00000001

//#define _CM2CON_CCH1_POSITION                    0x00000001
//#define _CM2CON_CCH1_MASK                        0x00000002
//#define _CM2CON_CCH1_LENGTH                      0x00000001

//#define _CM2CON_EVPOL0_POSITION                  0x00000006
//#define _CM2CON_EVPOL0_MASK                      0x00000040
//#define _CM2CON_EVPOL0_LENGTH                    0x00000001

//#define _CM2CON_EVPOL1_POSITION                  0x00000007
//#define _CM2CON_EVPOL1_MASK                      0x00000080
//#define _CM2CON_EVPOL1_LENGTH                    0x00000001

//#define _CM2CON_w_POSITION                       0x00000000
//#define _CM2CON_w_MASK                           0xFFFFFFFF
//#define _CM2CON_w_LENGTH                         0x00000020

//#define _CMSTAT_C1OUT_POSITION                   0x00000000
//#define _CMSTAT_C1OUT_MASK                       0x00000001
//#define _CMSTAT_C1OUT_LENGTH                     0x00000001

//#define _CMSTAT_C2OUT_POSITION                   0x00000001
//#define _CMSTAT_C2OUT_MASK                       0x00000002
//#define _CMSTAT_C2OUT_LENGTH                     0x00000001

//#define _CMSTAT_SIDL_POSITION                    0x0000000D
//#define _CMSTAT_SIDL_MASK                        0x00002000
//#define _CMSTAT_SIDL_LENGTH                      0x00000001

//#define _CMSTAT_w_POSITION                       0x00000000
//#define _CMSTAT_w_MASK                           0xFFFFFFFF
//#define _CMSTAT_w_LENGTH                         0x00000020

//#define _ANSELA_ANSA0_POSITION                   0x00000000
//#define _ANSELA_ANSA0_MASK                       0x00000001
//#define _ANSELA_ANSA0_LENGTH                     0x00000001

//#define _ANSELA_ANSA1_POSITION                   0x00000001
//#define _ANSELA_ANSA1_MASK                       0x00000002
//#define _ANSELA_ANSA1_LENGTH                     0x00000001

//#define _ANSELA_ANSA5_POSITION                   0x00000005
//#define _ANSELA_ANSA5_MASK                       0x00000020
//#define _ANSELA_ANSA5_LENGTH                     0x00000001

//#define _ANSELA_ANSA9_POSITION                   0x00000009
//#define _ANSELA_ANSA9_MASK                       0x00000200
//#define _ANSELA_ANSA9_LENGTH                     0x00000001

//#define _ANSELA_ANSA10_POSITION                  0x0000000A
//#define _ANSELA_ANSA10_MASK                      0x00000400
//#define _ANSELA_ANSA10_LENGTH                    0x00000001

//#define _ANSELA_w_POSITION                       0x00000000
//#define _ANSELA_w_MASK                           0xFFFFFFFF
//#define _ANSELA_w_LENGTH                         0x00000020

//#define _TRISA_TRISA0_POSITION                   0x00000000
//#define _TRISA_TRISA0_MASK                       0x00000001
//#define _TRISA_TRISA0_LENGTH                     0x00000001

//#define _TRISA_TRISA1_POSITION                   0x00000001
//#define _TRISA_TRISA1_MASK                       0x00000002
//#define _TRISA_TRISA1_LENGTH                     0x00000001

//#define _TRISA_TRISA2_POSITION                   0x00000002
//#define _TRISA_TRISA2_MASK                       0x00000004
//#define _TRISA_TRISA2_LENGTH                     0x00000001

//#define _TRISA_TRISA3_POSITION                   0x00000003
//#define _TRISA_TRISA3_MASK                       0x00000008
//#define _TRISA_TRISA3_LENGTH                     0x00000001

//#define _TRISA_TRISA4_POSITION                   0x00000004
//#define _TRISA_TRISA4_MASK                       0x00000010
//#define _TRISA_TRISA4_LENGTH                     0x00000001

//#define _TRISA_TRISA5_POSITION                   0x00000005
//#define _TRISA_TRISA5_MASK                       0x00000020
//#define _TRISA_TRISA5_LENGTH                     0x00000001

//#define _TRISA_TRISA6_POSITION                   0x00000006
//#define _TRISA_TRISA6_MASK                       0x00000040
//#define _TRISA_TRISA6_LENGTH                     0x00000001

//#define _TRISA_TRISA7_POSITION                   0x00000007
//#define _TRISA_TRISA7_MASK                       0x00000080
//#define _TRISA_TRISA7_LENGTH                     0x00000001

//#define _TRISA_TRISA9_POSITION                   0x00000009
//#define _TRISA_TRISA9_MASK                       0x00000200
//#define _TRISA_TRISA9_LENGTH                     0x00000001

//#define _TRISA_TRISA10_POSITION                  0x0000000A
//#define _TRISA_TRISA10_MASK                      0x00000400
//#define _TRISA_TRISA10_LENGTH                    0x00000001

//#define _TRISA_TRISA14_POSITION                  0x0000000E
//#define _TRISA_TRISA14_MASK                      0x00004000
//#define _TRISA_TRISA14_LENGTH                    0x00000001

//#define _TRISA_TRISA15_POSITION                  0x0000000F
//#define _TRISA_TRISA15_MASK                      0x00008000
//#define _TRISA_TRISA15_LENGTH                    0x00000001

