HomuraVehicle/homuraLib_v2/machine/device/p32mz2048efg100_forVC.c
//#define _TRISA_w_POSITION                        0x00000000
//#define _TRISA_w_MASK                            0xFFFFFFFF
//#define _TRISA_w_LENGTH                          0x00000020

//#define _PORTA_RA0_POSITION                      0x00000000
//#define _PORTA_RA0_MASK                          0x00000001
//#define _PORTA_RA0_LENGTH                        0x00000001

//#define _PORTA_RA1_POSITION                      0x00000001
//#define _PORTA_RA1_MASK                          0x00000002
//#define _PORTA_RA1_LENGTH                        0x00000001

//#define _PORTA_RA2_POSITION                      0x00000002
//#define _PORTA_RA2_MASK                          0x00000004
//#define _PORTA_RA2_LENGTH                        0x00000001

//#define _PORTA_RA3_POSITION                      0x00000003
//#define _PORTA_RA3_MASK                          0x00000008
//#define _PORTA_RA3_LENGTH                        0x00000001

//#define _PORTA_RA4_POSITION                      0x00000004
//#define _PORTA_RA4_MASK                          0x00000010
//#define _PORTA_RA4_LENGTH                        0x00000001

//#define _PORTA_RA5_POSITION                      0x00000005
//#define _PORTA_RA5_MASK                          0x00000020
//#define _PORTA_RA5_LENGTH                        0x00000001

//#define _PORTA_RA6_POSITION                      0x00000006
//#define _PORTA_RA6_MASK                          0x00000040
//#define _PORTA_RA6_LENGTH                        0x00000001

//#define _PORTA_RA7_POSITION                      0x00000007
//#define _PORTA_RA7_MASK                          0x00000080
//#define _PORTA_RA7_LENGTH                        0x00000001

//#define _PORTA_RA9_POSITION                      0x00000009
//#define _PORTA_RA9_MASK                          0x00000200
//#define _PORTA_RA9_LENGTH                        0x00000001

//#define _PORTA_RA10_POSITION                     0x0000000A
//#define _PORTA_RA10_MASK                         0x00000400
//#define _PORTA_RA10_LENGTH                       0x00000001

//#define _PORTA_RA14_POSITION                     0x0000000E
//#define _PORTA_RA14_MASK                         0x00004000
//#define _PORTA_RA14_LENGTH                       0x00000001

//#define _PORTA_RA15_POSITION                     0x0000000F
//#define _PORTA_RA15_MASK                         0x00008000
//#define _PORTA_RA15_LENGTH                       0x00000001

//#define _PORTA_w_POSITION                        0x00000000
//#define _PORTA_w_MASK                            0xFFFFFFFF
//#define _PORTA_w_LENGTH                          0x00000020

//#define _LATA_LATA0_POSITION                     0x00000000
//#define _LATA_LATA0_MASK                         0x00000001
//#define _LATA_LATA0_LENGTH                       0x00000001

//#define _LATA_LATA1_POSITION                     0x00000001
//#define _LATA_LATA1_MASK                         0x00000002
//#define _LATA_LATA1_LENGTH                       0x00000001

//#define _LATA_LATA2_POSITION                     0x00000002
//#define _LATA_LATA2_MASK                         0x00000004
//#define _LATA_LATA2_LENGTH                       0x00000001

//#define _LATA_LATA3_POSITION                     0x00000003
//#define _LATA_LATA3_MASK                         0x00000008
//#define _LATA_LATA3_LENGTH                       0x00000001

//#define _LATA_LATA4_POSITION                     0x00000004
//#define _LATA_LATA4_MASK                         0x00000010
//#define _LATA_LATA4_LENGTH                       0x00000001

//#define _LATA_LATA5_POSITION                     0x00000005
//#define _LATA_LATA5_MASK                         0x00000020
//#define _LATA_LATA5_LENGTH                       0x00000001

//#define _LATA_LATA6_POSITION                     0x00000006
//#define _LATA_LATA6_MASK                         0x00000040
//#define _LATA_LATA6_LENGTH                       0x00000001

//#define _LATA_LATA7_POSITION                     0x00000007
//#define _LATA_LATA7_MASK                         0x00000080
//#define _LATA_LATA7_LENGTH                       0x00000001

//#define _LATA_LATA9_POSITION                     0x00000009
//#define _LATA_LATA9_MASK                         0x00000200
//#define _LATA_LATA9_LENGTH                       0x00000001

//#define _LATA_LATA10_POSITION                    0x0000000A
//#define _LATA_LATA10_MASK                        0x00000400
//#define _LATA_LATA10_LENGTH                      0x00000001

//#define _LATA_LATA14_POSITION                    0x0000000E
//#define _LATA_LATA14_MASK                        0x00004000
//#define _LATA_LATA14_LENGTH                      0x00000001

//#define _LATA_LATA15_POSITION                    0x0000000F
//#define _LATA_LATA15_MASK                        0x00008000
//#define _LATA_LATA15_LENGTH                      0x00000001

//#define _LATA_w_POSITION                         0x00000000
//#define _LATA_w_MASK                             0xFFFFFFFF
//#define _LATA_w_LENGTH                           0x00000020

//#define _ODCA_ODCA0_POSITION                     0x00000000
//#define _ODCA_ODCA0_MASK                         0x00000001
//#define _ODCA_ODCA0_LENGTH                       0x00000001

//#define _ODCA_ODCA1_POSITION                     0x00000001
//#define _ODCA_ODCA1_MASK                         0x00000002
//#define _ODCA_ODCA1_LENGTH                       0x00000001

//#define _ODCA_ODCA2_POSITION                     0x00000002
//#define _ODCA_ODCA2_MASK                         0x00000004
//#define _ODCA_ODCA2_LENGTH                       0x00000001

//#define _ODCA_ODCA3_POSITION                     0x00000003
//#define _ODCA_ODCA3_MASK                         0x00000008
//#define _ODCA_ODCA3_LENGTH                       0x00000001

//#define _ODCA_ODCA4_POSITION                     0x00000004
//#define _ODCA_ODCA4_MASK                         0x00000010
//#define _ODCA_ODCA4_LENGTH                       0x00000001

//#define _ODCA_ODCA5_POSITION                     0x00000005
//#define _ODCA_ODCA5_MASK                         0x00000020
//#define _ODCA_ODCA5_LENGTH                       0x00000001

//#define _ODCA_ODCA6_POSITION                     0x00000006
//#define _ODCA_ODCA6_MASK                         0x00000040
//#define _ODCA_ODCA6_LENGTH                       0x00000001

//#define _ODCA_ODCA7_POSITION                     0x00000007
//#define _ODCA_ODCA7_MASK                         0x00000080
//#define _ODCA_ODCA7_LENGTH                       0x00000001

//#define _ODCA_ODCA9_POSITION                     0x00000009
//#define _ODCA_ODCA9_MASK                         0x00000200
//#define _ODCA_ODCA9_LENGTH                       0x00000001

