HomuraVehicle/homuraLib_v2/machine/device/p32mz2048efg100_forVC.c
//#define _ODCA_ODCA10_POSITION                    0x0000000A
//#define _ODCA_ODCA10_MASK                        0x00000400
//#define _ODCA_ODCA10_LENGTH                      0x00000001

//#define _ODCA_ODCA14_POSITION                    0x0000000E
//#define _ODCA_ODCA14_MASK                        0x00004000
//#define _ODCA_ODCA14_LENGTH                      0x00000001

//#define _ODCA_ODCA15_POSITION                    0x0000000F
//#define _ODCA_ODCA15_MASK                        0x00008000
//#define _ODCA_ODCA15_LENGTH                      0x00000001

//#define _ODCA_w_POSITION                         0x00000000
//#define _ODCA_w_MASK                             0xFFFFFFFF
//#define _ODCA_w_LENGTH                           0x00000020

//#define _CNPUA_CNPUA0_POSITION                   0x00000000
//#define _CNPUA_CNPUA0_MASK                       0x00000001
//#define _CNPUA_CNPUA0_LENGTH                     0x00000001

//#define _CNPUA_CNPUA1_POSITION                   0x00000001
//#define _CNPUA_CNPUA1_MASK                       0x00000002
//#define _CNPUA_CNPUA1_LENGTH                     0x00000001

//#define _CNPUA_CNPUA2_POSITION                   0x00000002
//#define _CNPUA_CNPUA2_MASK                       0x00000004
//#define _CNPUA_CNPUA2_LENGTH                     0x00000001

//#define _CNPUA_CNPUA3_POSITION                   0x00000003
//#define _CNPUA_CNPUA3_MASK                       0x00000008
//#define _CNPUA_CNPUA3_LENGTH                     0x00000001

//#define _CNPUA_CNPUA4_POSITION                   0x00000004
//#define _CNPUA_CNPUA4_MASK                       0x00000010
//#define _CNPUA_CNPUA4_LENGTH                     0x00000001

//#define _CNPUA_CNPUA5_POSITION                   0x00000005
//#define _CNPUA_CNPUA5_MASK                       0x00000020
//#define _CNPUA_CNPUA5_LENGTH                     0x00000001

//#define _CNPUA_CNPUA6_POSITION                   0x00000006
//#define _CNPUA_CNPUA6_MASK                       0x00000040
//#define _CNPUA_CNPUA6_LENGTH                     0x00000001

//#define _CNPUA_CNPUA7_POSITION                   0x00000007
//#define _CNPUA_CNPUA7_MASK                       0x00000080
//#define _CNPUA_CNPUA7_LENGTH                     0x00000001

//#define _CNPUA_CNPUA9_POSITION                   0x00000009
//#define _CNPUA_CNPUA9_MASK                       0x00000200
//#define _CNPUA_CNPUA9_LENGTH                     0x00000001

//#define _CNPUA_CNPUA10_POSITION                  0x0000000A
//#define _CNPUA_CNPUA10_MASK                      0x00000400
//#define _CNPUA_CNPUA10_LENGTH                    0x00000001

//#define _CNPUA_CNPUA14_POSITION                  0x0000000E
//#define _CNPUA_CNPUA14_MASK                      0x00004000
//#define _CNPUA_CNPUA14_LENGTH                    0x00000001

//#define _CNPUA_CNPUA15_POSITION                  0x0000000F
//#define _CNPUA_CNPUA15_MASK                      0x00008000
//#define _CNPUA_CNPUA15_LENGTH                    0x00000001

//#define _CNPUA_w_POSITION                        0x00000000
//#define _CNPUA_w_MASK                            0xFFFFFFFF
//#define _CNPUA_w_LENGTH                          0x00000020

//#define _CNPDA_CNPDA0_POSITION                   0x00000000
//#define _CNPDA_CNPDA0_MASK                       0x00000001
//#define _CNPDA_CNPDA0_LENGTH                     0x00000001

//#define _CNPDA_CNPDA1_POSITION                   0x00000001
//#define _CNPDA_CNPDA1_MASK                       0x00000002
//#define _CNPDA_CNPDA1_LENGTH                     0x00000001

//#define _CNPDA_CNPDA2_POSITION                   0x00000002
//#define _CNPDA_CNPDA2_MASK                       0x00000004
//#define _CNPDA_CNPDA2_LENGTH                     0x00000001

//#define _CNPDA_CNPDA3_POSITION                   0x00000003
//#define _CNPDA_CNPDA3_MASK                       0x00000008
//#define _CNPDA_CNPDA3_LENGTH                     0x00000001

//#define _CNPDA_CNPDA4_POSITION                   0x00000004
//#define _CNPDA_CNPDA4_MASK                       0x00000010
//#define _CNPDA_CNPDA4_LENGTH                     0x00000001

//#define _CNPDA_CNPDA5_POSITION                   0x00000005
//#define _CNPDA_CNPDA5_MASK                       0x00000020
//#define _CNPDA_CNPDA5_LENGTH                     0x00000001

//#define _CNPDA_CNPDA6_POSITION                   0x00000006
//#define _CNPDA_CNPDA6_MASK                       0x00000040
//#define _CNPDA_CNPDA6_LENGTH                     0x00000001

//#define _CNPDA_CNPDA7_POSITION                   0x00000007
//#define _CNPDA_CNPDA7_MASK                       0x00000080
//#define _CNPDA_CNPDA7_LENGTH                     0x00000001

//#define _CNPDA_CNPDA9_POSITION                   0x00000009
//#define _CNPDA_CNPDA9_MASK                       0x00000200
//#define _CNPDA_CNPDA9_LENGTH                     0x00000001

//#define _CNPDA_CNPDA10_POSITION                  0x0000000A
//#define _CNPDA_CNPDA10_MASK                      0x00000400
//#define _CNPDA_CNPDA10_LENGTH                    0x00000001

//#define _CNPDA_CNPDA14_POSITION                  0x0000000E
//#define _CNPDA_CNPDA14_MASK                      0x00004000
//#define _CNPDA_CNPDA14_LENGTH                    0x00000001

//#define _CNPDA_CNPDA15_POSITION                  0x0000000F
//#define _CNPDA_CNPDA15_MASK                      0x00008000
//#define _CNPDA_CNPDA15_LENGTH                    0x00000001

//#define _CNPDA_w_POSITION                        0x00000000
//#define _CNPDA_w_MASK                            0xFFFFFFFF
//#define _CNPDA_w_LENGTH                          0x00000020

//#define _CNCONA_EDGEDETECT_POSITION              0x0000000B
//#define _CNCONA_EDGEDETECT_MASK                  0x00000800
//#define _CNCONA_EDGEDETECT_LENGTH                0x00000001

//#define _CNCONA_SIDL_POSITION                    0x0000000D
//#define _CNCONA_SIDL_MASK                        0x00002000
//#define _CNCONA_SIDL_LENGTH                      0x00000001

//#define _CNCONA_ON_POSITION                      0x0000000F
//#define _CNCONA_ON_MASK                          0x00008000
//#define _CNCONA_ON_LENGTH                        0x00000001

//#define _CNCONA_w_POSITION                       0x00000000
//#define _CNCONA_w_MASK                           0xFFFFFFFF
//#define _CNCONA_w_LENGTH                         0x00000020

//#define _CNENA_CNIEA0_POSITION                   0x00000000
//#define _CNENA_CNIEA0_MASK                       0x00000001
//#define _CNENA_CNIEA0_LENGTH                     0x00000001

