HomuraVehicle/homuraLib_v2/machine/device/p32mz2048efg100_forVC.c
//#define _CNENA_CNIEA1_POSITION                   0x00000001
//#define _CNENA_CNIEA1_MASK                       0x00000002
//#define _CNENA_CNIEA1_LENGTH                     0x00000001

//#define _CNENA_CNIEA2_POSITION                   0x00000002
//#define _CNENA_CNIEA2_MASK                       0x00000004
//#define _CNENA_CNIEA2_LENGTH                     0x00000001

//#define _CNENA_CNIEA3_POSITION                   0x00000003
//#define _CNENA_CNIEA3_MASK                       0x00000008
//#define _CNENA_CNIEA3_LENGTH                     0x00000001

//#define _CNENA_CNIEA4_POSITION                   0x00000004
//#define _CNENA_CNIEA4_MASK                       0x00000010
//#define _CNENA_CNIEA4_LENGTH                     0x00000001

//#define _CNENA_CNIEA5_POSITION                   0x00000005
//#define _CNENA_CNIEA5_MASK                       0x00000020
//#define _CNENA_CNIEA5_LENGTH                     0x00000001

//#define _CNENA_CNIEA6_POSITION                   0x00000006
//#define _CNENA_CNIEA6_MASK                       0x00000040
//#define _CNENA_CNIEA6_LENGTH                     0x00000001

//#define _CNENA_CNIEA7_POSITION                   0x00000007
//#define _CNENA_CNIEA7_MASK                       0x00000080
//#define _CNENA_CNIEA7_LENGTH                     0x00000001

//#define _CNENA_CNIEA9_POSITION                   0x00000009
//#define _CNENA_CNIEA9_MASK                       0x00000200
//#define _CNENA_CNIEA9_LENGTH                     0x00000001

//#define _CNENA_CNIEA10_POSITION                  0x0000000A
//#define _CNENA_CNIEA10_MASK                      0x00000400
//#define _CNENA_CNIEA10_LENGTH                    0x00000001

//#define _CNENA_CNIEA14_POSITION                  0x0000000E
//#define _CNENA_CNIEA14_MASK                      0x00004000
//#define _CNENA_CNIEA14_LENGTH                    0x00000001

//#define _CNENA_CNIEA15_POSITION                  0x0000000F
//#define _CNENA_CNIEA15_MASK                      0x00008000
//#define _CNENA_CNIEA15_LENGTH                    0x00000001

//#define _CNENA_w_POSITION                        0x00000000
//#define _CNENA_w_MASK                            0xFFFFFFFF
//#define _CNENA_w_LENGTH                          0x00000020

//#define _CNSTATA_CNSTATA0_POSITION               0x00000000
//#define _CNSTATA_CNSTATA0_MASK                   0x00000001
//#define _CNSTATA_CNSTATA0_LENGTH                 0x00000001

//#define _CNSTATA_CNSTATA1_POSITION               0x00000001
//#define _CNSTATA_CNSTATA1_MASK                   0x00000002
//#define _CNSTATA_CNSTATA1_LENGTH                 0x00000001

//#define _CNSTATA_CNSTATA2_POSITION               0x00000002
//#define _CNSTATA_CNSTATA2_MASK                   0x00000004
//#define _CNSTATA_CNSTATA2_LENGTH                 0x00000001

//#define _CNSTATA_CNSTATA3_POSITION               0x00000003
//#define _CNSTATA_CNSTATA3_MASK                   0x00000008
//#define _CNSTATA_CNSTATA3_LENGTH                 0x00000001

//#define _CNSTATA_CNSTATA4_POSITION               0x00000004
//#define _CNSTATA_CNSTATA4_MASK                   0x00000010
//#define _CNSTATA_CNSTATA4_LENGTH                 0x00000001

//#define _CNSTATA_CNSTATA5_POSITION               0x00000005
//#define _CNSTATA_CNSTATA5_MASK                   0x00000020
//#define _CNSTATA_CNSTATA5_LENGTH                 0x00000001

//#define _CNSTATA_CNSTATA6_POSITION               0x00000006
//#define _CNSTATA_CNSTATA6_MASK                   0x00000040
//#define _CNSTATA_CNSTATA6_LENGTH                 0x00000001

//#define _CNSTATA_CNSTATA7_POSITION               0x00000007
//#define _CNSTATA_CNSTATA7_MASK                   0x00000080
//#define _CNSTATA_CNSTATA7_LENGTH                 0x00000001

//#define _CNSTATA_CNSTATA9_POSITION               0x00000009
//#define _CNSTATA_CNSTATA9_MASK                   0x00000200
//#define _CNSTATA_CNSTATA9_LENGTH                 0x00000001

//#define _CNSTATA_CNSTATA10_POSITION              0x0000000A
//#define _CNSTATA_CNSTATA10_MASK                  0x00000400
//#define _CNSTATA_CNSTATA10_LENGTH                0x00000001

//#define _CNSTATA_CNSTATA14_POSITION              0x0000000E
//#define _CNSTATA_CNSTATA14_MASK                  0x00004000
//#define _CNSTATA_CNSTATA14_LENGTH                0x00000001

//#define _CNSTATA_CNSTATA15_POSITION              0x0000000F
//#define _CNSTATA_CNSTATA15_MASK                  0x00008000
//#define _CNSTATA_CNSTATA15_LENGTH                0x00000001

//#define _CNSTATA_w_POSITION                      0x00000000
//#define _CNSTATA_w_MASK                          0xFFFFFFFF
//#define _CNSTATA_w_LENGTH                        0x00000020

//#define _CNNEA_CNNEA0_POSITION                   0x00000000
//#define _CNNEA_CNNEA0_MASK                       0x00000001
//#define _CNNEA_CNNEA0_LENGTH                     0x00000001

//#define _CNNEA_CNNEA1_POSITION                   0x00000001
//#define _CNNEA_CNNEA1_MASK                       0x00000002
//#define _CNNEA_CNNEA1_LENGTH                     0x00000001

//#define _CNNEA_CNNEA2_POSITION                   0x00000002
//#define _CNNEA_CNNEA2_MASK                       0x00000004
//#define _CNNEA_CNNEA2_LENGTH                     0x00000001

//#define _CNNEA_CNNEA3_POSITION                   0x00000003
//#define _CNNEA_CNNEA3_MASK                       0x00000008
//#define _CNNEA_CNNEA3_LENGTH                     0x00000001

//#define _CNNEA_CNNEA4_POSITION                   0x00000004
//#define _CNNEA_CNNEA4_MASK                       0x00000010
//#define _CNNEA_CNNEA4_LENGTH                     0x00000001

//#define _CNNEA_CNNEA5_POSITION                   0x00000005
//#define _CNNEA_CNNEA5_MASK                       0x00000020
//#define _CNNEA_CNNEA5_LENGTH                     0x00000001

//#define _CNNEA_CNNEA6_POSITION                   0x00000006
//#define _CNNEA_CNNEA6_MASK                       0x00000040
//#define _CNNEA_CNNEA6_LENGTH                     0x00000001

//#define _CNNEA_CNNEA7_POSITION                   0x00000007
//#define _CNNEA_CNNEA7_MASK                       0x00000080
//#define _CNNEA_CNNEA7_LENGTH                     0x00000001

//#define _CNNEA_CNNEA9_POSITION                   0x00000009
//#define _CNNEA_CNNEA9_MASK                       0x00000200
//#define _CNNEA_CNNEA9_LENGTH                     0x00000001

//#define _CNNEA_CNNEA10_POSITION                  0x0000000A
//#define _CNNEA_CNNEA10_MASK                      0x00000400
//#define _CNNEA_CNNEA10_LENGTH                    0x00000001

