HomuraVehicle/homuraLib_v2/machine/device/p32mz2048efg100_forVC.c
//#define _CNNEA_CNNEA14_POSITION                  0x0000000E
//#define _CNNEA_CNNEA14_MASK                      0x00004000
//#define _CNNEA_CNNEA14_LENGTH                    0x00000001

//#define _CNNEA_CNNEA15_POSITION                  0x0000000F
//#define _CNNEA_CNNEA15_MASK                      0x00008000
//#define _CNNEA_CNNEA15_LENGTH                    0x00000001

//#define _CNFA_CNFA0_POSITION                     0x00000000
//#define _CNFA_CNFA0_MASK                         0x00000001
//#define _CNFA_CNFA0_LENGTH                       0x00000001

//#define _CNFA_CNFA1_POSITION                     0x00000001
//#define _CNFA_CNFA1_MASK                         0x00000002
//#define _CNFA_CNFA1_LENGTH                       0x00000001

//#define _CNFA_CNFA2_POSITION                     0x00000002
//#define _CNFA_CNFA2_MASK                         0x00000004
//#define _CNFA_CNFA2_LENGTH                       0x00000001

//#define _CNFA_CNFA3_POSITION                     0x00000003
//#define _CNFA_CNFA3_MASK                         0x00000008
//#define _CNFA_CNFA3_LENGTH                       0x00000001

//#define _CNFA_CNFA4_POSITION                     0x00000004
//#define _CNFA_CNFA4_MASK                         0x00000010
//#define _CNFA_CNFA4_LENGTH                       0x00000001

//#define _CNFA_CNFA5_POSITION                     0x00000005
//#define _CNFA_CNFA5_MASK                         0x00000020
//#define _CNFA_CNFA5_LENGTH                       0x00000001

//#define _CNFA_CNFA6_POSITION                     0x00000006
//#define _CNFA_CNFA6_MASK                         0x00000040
//#define _CNFA_CNFA6_LENGTH                       0x00000001

//#define _CNFA_CNFA7_POSITION                     0x00000007
//#define _CNFA_CNFA7_MASK                         0x00000080
//#define _CNFA_CNFA7_LENGTH                       0x00000001

//#define _CNFA_CNFA9_POSITION                     0x00000009
//#define _CNFA_CNFA9_MASK                         0x00000200
//#define _CNFA_CNFA9_LENGTH                       0x00000001

//#define _CNFA_CNFA10_POSITION                    0x0000000A
//#define _CNFA_CNFA10_MASK                        0x00000400
//#define _CNFA_CNFA10_LENGTH                      0x00000001

//#define _CNFA_CNFA14_POSITION                    0x0000000E
//#define _CNFA_CNFA14_MASK                        0x00004000
//#define _CNFA_CNFA14_LENGTH                      0x00000001

//#define _CNFA_CNFA15_POSITION                    0x0000000F
//#define _CNFA_CNFA15_MASK                        0x00008000
//#define _CNFA_CNFA15_LENGTH                      0x00000001

//#define _SRCON0A_SR0A6_POSITION                  0x00000006
//#define _SRCON0A_SR0A6_MASK                      0x00000040
//#define _SRCON0A_SR0A6_LENGTH                    0x00000001

//#define _SRCON0A_SR0A7_POSITION                  0x00000007
//#define _SRCON0A_SR0A7_MASK                      0x00000080
//#define _SRCON0A_SR0A7_LENGTH                    0x00000001

//#define _SRCON1A_SR1A6_POSITION                  0x00000006
//#define _SRCON1A_SR1A6_MASK                      0x00000040
//#define _SRCON1A_SR1A6_LENGTH                    0x00000001

//#define _SRCON1A_SR1A7_POSITION                  0x00000007
//#define _SRCON1A_SR1A7_MASK                      0x00000080
//#define _SRCON1A_SR1A7_LENGTH                    0x00000001

//#define _ANSELB_ANSB0_POSITION                   0x00000000
//#define _ANSELB_ANSB0_MASK                       0x00000001
//#define _ANSELB_ANSB0_LENGTH                     0x00000001

//#define _ANSELB_ANSB1_POSITION                   0x00000001
//#define _ANSELB_ANSB1_MASK                       0x00000002
//#define _ANSELB_ANSB1_LENGTH                     0x00000001

//#define _ANSELB_ANSB2_POSITION                   0x00000002
//#define _ANSELB_ANSB2_MASK                       0x00000004
//#define _ANSELB_ANSB2_LENGTH                     0x00000001

//#define _ANSELB_ANSB3_POSITION                   0x00000003
//#define _ANSELB_ANSB3_MASK                       0x00000008
//#define _ANSELB_ANSB3_LENGTH                     0x00000001

//#define _ANSELB_ANSB4_POSITION                   0x00000004
//#define _ANSELB_ANSB4_MASK                       0x00000010
//#define _ANSELB_ANSB4_LENGTH                     0x00000001

//#define _ANSELB_ANSB5_POSITION                   0x00000005
//#define _ANSELB_ANSB5_MASK                       0x00000020
//#define _ANSELB_ANSB5_LENGTH                     0x00000001

//#define _ANSELB_ANSB6_POSITION                   0x00000006
//#define _ANSELB_ANSB6_MASK                       0x00000040
//#define _ANSELB_ANSB6_LENGTH                     0x00000001

//#define _ANSELB_ANSB7_POSITION                   0x00000007
//#define _ANSELB_ANSB7_MASK                       0x00000080
//#define _ANSELB_ANSB7_LENGTH                     0x00000001

//#define _ANSELB_ANSB8_POSITION                   0x00000008
//#define _ANSELB_ANSB8_MASK                       0x00000100
//#define _ANSELB_ANSB8_LENGTH                     0x00000001

//#define _ANSELB_ANSB9_POSITION                   0x00000009
//#define _ANSELB_ANSB9_MASK                       0x00000200
//#define _ANSELB_ANSB9_LENGTH                     0x00000001

//#define _ANSELB_ANSB10_POSITION                  0x0000000A
//#define _ANSELB_ANSB10_MASK                      0x00000400
//#define _ANSELB_ANSB10_LENGTH                    0x00000001

//#define _ANSELB_ANSB11_POSITION                  0x0000000B
//#define _ANSELB_ANSB11_MASK                      0x00000800
//#define _ANSELB_ANSB11_LENGTH                    0x00000001

//#define _ANSELB_ANSB12_POSITION                  0x0000000C
//#define _ANSELB_ANSB12_MASK                      0x00001000
//#define _ANSELB_ANSB12_LENGTH                    0x00000001

//#define _ANSELB_ANSB13_POSITION                  0x0000000D
//#define _ANSELB_ANSB13_MASK                      0x00002000
//#define _ANSELB_ANSB13_LENGTH                    0x00000001

//#define _ANSELB_ANSB14_POSITION                  0x0000000E
//#define _ANSELB_ANSB14_MASK                      0x00004000
//#define _ANSELB_ANSB14_LENGTH                    0x00000001

//#define _ANSELB_ANSB15_POSITION                  0x0000000F
//#define _ANSELB_ANSB15_MASK                      0x00008000
//#define _ANSELB_ANSB15_LENGTH                    0x00000001

