HomuraVehicle/homuraLib_v2/machine/device/p32mz2048efg100_forVC.c
//#define _ODCB_w_POSITION                         0x00000000
//#define _ODCB_w_MASK                             0xFFFFFFFF
//#define _ODCB_w_LENGTH                           0x00000020

//#define _CNPUB_CNPUB0_POSITION                   0x00000000
//#define _CNPUB_CNPUB0_MASK                       0x00000001
//#define _CNPUB_CNPUB0_LENGTH                     0x00000001

//#define _CNPUB_CNPUB1_POSITION                   0x00000001
//#define _CNPUB_CNPUB1_MASK                       0x00000002
//#define _CNPUB_CNPUB1_LENGTH                     0x00000001

//#define _CNPUB_CNPUB2_POSITION                   0x00000002
//#define _CNPUB_CNPUB2_MASK                       0x00000004
//#define _CNPUB_CNPUB2_LENGTH                     0x00000001

//#define _CNPUB_CNPUB3_POSITION                   0x00000003
//#define _CNPUB_CNPUB3_MASK                       0x00000008
//#define _CNPUB_CNPUB3_LENGTH                     0x00000001

//#define _CNPUB_CNPUB4_POSITION                   0x00000004
//#define _CNPUB_CNPUB4_MASK                       0x00000010
//#define _CNPUB_CNPUB4_LENGTH                     0x00000001

//#define _CNPUB_CNPUB5_POSITION                   0x00000005
//#define _CNPUB_CNPUB5_MASK                       0x00000020
//#define _CNPUB_CNPUB5_LENGTH                     0x00000001

//#define _CNPUB_CNPUB6_POSITION                   0x00000006
//#define _CNPUB_CNPUB6_MASK                       0x00000040
//#define _CNPUB_CNPUB6_LENGTH                     0x00000001

//#define _CNPUB_CNPUB7_POSITION                   0x00000007
//#define _CNPUB_CNPUB7_MASK                       0x00000080
//#define _CNPUB_CNPUB7_LENGTH                     0x00000001

//#define _CNPUB_CNPUB8_POSITION                   0x00000008
//#define _CNPUB_CNPUB8_MASK                       0x00000100
//#define _CNPUB_CNPUB8_LENGTH                     0x00000001

//#define _CNPUB_CNPUB9_POSITION                   0x00000009
//#define _CNPUB_CNPUB9_MASK                       0x00000200
//#define _CNPUB_CNPUB9_LENGTH                     0x00000001

//#define _CNPUB_CNPUB10_POSITION                  0x0000000A
//#define _CNPUB_CNPUB10_MASK                      0x00000400
//#define _CNPUB_CNPUB10_LENGTH                    0x00000001

//#define _CNPUB_CNPUB11_POSITION                  0x0000000B
//#define _CNPUB_CNPUB11_MASK                      0x00000800
//#define _CNPUB_CNPUB11_LENGTH                    0x00000001

//#define _CNPUB_CNPUB12_POSITION                  0x0000000C
//#define _CNPUB_CNPUB12_MASK                      0x00001000
//#define _CNPUB_CNPUB12_LENGTH                    0x00000001

//#define _CNPUB_CNPUB13_POSITION                  0x0000000D
//#define _CNPUB_CNPUB13_MASK                      0x00002000
//#define _CNPUB_CNPUB13_LENGTH                    0x00000001

//#define _CNPUB_CNPUB14_POSITION                  0x0000000E
//#define _CNPUB_CNPUB14_MASK                      0x00004000
//#define _CNPUB_CNPUB14_LENGTH                    0x00000001

//#define _CNPUB_CNPUB15_POSITION                  0x0000000F
//#define _CNPUB_CNPUB15_MASK                      0x00008000
//#define _CNPUB_CNPUB15_LENGTH                    0x00000001

//#define _CNPUB_w_POSITION                        0x00000000
//#define _CNPUB_w_MASK                            0xFFFFFFFF
//#define _CNPUB_w_LENGTH                          0x00000020

//#define _CNPDB_CNPDB0_POSITION                   0x00000000
//#define _CNPDB_CNPDB0_MASK                       0x00000001
//#define _CNPDB_CNPDB0_LENGTH                     0x00000001

//#define _CNPDB_CNPDB1_POSITION                   0x00000001
//#define _CNPDB_CNPDB1_MASK                       0x00000002
//#define _CNPDB_CNPDB1_LENGTH                     0x00000001

//#define _CNPDB_CNPDB2_POSITION                   0x00000002
//#define _CNPDB_CNPDB2_MASK                       0x00000004
//#define _CNPDB_CNPDB2_LENGTH                     0x00000001

//#define _CNPDB_CNPDB3_POSITION                   0x00000003
//#define _CNPDB_CNPDB3_MASK                       0x00000008
//#define _CNPDB_CNPDB3_LENGTH                     0x00000001

//#define _CNPDB_CNPDB4_POSITION                   0x00000004
//#define _CNPDB_CNPDB4_MASK                       0x00000010
//#define _CNPDB_CNPDB4_LENGTH                     0x00000001

//#define _CNPDB_CNPDB5_POSITION                   0x00000005
//#define _CNPDB_CNPDB5_MASK                       0x00000020
//#define _CNPDB_CNPDB5_LENGTH                     0x00000001

//#define _CNPDB_CNPDB6_POSITION                   0x00000006
//#define _CNPDB_CNPDB6_MASK                       0x00000040
//#define _CNPDB_CNPDB6_LENGTH                     0x00000001

//#define _CNPDB_CNPDB7_POSITION                   0x00000007
//#define _CNPDB_CNPDB7_MASK                       0x00000080
//#define _CNPDB_CNPDB7_LENGTH                     0x00000001

//#define _CNPDB_CNPDB8_POSITION                   0x00000008
//#define _CNPDB_CNPDB8_MASK                       0x00000100
//#define _CNPDB_CNPDB8_LENGTH                     0x00000001

//#define _CNPDB_CNPDB9_POSITION                   0x00000009
//#define _CNPDB_CNPDB9_MASK                       0x00000200
//#define _CNPDB_CNPDB9_LENGTH                     0x00000001

//#define _CNPDB_CNPDB10_POSITION                  0x0000000A
//#define _CNPDB_CNPDB10_MASK                      0x00000400
//#define _CNPDB_CNPDB10_LENGTH                    0x00000001

//#define _CNPDB_CNPDB11_POSITION                  0x0000000B
//#define _CNPDB_CNPDB11_MASK                      0x00000800
//#define _CNPDB_CNPDB11_LENGTH                    0x00000001

//#define _CNPDB_CNPDB12_POSITION                  0x0000000C
//#define _CNPDB_CNPDB12_MASK                      0x00001000
//#define _CNPDB_CNPDB12_LENGTH                    0x00000001

//#define _CNPDB_CNPDB13_POSITION                  0x0000000D
//#define _CNPDB_CNPDB13_MASK                      0x00002000
//#define _CNPDB_CNPDB13_LENGTH                    0x00000001

//#define _CNPDB_CNPDB14_POSITION                  0x0000000E
//#define _CNPDB_CNPDB14_MASK                      0x00004000
//#define _CNPDB_CNPDB14_LENGTH                    0x00000001

//#define _CNPDB_CNPDB15_POSITION                  0x0000000F
//#define _CNPDB_CNPDB15_MASK                      0x00008000
//#define _CNPDB_CNPDB15_LENGTH                    0x00000001

//#define _CNPDB_w_POSITION                        0x00000000
//#define _CNPDB_w_MASK                            0xFFFFFFFF
//#define _CNPDB_w_LENGTH                          0x00000020

//#define _CNCONB_EDGEDETECT_POSITION              0x0000000B
//#define _CNCONB_EDGEDETECT_MASK                  0x00000800
//#define _CNCONB_EDGEDETECT_LENGTH                0x00000001

//#define _CNCONB_SIDL_POSITION                    0x0000000D
//#define _CNCONB_SIDL_MASK                        0x00002000
//#define _CNCONB_SIDL_LENGTH                      0x00000001

