HomuraVehicle/homuraLib_v2/machine/device/p32mz2048efg100_forVC.c
//#define _CNCONB_ON_POSITION                      0x0000000F
//#define _CNCONB_ON_MASK                          0x00008000
//#define _CNCONB_ON_LENGTH                        0x00000001

//#define _CNCONB_w_POSITION                       0x00000000
//#define _CNCONB_w_MASK                           0xFFFFFFFF
//#define _CNCONB_w_LENGTH                         0x00000020

//#define _CNENB_CNIEB0_POSITION                   0x00000000
//#define _CNENB_CNIEB0_MASK                       0x00000001
//#define _CNENB_CNIEB0_LENGTH                     0x00000001

//#define _CNENB_CNIEB1_POSITION                   0x00000001
//#define _CNENB_CNIEB1_MASK                       0x00000002
//#define _CNENB_CNIEB1_LENGTH                     0x00000001

//#define _CNENB_CNIEB2_POSITION                   0x00000002
//#define _CNENB_CNIEB2_MASK                       0x00000004
//#define _CNENB_CNIEB2_LENGTH                     0x00000001

//#define _CNENB_CNIEB3_POSITION                   0x00000003
//#define _CNENB_CNIEB3_MASK                       0x00000008
//#define _CNENB_CNIEB3_LENGTH                     0x00000001

//#define _CNENB_CNIEB4_POSITION                   0x00000004
//#define _CNENB_CNIEB4_MASK                       0x00000010
//#define _CNENB_CNIEB4_LENGTH                     0x00000001

//#define _CNENB_CNIEB5_POSITION                   0x00000005
//#define _CNENB_CNIEB5_MASK                       0x00000020
//#define _CNENB_CNIEB5_LENGTH                     0x00000001

//#define _CNENB_CNIEB6_POSITION                   0x00000006
//#define _CNENB_CNIEB6_MASK                       0x00000040
//#define _CNENB_CNIEB6_LENGTH                     0x00000001

//#define _CNENB_CNIEB7_POSITION                   0x00000007
//#define _CNENB_CNIEB7_MASK                       0x00000080
//#define _CNENB_CNIEB7_LENGTH                     0x00000001

//#define _CNENB_CNIEB8_POSITION                   0x00000008
//#define _CNENB_CNIEB8_MASK                       0x00000100
//#define _CNENB_CNIEB8_LENGTH                     0x00000001

//#define _CNENB_CNIEB9_POSITION                   0x00000009
//#define _CNENB_CNIEB9_MASK                       0x00000200
//#define _CNENB_CNIEB9_LENGTH                     0x00000001

//#define _CNENB_CNIEB10_POSITION                  0x0000000A
//#define _CNENB_CNIEB10_MASK                      0x00000400
//#define _CNENB_CNIEB10_LENGTH                    0x00000001

//#define _CNENB_CNIEB11_POSITION                  0x0000000B
//#define _CNENB_CNIEB11_MASK                      0x00000800
//#define _CNENB_CNIEB11_LENGTH                    0x00000001

//#define _CNENB_CNIEB12_POSITION                  0x0000000C
//#define _CNENB_CNIEB12_MASK                      0x00001000
//#define _CNENB_CNIEB12_LENGTH                    0x00000001

//#define _CNENB_CNIEB13_POSITION                  0x0000000D
//#define _CNENB_CNIEB13_MASK                      0x00002000
//#define _CNENB_CNIEB13_LENGTH                    0x00000001

//#define _CNENB_CNIEB14_POSITION                  0x0000000E
//#define _CNENB_CNIEB14_MASK                      0x00004000
//#define _CNENB_CNIEB14_LENGTH                    0x00000001

//#define _CNENB_CNIEB15_POSITION                  0x0000000F
//#define _CNENB_CNIEB15_MASK                      0x00008000
//#define _CNENB_CNIEB15_LENGTH                    0x00000001

//#define _CNENB_w_POSITION                        0x00000000
//#define _CNENB_w_MASK                            0xFFFFFFFF
//#define _CNENB_w_LENGTH                          0x00000020

//#define _CNSTATB_CNSTATB0_POSITION               0x00000000
//#define _CNSTATB_CNSTATB0_MASK                   0x00000001
//#define _CNSTATB_CNSTATB0_LENGTH                 0x00000001

//#define _CNSTATB_CNSTATB1_POSITION               0x00000001
//#define _CNSTATB_CNSTATB1_MASK                   0x00000002
//#define _CNSTATB_CNSTATB1_LENGTH                 0x00000001

//#define _CNSTATB_CNSTATB2_POSITION               0x00000002
//#define _CNSTATB_CNSTATB2_MASK                   0x00000004
//#define _CNSTATB_CNSTATB2_LENGTH                 0x00000001

//#define _CNSTATB_CNSTATB3_POSITION               0x00000003
//#define _CNSTATB_CNSTATB3_MASK                   0x00000008
//#define _CNSTATB_CNSTATB3_LENGTH                 0x00000001

//#define _CNSTATB_CNSTATB4_POSITION               0x00000004
//#define _CNSTATB_CNSTATB4_MASK                   0x00000010
//#define _CNSTATB_CNSTATB4_LENGTH                 0x00000001

//#define _CNSTATB_CNSTATB5_POSITION               0x00000005
//#define _CNSTATB_CNSTATB5_MASK                   0x00000020
//#define _CNSTATB_CNSTATB5_LENGTH                 0x00000001

//#define _CNSTATB_CNSTATB6_POSITION               0x00000006
//#define _CNSTATB_CNSTATB6_MASK                   0x00000040
//#define _CNSTATB_CNSTATB6_LENGTH                 0x00000001

//#define _CNSTATB_CNSTATB7_POSITION               0x00000007
//#define _CNSTATB_CNSTATB7_MASK                   0x00000080
//#define _CNSTATB_CNSTATB7_LENGTH                 0x00000001

//#define _CNSTATB_CNSTATB8_POSITION               0x00000008
//#define _CNSTATB_CNSTATB8_MASK                   0x00000100
//#define _CNSTATB_CNSTATB8_LENGTH                 0x00000001

//#define _CNSTATB_CNSTATB9_POSITION               0x00000009
//#define _CNSTATB_CNSTATB9_MASK                   0x00000200
//#define _CNSTATB_CNSTATB9_LENGTH                 0x00000001

//#define _CNSTATB_CNSTATB10_POSITION              0x0000000A
//#define _CNSTATB_CNSTATB10_MASK                  0x00000400
//#define _CNSTATB_CNSTATB10_LENGTH                0x00000001

//#define _CNSTATB_CNSTATB11_POSITION              0x0000000B
//#define _CNSTATB_CNSTATB11_MASK                  0x00000800
//#define _CNSTATB_CNSTATB11_LENGTH                0x00000001

//#define _CNSTATB_CNSTATB12_POSITION              0x0000000C
//#define _CNSTATB_CNSTATB12_MASK                  0x00001000
//#define _CNSTATB_CNSTATB12_LENGTH                0x00000001

//#define _CNSTATB_CNSTATB13_POSITION              0x0000000D
//#define _CNSTATB_CNSTATB13_MASK                  0x00002000
//#define _CNSTATB_CNSTATB13_LENGTH                0x00000001

//#define _CNSTATB_CNSTATB14_POSITION              0x0000000E
//#define _CNSTATB_CNSTATB14_MASK                  0x00004000
//#define _CNSTATB_CNSTATB14_LENGTH                0x00000001

//#define _CNSTATB_CNSTATB15_POSITION              0x0000000F
//#define _CNSTATB_CNSTATB15_MASK                  0x00008000
//#define _CNSTATB_CNSTATB15_LENGTH                0x00000001

