HomuraVehicle/homuraLib_v2/machine/device/p32mz2048efg100_forVC.c
//#define _CNSTATB_w_POSITION                      0x00000000
//#define _CNSTATB_w_MASK                          0xFFFFFFFF
//#define _CNSTATB_w_LENGTH                        0x00000020

//#define _CNNEB_CNNEB0_POSITION                   0x00000000
//#define _CNNEB_CNNEB0_MASK                       0x00000001
//#define _CNNEB_CNNEB0_LENGTH                     0x00000001

//#define _CNNEB_CNNEB1_POSITION                   0x00000001
//#define _CNNEB_CNNEB1_MASK                       0x00000002
//#define _CNNEB_CNNEB1_LENGTH                     0x00000001

//#define _CNNEB_CNNEB2_POSITION                   0x00000002
//#define _CNNEB_CNNEB2_MASK                       0x00000004
//#define _CNNEB_CNNEB2_LENGTH                     0x00000001

//#define _CNNEB_CNNEB3_POSITION                   0x00000003
//#define _CNNEB_CNNEB3_MASK                       0x00000008
//#define _CNNEB_CNNEB3_LENGTH                     0x00000001

//#define _CNNEB_CNNEB4_POSITION                   0x00000004
//#define _CNNEB_CNNEB4_MASK                       0x00000010
//#define _CNNEB_CNNEB4_LENGTH                     0x00000001

//#define _CNNEB_CNNEB5_POSITION                   0x00000005
//#define _CNNEB_CNNEB5_MASK                       0x00000020
//#define _CNNEB_CNNEB5_LENGTH                     0x00000001

//#define _CNNEB_CNNEB6_POSITION                   0x00000006
//#define _CNNEB_CNNEB6_MASK                       0x00000040
//#define _CNNEB_CNNEB6_LENGTH                     0x00000001

//#define _CNNEB_CNNEB7_POSITION                   0x00000007
//#define _CNNEB_CNNEB7_MASK                       0x00000080
//#define _CNNEB_CNNEB7_LENGTH                     0x00000001

//#define _CNNEB_CNNEB8_POSITION                   0x00000008
//#define _CNNEB_CNNEB8_MASK                       0x00000100
//#define _CNNEB_CNNEB8_LENGTH                     0x00000001

//#define _CNNEB_CNNEB9_POSITION                   0x00000009
//#define _CNNEB_CNNEB9_MASK                       0x00000200
//#define _CNNEB_CNNEB9_LENGTH                     0x00000001

//#define _CNNEB_CNNEB10_POSITION                  0x0000000A
//#define _CNNEB_CNNEB10_MASK                      0x00000400
//#define _CNNEB_CNNEB10_LENGTH                    0x00000001

//#define _CNNEB_CNNEB11_POSITION                  0x0000000B
//#define _CNNEB_CNNEB11_MASK                      0x00000800
//#define _CNNEB_CNNEB11_LENGTH                    0x00000001

//#define _CNNEB_CNNEB12_POSITION                  0x0000000C
//#define _CNNEB_CNNEB12_MASK                      0x00001000
//#define _CNNEB_CNNEB12_LENGTH                    0x00000001

//#define _CNNEB_CNNEB13_POSITION                  0x0000000D
//#define _CNNEB_CNNEB13_MASK                      0x00002000
//#define _CNNEB_CNNEB13_LENGTH                    0x00000001

//#define _CNNEB_CNNEB14_POSITION                  0x0000000E
//#define _CNNEB_CNNEB14_MASK                      0x00004000
//#define _CNNEB_CNNEB14_LENGTH                    0x00000001

//#define _CNNEB_CNNEB15_POSITION                  0x0000000F
//#define _CNNEB_CNNEB15_MASK                      0x00008000
//#define _CNNEB_CNNEB15_LENGTH                    0x00000001

//#define _CNFB_CNFB0_POSITION                     0x00000000
//#define _CNFB_CNFB0_MASK                         0x00000001
//#define _CNFB_CNFB0_LENGTH                       0x00000001

//#define _CNFB_CNFB1_POSITION                     0x00000001
//#define _CNFB_CNFB1_MASK                         0x00000002
//#define _CNFB_CNFB1_LENGTH                       0x00000001

//#define _CNFB_CNFB2_POSITION                     0x00000002
//#define _CNFB_CNFB2_MASK                         0x00000004
//#define _CNFB_CNFB2_LENGTH                       0x00000001

//#define _CNFB_CNFB3_POSITION                     0x00000003
//#define _CNFB_CNFB3_MASK                         0x00000008
//#define _CNFB_CNFB3_LENGTH                       0x00000001

//#define _CNFB_CNFB4_POSITION                     0x00000004
//#define _CNFB_CNFB4_MASK                         0x00000010
//#define _CNFB_CNFB4_LENGTH                       0x00000001

//#define _CNFB_CNFB5_POSITION                     0x00000005
//#define _CNFB_CNFB5_MASK                         0x00000020
//#define _CNFB_CNFB5_LENGTH                       0x00000001

//#define _CNFB_CNFB6_POSITION                     0x00000006
//#define _CNFB_CNFB6_MASK                         0x00000040
//#define _CNFB_CNFB6_LENGTH                       0x00000001

//#define _CNFB_CNFB7_POSITION                     0x00000007
//#define _CNFB_CNFB7_MASK                         0x00000080
//#define _CNFB_CNFB7_LENGTH                       0x00000001

//#define _CNFB_CNFB8_POSITION                     0x00000008
//#define _CNFB_CNFB8_MASK                         0x00000100
//#define _CNFB_CNFB8_LENGTH                       0x00000001

//#define _CNFB_CNFB9_POSITION                     0x00000009
//#define _CNFB_CNFB9_MASK                         0x00000200
//#define _CNFB_CNFB9_LENGTH                       0x00000001

//#define _CNFB_CNFB10_POSITION                    0x0000000A
//#define _CNFB_CNFB10_MASK                        0x00000400
//#define _CNFB_CNFB10_LENGTH                      0x00000001

//#define _CNFB_CNFB11_POSITION                    0x0000000B
//#define _CNFB_CNFB11_MASK                        0x00000800
//#define _CNFB_CNFB11_LENGTH                      0x00000001

//#define _CNFB_CNFB12_POSITION                    0x0000000C
//#define _CNFB_CNFB12_MASK                        0x00001000
//#define _CNFB_CNFB12_LENGTH                      0x00000001

//#define _CNFB_CNFB13_POSITION                    0x0000000D
//#define _CNFB_CNFB13_MASK                        0x00002000
//#define _CNFB_CNFB13_LENGTH                      0x00000001

//#define _CNFB_CNFB14_POSITION                    0x0000000E
//#define _CNFB_CNFB14_MASK                        0x00004000
//#define _CNFB_CNFB14_LENGTH                      0x00000001

//#define _CNFB_CNFB15_POSITION                    0x0000000F
//#define _CNFB_CNFB15_MASK                        0x00008000
//#define _CNFB_CNFB15_LENGTH                      0x00000001

//#define _SRCON0B_SR0B3_POSITION                  0x00000003
//#define _SRCON0B_SR0B3_MASK                      0x00000008
//#define _SRCON0B_SR0B3_LENGTH                    0x00000001

//#define _SRCON0B_SR0B5_POSITION                  0x00000005
//#define _SRCON0B_SR0B5_MASK                      0x00000020
//#define _SRCON0B_SR0B5_LENGTH                    0x00000001

//#define _SRCON0B_SR0B8_POSITION                  0x00000008
//#define _SRCON0B_SR0B8_MASK                      0x00000100
//#define _SRCON0B_SR0B8_LENGTH                    0x00000001

//#define _SRCON0B_SR0B9_POSITION                  0x00000009
//#define _SRCON0B_SR0B9_MASK                      0x00000200
//#define _SRCON0B_SR0B9_LENGTH                    0x00000001

//#define _SRCON0B_SR0B10_POSITION                 0x0000000A
//#define _SRCON0B_SR0B10_MASK                     0x00000400
//#define _SRCON0B_SR0B10_LENGTH                   0x00000001

