HomuraVehicle/homuraLib_v2/machine/device/p32mz2048efg100_forVC.c
//#define _LATC_LATC14_POSITION                    0x0000000E
//#define _LATC_LATC14_MASK                        0x00004000
//#define _LATC_LATC14_LENGTH                      0x00000001

//#define _LATC_LATC15_POSITION                    0x0000000F
//#define _LATC_LATC15_MASK                        0x00008000
//#define _LATC_LATC15_LENGTH                      0x00000001

//#define _LATC_w_POSITION                         0x00000000
//#define _LATC_w_MASK                             0xFFFFFFFF
//#define _LATC_w_LENGTH                           0x00000020

//#define _ODCC_ODCC1_POSITION                     0x00000001
//#define _ODCC_ODCC1_MASK                         0x00000002
//#define _ODCC_ODCC1_LENGTH                       0x00000001

//#define _ODCC_ODCC2_POSITION                     0x00000002
//#define _ODCC_ODCC2_MASK                         0x00000004
//#define _ODCC_ODCC2_LENGTH                       0x00000001

//#define _ODCC_ODCC3_POSITION                     0x00000003
//#define _ODCC_ODCC3_MASK                         0x00000008
//#define _ODCC_ODCC3_LENGTH                       0x00000001

//#define _ODCC_ODCC4_POSITION                     0x00000004
//#define _ODCC_ODCC4_MASK                         0x00000010
//#define _ODCC_ODCC4_LENGTH                       0x00000001

//#define _ODCC_ODCC12_POSITION                    0x0000000C
//#define _ODCC_ODCC12_MASK                        0x00001000
//#define _ODCC_ODCC12_LENGTH                      0x00000001

//#define _ODCC_ODCC13_POSITION                    0x0000000D
//#define _ODCC_ODCC13_MASK                        0x00002000
//#define _ODCC_ODCC13_LENGTH                      0x00000001

//#define _ODCC_ODCC14_POSITION                    0x0000000E
//#define _ODCC_ODCC14_MASK                        0x00004000
//#define _ODCC_ODCC14_LENGTH                      0x00000001

//#define _ODCC_ODCC15_POSITION                    0x0000000F
//#define _ODCC_ODCC15_MASK                        0x00008000
//#define _ODCC_ODCC15_LENGTH                      0x00000001

//#define _ODCC_w_POSITION                         0x00000000
//#define _ODCC_w_MASK                             0xFFFFFFFF
//#define _ODCC_w_LENGTH                           0x00000020

//#define _CNPUC_CNPUC1_POSITION                   0x00000001
//#define _CNPUC_CNPUC1_MASK                       0x00000002
//#define _CNPUC_CNPUC1_LENGTH                     0x00000001

//#define _CNPUC_CNPUC2_POSITION                   0x00000002
//#define _CNPUC_CNPUC2_MASK                       0x00000004
//#define _CNPUC_CNPUC2_LENGTH                     0x00000001

//#define _CNPUC_CNPUC3_POSITION                   0x00000003
//#define _CNPUC_CNPUC3_MASK                       0x00000008
//#define _CNPUC_CNPUC3_LENGTH                     0x00000001

//#define _CNPUC_CNPUC4_POSITION                   0x00000004
//#define _CNPUC_CNPUC4_MASK                       0x00000010
//#define _CNPUC_CNPUC4_LENGTH                     0x00000001

//#define _CNPUC_CNPUC12_POSITION                  0x0000000C
//#define _CNPUC_CNPUC12_MASK                      0x00001000
//#define _CNPUC_CNPUC12_LENGTH                    0x00000001

//#define _CNPUC_CNPUC13_POSITION                  0x0000000D
//#define _CNPUC_CNPUC13_MASK                      0x00002000
//#define _CNPUC_CNPUC13_LENGTH                    0x00000001

//#define _CNPUC_CNPUC14_POSITION                  0x0000000E
//#define _CNPUC_CNPUC14_MASK                      0x00004000
//#define _CNPUC_CNPUC14_LENGTH                    0x00000001

//#define _CNPUC_CNPUC15_POSITION                  0x0000000F
//#define _CNPUC_CNPUC15_MASK                      0x00008000
//#define _CNPUC_CNPUC15_LENGTH                    0x00000001

//#define _CNPUC_w_POSITION                        0x00000000
//#define _CNPUC_w_MASK                            0xFFFFFFFF
//#define _CNPUC_w_LENGTH                          0x00000020

//#define _CNPDC_CNPDC1_POSITION                   0x00000001
//#define _CNPDC_CNPDC1_MASK                       0x00000002
//#define _CNPDC_CNPDC1_LENGTH                     0x00000001

//#define _CNPDC_CNPDC2_POSITION                   0x00000002
//#define _CNPDC_CNPDC2_MASK                       0x00000004
//#define _CNPDC_CNPDC2_LENGTH                     0x00000001

//#define _CNPDC_CNPDC3_POSITION                   0x00000003
//#define _CNPDC_CNPDC3_MASK                       0x00000008
//#define _CNPDC_CNPDC3_LENGTH                     0x00000001

//#define _CNPDC_CNPDC4_POSITION                   0x00000004
//#define _CNPDC_CNPDC4_MASK                       0x00000010
//#define _CNPDC_CNPDC4_LENGTH                     0x00000001

//#define _CNPDC_CNPDC12_POSITION                  0x0000000C
//#define _CNPDC_CNPDC12_MASK                      0x00001000
//#define _CNPDC_CNPDC12_LENGTH                    0x00000001

//#define _CNPDC_CNPDC13_POSITION                  0x0000000D
//#define _CNPDC_CNPDC13_MASK                      0x00002000
//#define _CNPDC_CNPDC13_LENGTH                    0x00000001

//#define _CNPDC_CNPDC14_POSITION                  0x0000000E
//#define _CNPDC_CNPDC14_MASK                      0x00004000
//#define _CNPDC_CNPDC14_LENGTH                    0x00000001

//#define _CNPDC_CNPDC15_POSITION                  0x0000000F
//#define _CNPDC_CNPDC15_MASK                      0x00008000
//#define _CNPDC_CNPDC15_LENGTH                    0x00000001

//#define _CNPDC_w_POSITION                        0x00000000
//#define _CNPDC_w_MASK                            0xFFFFFFFF
//#define _CNPDC_w_LENGTH                          0x00000020

//#define _CNCONC_EDGEDETECT_POSITION              0x0000000B
//#define _CNCONC_EDGEDETECT_MASK                  0x00000800
//#define _CNCONC_EDGEDETECT_LENGTH                0x00000001

//#define _CNCONC_SIDL_POSITION                    0x0000000D
//#define _CNCONC_SIDL_MASK                        0x00002000
//#define _CNCONC_SIDL_LENGTH                      0x00000001

//#define _CNCONC_ON_POSITION                      0x0000000F
//#define _CNCONC_ON_MASK                          0x00008000
//#define _CNCONC_ON_LENGTH                        0x00000001

//#define _CNCONC_w_POSITION                       0x00000000
//#define _CNCONC_w_MASK                           0xFFFFFFFF
//#define _CNCONC_w_LENGTH                         0x00000020

//#define _CNENC_CNIEC1_POSITION                   0x00000001
//#define _CNENC_CNIEC1_MASK                       0x00000002
//#define _CNENC_CNIEC1_LENGTH                     0x00000001

