HomuraVehicle/homuraLib_v2/machine/device/p32mz2048efg100_forVC.c
//#define _CNENC_CNIEC2_POSITION                   0x00000002
//#define _CNENC_CNIEC2_MASK                       0x00000004
//#define _CNENC_CNIEC2_LENGTH                     0x00000001

//#define _CNENC_CNIEC3_POSITION                   0x00000003
//#define _CNENC_CNIEC3_MASK                       0x00000008
//#define _CNENC_CNIEC3_LENGTH                     0x00000001

//#define _CNENC_CNIEC4_POSITION                   0x00000004
//#define _CNENC_CNIEC4_MASK                       0x00000010
//#define _CNENC_CNIEC4_LENGTH                     0x00000001

//#define _CNENC_CNIEC12_POSITION                  0x0000000C
//#define _CNENC_CNIEC12_MASK                      0x00001000
//#define _CNENC_CNIEC12_LENGTH                    0x00000001

//#define _CNENC_CNIEC13_POSITION                  0x0000000D
//#define _CNENC_CNIEC13_MASK                      0x00002000
//#define _CNENC_CNIEC13_LENGTH                    0x00000001

//#define _CNENC_CNIEC14_POSITION                  0x0000000E
//#define _CNENC_CNIEC14_MASK                      0x00004000
//#define _CNENC_CNIEC14_LENGTH                    0x00000001

//#define _CNENC_CNIEC15_POSITION                  0x0000000F
//#define _CNENC_CNIEC15_MASK                      0x00008000
//#define _CNENC_CNIEC15_LENGTH                    0x00000001

//#define _CNENC_w_POSITION                        0x00000000
//#define _CNENC_w_MASK                            0xFFFFFFFF
//#define _CNENC_w_LENGTH                          0x00000020

//#define _CNSTATC_CNSTATC1_POSITION               0x00000001
//#define _CNSTATC_CNSTATC1_MASK                   0x00000002
//#define _CNSTATC_CNSTATC1_LENGTH                 0x00000001

//#define _CNSTATC_CNSTATC2_POSITION               0x00000002
//#define _CNSTATC_CNSTATC2_MASK                   0x00000004
//#define _CNSTATC_CNSTATC2_LENGTH                 0x00000001

//#define _CNSTATC_CNSTATC3_POSITION               0x00000003
//#define _CNSTATC_CNSTATC3_MASK                   0x00000008
//#define _CNSTATC_CNSTATC3_LENGTH                 0x00000001

//#define _CNSTATC_CNSTATC4_POSITION               0x00000004
//#define _CNSTATC_CNSTATC4_MASK                   0x00000010
//#define _CNSTATC_CNSTATC4_LENGTH                 0x00000001

//#define _CNSTATC_CNSTATC12_POSITION              0x0000000C
//#define _CNSTATC_CNSTATC12_MASK                  0x00001000
//#define _CNSTATC_CNSTATC12_LENGTH                0x00000001

//#define _CNSTATC_CNSTATC13_POSITION              0x0000000D
//#define _CNSTATC_CNSTATC13_MASK                  0x00002000
//#define _CNSTATC_CNSTATC13_LENGTH                0x00000001

//#define _CNSTATC_CNSTATC14_POSITION              0x0000000E
//#define _CNSTATC_CNSTATC14_MASK                  0x00004000
//#define _CNSTATC_CNSTATC14_LENGTH                0x00000001

//#define _CNSTATC_CNSTATC15_POSITION              0x0000000F
//#define _CNSTATC_CNSTATC15_MASK                  0x00008000
//#define _CNSTATC_CNSTATC15_LENGTH                0x00000001

//#define _CNSTATC_w_POSITION                      0x00000000
//#define _CNSTATC_w_MASK                          0xFFFFFFFF
//#define _CNSTATC_w_LENGTH                        0x00000020

//#define _CNNEC_CNNEC1_POSITION                   0x00000001
//#define _CNNEC_CNNEC1_MASK                       0x00000002
//#define _CNNEC_CNNEC1_LENGTH                     0x00000001

//#define _CNNEC_CNNEC2_POSITION                   0x00000002
//#define _CNNEC_CNNEC2_MASK                       0x00000004
//#define _CNNEC_CNNEC2_LENGTH                     0x00000001

//#define _CNNEC_CNNEC3_POSITION                   0x00000003
//#define _CNNEC_CNNEC3_MASK                       0x00000008
//#define _CNNEC_CNNEC3_LENGTH                     0x00000001

//#define _CNNEC_CNNEC4_POSITION                   0x00000004
//#define _CNNEC_CNNEC4_MASK                       0x00000010
//#define _CNNEC_CNNEC4_LENGTH                     0x00000001

//#define _CNNEC_CNNEC12_POSITION                  0x0000000C
//#define _CNNEC_CNNEC12_MASK                      0x00001000
//#define _CNNEC_CNNEC12_LENGTH                    0x00000001

//#define _CNNEC_CNNEC13_POSITION                  0x0000000D
//#define _CNNEC_CNNEC13_MASK                      0x00002000
//#define _CNNEC_CNNEC13_LENGTH                    0x00000001

//#define _CNNEC_CNNEC14_POSITION                  0x0000000E
//#define _CNNEC_CNNEC14_MASK                      0x00004000
//#define _CNNEC_CNNEC14_LENGTH                    0x00000001

//#define _CNNEC_CNNEC15_POSITION                  0x0000000F
//#define _CNNEC_CNNEC15_MASK                      0x00008000
//#define _CNNEC_CNNEC15_LENGTH                    0x00000001

//#define _CNFC_CNFC1_POSITION                     0x00000001
//#define _CNFC_CNFC1_MASK                         0x00000002
//#define _CNFC_CNFC1_LENGTH                       0x00000001

//#define _CNFC_CNFC2_POSITION                     0x00000002
//#define _CNFC_CNFC2_MASK                         0x00000004
//#define _CNFC_CNFC2_LENGTH                       0x00000001

//#define _CNFC_CNFC3_POSITION                     0x00000003
//#define _CNFC_CNFC3_MASK                         0x00000008
//#define _CNFC_CNFC3_LENGTH                       0x00000001

//#define _CNFC_CNFC4_POSITION                     0x00000004
//#define _CNFC_CNFC4_MASK                         0x00000010
//#define _CNFC_CNFC4_LENGTH                       0x00000001

//#define _CNFC_CNFC12_POSITION                    0x0000000C
//#define _CNFC_CNFC12_MASK                        0x00001000
//#define _CNFC_CNFC12_LENGTH                      0x00000001

//#define _CNFC_CNFC13_POSITION                    0x0000000D
//#define _CNFC_CNFC13_MASK                        0x00002000
//#define _CNFC_CNFC13_LENGTH                      0x00000001

//#define _CNFC_CNFC14_POSITION                    0x0000000E
//#define _CNFC_CNFC14_MASK                        0x00004000
//#define _CNFC_CNFC14_LENGTH                      0x00000001

//#define _CNFC_CNFC15_POSITION                    0x0000000F
//#define _CNFC_CNFC15_MASK                        0x00008000
//#define _CNFC_CNFC15_LENGTH                      0x00000001

