HomuraVehicle/homuraLib_v2/machine/device/p32mz2048efg100_forVC.c
//#define _ANSELD_ANSD14_POSITION                  0x0000000E
//#define _ANSELD_ANSD14_MASK                      0x00004000
//#define _ANSELD_ANSD14_LENGTH                    0x00000001

//#define _ANSELD_ANSD15_POSITION                  0x0000000F
//#define _ANSELD_ANSD15_MASK                      0x00008000
//#define _ANSELD_ANSD15_LENGTH                    0x00000001

//#define _ANSELD_w_POSITION                       0x00000000
//#define _ANSELD_w_MASK                           0xFFFFFFFF
//#define _ANSELD_w_LENGTH                         0x00000020

//#define _TRISD_TRISD0_POSITION                   0x00000000
//#define _TRISD_TRISD0_MASK                       0x00000001
//#define _TRISD_TRISD0_LENGTH                     0x00000001

//#define _TRISD_TRISD1_POSITION                   0x00000001
//#define _TRISD_TRISD1_MASK                       0x00000002
//#define _TRISD_TRISD1_LENGTH                     0x00000001

//#define _TRISD_TRISD2_POSITION                   0x00000002
//#define _TRISD_TRISD2_MASK                       0x00000004
//#define _TRISD_TRISD2_LENGTH                     0x00000001

//#define _TRISD_TRISD3_POSITION                   0x00000003
//#define _TRISD_TRISD3_MASK                       0x00000008
//#define _TRISD_TRISD3_LENGTH                     0x00000001

//#define _TRISD_TRISD4_POSITION                   0x00000004
//#define _TRISD_TRISD4_MASK                       0x00000010
//#define _TRISD_TRISD4_LENGTH                     0x00000001

//#define _TRISD_TRISD5_POSITION                   0x00000005
//#define _TRISD_TRISD5_MASK                       0x00000020
//#define _TRISD_TRISD5_LENGTH                     0x00000001

//#define _TRISD_TRISD9_POSITION                   0x00000009
//#define _TRISD_TRISD9_MASK                       0x00000200
//#define _TRISD_TRISD9_LENGTH                     0x00000001

//#define _TRISD_TRISD10_POSITION                  0x0000000A
//#define _TRISD_TRISD10_MASK                      0x00000400
//#define _TRISD_TRISD10_LENGTH                    0x00000001

//#define _TRISD_TRISD11_POSITION                  0x0000000B
//#define _TRISD_TRISD11_MASK                      0x00000800
//#define _TRISD_TRISD11_LENGTH                    0x00000001

//#define _TRISD_TRISD12_POSITION                  0x0000000C
//#define _TRISD_TRISD12_MASK                      0x00001000
//#define _TRISD_TRISD12_LENGTH                    0x00000001

//#define _TRISD_TRISD13_POSITION                  0x0000000D
//#define _TRISD_TRISD13_MASK                      0x00002000
//#define _TRISD_TRISD13_LENGTH                    0x00000001

//#define _TRISD_TRISD14_POSITION                  0x0000000E
//#define _TRISD_TRISD14_MASK                      0x00004000
//#define _TRISD_TRISD14_LENGTH                    0x00000001

//#define _TRISD_TRISD15_POSITION                  0x0000000F
//#define _TRISD_TRISD15_MASK                      0x00008000
//#define _TRISD_TRISD15_LENGTH                    0x00000001

//#define _TRISD_w_POSITION                        0x00000000
//#define _TRISD_w_MASK                            0xFFFFFFFF
//#define _TRISD_w_LENGTH                          0x00000020

//#define _PORTD_RD0_POSITION                      0x00000000
//#define _PORTD_RD0_MASK                          0x00000001
//#define _PORTD_RD0_LENGTH                        0x00000001

//#define _PORTD_RD1_POSITION                      0x00000001
//#define _PORTD_RD1_MASK                          0x00000002
//#define _PORTD_RD1_LENGTH                        0x00000001

//#define _PORTD_RD2_POSITION                      0x00000002
//#define _PORTD_RD2_MASK                          0x00000004
//#define _PORTD_RD2_LENGTH                        0x00000001

//#define _PORTD_RD3_POSITION                      0x00000003
//#define _PORTD_RD3_MASK                          0x00000008
//#define _PORTD_RD3_LENGTH                        0x00000001

//#define _PORTD_RD4_POSITION                      0x00000004
//#define _PORTD_RD4_MASK                          0x00000010
//#define _PORTD_RD4_LENGTH                        0x00000001

//#define _PORTD_RD5_POSITION                      0x00000005
//#define _PORTD_RD5_MASK                          0x00000020
//#define _PORTD_RD5_LENGTH                        0x00000001

//#define _PORTD_RD9_POSITION                      0x00000009
//#define _PORTD_RD9_MASK                          0x00000200
//#define _PORTD_RD9_LENGTH                        0x00000001

//#define _PORTD_RD10_POSITION                     0x0000000A
//#define _PORTD_RD10_MASK                         0x00000400
//#define _PORTD_RD10_LENGTH                       0x00000001

//#define _PORTD_RD11_POSITION                     0x0000000B
//#define _PORTD_RD11_MASK                         0x00000800
//#define _PORTD_RD11_LENGTH                       0x00000001

//#define _PORTD_RD12_POSITION                     0x0000000C
//#define _PORTD_RD12_MASK                         0x00001000
//#define _PORTD_RD12_LENGTH                       0x00000001

//#define _PORTD_RD13_POSITION                     0x0000000D
//#define _PORTD_RD13_MASK                         0x00002000
//#define _PORTD_RD13_LENGTH                       0x00000001

//#define _PORTD_RD14_POSITION                     0x0000000E
//#define _PORTD_RD14_MASK                         0x00004000
//#define _PORTD_RD14_LENGTH                       0x00000001

//#define _PORTD_RD15_POSITION                     0x0000000F
//#define _PORTD_RD15_MASK                         0x00008000
//#define _PORTD_RD15_LENGTH                       0x00000001

//#define _PORTD_w_POSITION                        0x00000000
//#define _PORTD_w_MASK                            0xFFFFFFFF
//#define _PORTD_w_LENGTH                          0x00000020

//#define _LATD_LATD0_POSITION                     0x00000000
//#define _LATD_LATD0_MASK                         0x00000001
//#define _LATD_LATD0_LENGTH                       0x00000001

//#define _LATD_LATD1_POSITION                     0x00000001
//#define _LATD_LATD1_MASK                         0x00000002
//#define _LATD_LATD1_LENGTH                       0x00000001

//#define _LATD_LATD2_POSITION                     0x00000002
//#define _LATD_LATD2_MASK                         0x00000004
//#define _LATD_LATD2_LENGTH                       0x00000001

//#define _LATD_LATD3_POSITION                     0x00000003
//#define _LATD_LATD3_MASK                         0x00000008
//#define _LATD_LATD3_LENGTH                       0x00000001

//#define _LATD_LATD4_POSITION                     0x00000004
//#define _LATD_LATD4_MASK                         0x00000010
//#define _LATD_LATD4_LENGTH                       0x00000001

//#define _LATD_LATD5_POSITION                     0x00000005
//#define _LATD_LATD5_MASK                         0x00000020
//#define _LATD_LATD5_LENGTH                       0x00000001

//#define _LATD_LATD9_POSITION                     0x00000009
//#define _LATD_LATD9_MASK                         0x00000200
//#define _LATD_LATD9_LENGTH                       0x00000001

