HomuraVehicle/homuraLib_v2/machine/device/p32mz2048efg100_forVC.c
//#define _CNSTATD_w_POSITION                      0x00000000
//#define _CNSTATD_w_MASK                          0xFFFFFFFF
//#define _CNSTATD_w_LENGTH                        0x00000020

//#define _CNNED_CNNED0_POSITION                   0x00000000
//#define _CNNED_CNNED0_MASK                       0x00000001
//#define _CNNED_CNNED0_LENGTH                     0x00000001

//#define _CNNED_CNNED1_POSITION                   0x00000001
//#define _CNNED_CNNED1_MASK                       0x00000002
//#define _CNNED_CNNED1_LENGTH                     0x00000001

//#define _CNNED_CNNED2_POSITION                   0x00000002
//#define _CNNED_CNNED2_MASK                       0x00000004
//#define _CNNED_CNNED2_LENGTH                     0x00000001

//#define _CNNED_CNNED3_POSITION                   0x00000003
//#define _CNNED_CNNED3_MASK                       0x00000008
//#define _CNNED_CNNED3_LENGTH                     0x00000001

//#define _CNNED_CNNED4_POSITION                   0x00000004
//#define _CNNED_CNNED4_MASK                       0x00000010
//#define _CNNED_CNNED4_LENGTH                     0x00000001

//#define _CNNED_CNNED5_POSITION                   0x00000005
//#define _CNNED_CNNED5_MASK                       0x00000020
//#define _CNNED_CNNED5_LENGTH                     0x00000001

//#define _CNNED_CNNED9_POSITION                   0x00000009
//#define _CNNED_CNNED9_MASK                       0x00000200
//#define _CNNED_CNNED9_LENGTH                     0x00000001

//#define _CNNED_CNNED10_POSITION                  0x0000000A
//#define _CNNED_CNNED10_MASK                      0x00000400
//#define _CNNED_CNNED10_LENGTH                    0x00000001

//#define _CNNED_CNNED11_POSITION                  0x0000000B
//#define _CNNED_CNNED11_MASK                      0x00000800
//#define _CNNED_CNNED11_LENGTH                    0x00000001

//#define _CNNED_CNNED12_POSITION                  0x0000000C
//#define _CNNED_CNNED12_MASK                      0x00001000
//#define _CNNED_CNNED12_LENGTH                    0x00000001

//#define _CNNED_CNNED13_POSITION                  0x0000000D
//#define _CNNED_CNNED13_MASK                      0x00002000
//#define _CNNED_CNNED13_LENGTH                    0x00000001

//#define _CNNED_CNNED14_POSITION                  0x0000000E
//#define _CNNED_CNNED14_MASK                      0x00004000
//#define _CNNED_CNNED14_LENGTH                    0x00000001

//#define _CNNED_CNNED15_POSITION                  0x0000000F
//#define _CNNED_CNNED15_MASK                      0x00008000
//#define _CNNED_CNNED15_LENGTH                    0x00000001

//#define _CNFD_CNFD0_POSITION                     0x00000000
//#define _CNFD_CNFD0_MASK                         0x00000001
//#define _CNFD_CNFD0_LENGTH                       0x00000001

//#define _CNFD_CNFD1_POSITION                     0x00000001
//#define _CNFD_CNFD1_MASK                         0x00000002
//#define _CNFD_CNFD1_LENGTH                       0x00000001

//#define _CNFD_CNFD2_POSITION                     0x00000002
//#define _CNFD_CNFD2_MASK                         0x00000004
//#define _CNFD_CNFD2_LENGTH                       0x00000001

//#define _CNFD_CNFD3_POSITION                     0x00000003
//#define _CNFD_CNFD3_MASK                         0x00000008
//#define _CNFD_CNFD3_LENGTH                       0x00000001

//#define _CNFD_CNFD4_POSITION                     0x00000004
//#define _CNFD_CNFD4_MASK                         0x00000010
//#define _CNFD_CNFD4_LENGTH                       0x00000001

//#define _CNFD_CNFD5_POSITION                     0x00000005
//#define _CNFD_CNFD5_MASK                         0x00000020
//#define _CNFD_CNFD5_LENGTH                       0x00000001

//#define _CNFD_CNFD9_POSITION                     0x00000009
//#define _CNFD_CNFD9_MASK                         0x00000200
//#define _CNFD_CNFD9_LENGTH                       0x00000001

//#define _CNFD_CNFD10_POSITION                    0x0000000A
//#define _CNFD_CNFD10_MASK                        0x00000400
//#define _CNFD_CNFD10_LENGTH                      0x00000001

//#define _CNFD_CNFD11_POSITION                    0x0000000B
//#define _CNFD_CNFD11_MASK                        0x00000800
//#define _CNFD_CNFD11_LENGTH                      0x00000001

//#define _CNFD_CNFD12_POSITION                    0x0000000C
//#define _CNFD_CNFD12_MASK                        0x00001000
//#define _CNFD_CNFD12_LENGTH                      0x00000001

//#define _CNFD_CNFD13_POSITION                    0x0000000D
//#define _CNFD_CNFD13_MASK                        0x00002000
//#define _CNFD_CNFD13_LENGTH                      0x00000001

//#define _CNFD_CNFD14_POSITION                    0x0000000E
//#define _CNFD_CNFD14_MASK                        0x00004000
//#define _CNFD_CNFD14_LENGTH                      0x00000001

//#define _CNFD_CNFD15_POSITION                    0x0000000F
//#define _CNFD_CNFD15_MASK                        0x00008000
//#define _CNFD_CNFD15_LENGTH                      0x00000001

//#define _ANSELE_ANSE4_POSITION                   0x00000004
//#define _ANSELE_ANSE4_MASK                       0x00000010
//#define _ANSELE_ANSE4_LENGTH                     0x00000001

//#define _ANSELE_ANSE5_POSITION                   0x00000005
//#define _ANSELE_ANSE5_MASK                       0x00000020
//#define _ANSELE_ANSE5_LENGTH                     0x00000001

//#define _ANSELE_ANSE6_POSITION                   0x00000006
//#define _ANSELE_ANSE6_MASK                       0x00000040
//#define _ANSELE_ANSE6_LENGTH                     0x00000001

//#define _ANSELE_ANSE7_POSITION                   0x00000007
//#define _ANSELE_ANSE7_MASK                       0x00000080
//#define _ANSELE_ANSE7_LENGTH                     0x00000001

//#define _ANSELE_ANSE8_POSITION                   0x00000008
//#define _ANSELE_ANSE8_MASK                       0x00000100
//#define _ANSELE_ANSE8_LENGTH                     0x00000001

//#define _ANSELE_ANSE9_POSITION                   0x00000009
//#define _ANSELE_ANSE9_MASK                       0x00000200
//#define _ANSELE_ANSE9_LENGTH                     0x00000001

//#define _ANSELE_w_POSITION                       0x00000000
//#define _ANSELE_w_MASK                           0xFFFFFFFF
//#define _ANSELE_w_LENGTH                         0x00000020

//#define _TRISE_TRISE0_POSITION                   0x00000000
//#define _TRISE_TRISE0_MASK                       0x00000001
//#define _TRISE_TRISE0_LENGTH                     0x00000001

