HomuraVehicle/homuraLib_v2/machine/device/p32mz2048efg100_forVC.c
//#define _CNENE_CNIEE3_POSITION                   0x00000003
//#define _CNENE_CNIEE3_MASK                       0x00000008
//#define _CNENE_CNIEE3_LENGTH                     0x00000001

//#define _CNENE_CNIEE4_POSITION                   0x00000004
//#define _CNENE_CNIEE4_MASK                       0x00000010
//#define _CNENE_CNIEE4_LENGTH                     0x00000001

//#define _CNENE_CNIEE5_POSITION                   0x00000005
//#define _CNENE_CNIEE5_MASK                       0x00000020
//#define _CNENE_CNIEE5_LENGTH                     0x00000001

//#define _CNENE_CNIEE6_POSITION                   0x00000006
//#define _CNENE_CNIEE6_MASK                       0x00000040
//#define _CNENE_CNIEE6_LENGTH                     0x00000001

//#define _CNENE_CNIEE7_POSITION                   0x00000007
//#define _CNENE_CNIEE7_MASK                       0x00000080
//#define _CNENE_CNIEE7_LENGTH                     0x00000001

//#define _CNENE_CNIEE8_POSITION                   0x00000008
//#define _CNENE_CNIEE8_MASK                       0x00000100
//#define _CNENE_CNIEE8_LENGTH                     0x00000001

//#define _CNENE_CNIEE9_POSITION                   0x00000009
//#define _CNENE_CNIEE9_MASK                       0x00000200
//#define _CNENE_CNIEE9_LENGTH                     0x00000001

//#define _CNENE_w_POSITION                        0x00000000
//#define _CNENE_w_MASK                            0xFFFFFFFF
//#define _CNENE_w_LENGTH                          0x00000020

//#define _CNSTATE_CNSTATE0_POSITION               0x00000000
//#define _CNSTATE_CNSTATE0_MASK                   0x00000001
//#define _CNSTATE_CNSTATE0_LENGTH                 0x00000001

//#define _CNSTATE_CNSTATE1_POSITION               0x00000001
//#define _CNSTATE_CNSTATE1_MASK                   0x00000002
//#define _CNSTATE_CNSTATE1_LENGTH                 0x00000001

//#define _CNSTATE_CNSTATE2_POSITION               0x00000002
//#define _CNSTATE_CNSTATE2_MASK                   0x00000004
//#define _CNSTATE_CNSTATE2_LENGTH                 0x00000001

//#define _CNSTATE_CNSTATE3_POSITION               0x00000003
//#define _CNSTATE_CNSTATE3_MASK                   0x00000008
//#define _CNSTATE_CNSTATE3_LENGTH                 0x00000001

//#define _CNSTATE_CNSTATE4_POSITION               0x00000004
//#define _CNSTATE_CNSTATE4_MASK                   0x00000010
//#define _CNSTATE_CNSTATE4_LENGTH                 0x00000001

//#define _CNSTATE_CNSTATE5_POSITION               0x00000005
//#define _CNSTATE_CNSTATE5_MASK                   0x00000020
//#define _CNSTATE_CNSTATE5_LENGTH                 0x00000001

//#define _CNSTATE_CNSTATE6_POSITION               0x00000006
//#define _CNSTATE_CNSTATE6_MASK                   0x00000040
//#define _CNSTATE_CNSTATE6_LENGTH                 0x00000001

//#define _CNSTATE_CNSTATE7_POSITION               0x00000007
//#define _CNSTATE_CNSTATE7_MASK                   0x00000080
//#define _CNSTATE_CNSTATE7_LENGTH                 0x00000001

//#define _CNSTATE_CNSTATE8_POSITION               0x00000008
//#define _CNSTATE_CNSTATE8_MASK                   0x00000100
//#define _CNSTATE_CNSTATE8_LENGTH                 0x00000001

//#define _CNSTATE_CNSTATE9_POSITION               0x00000009
//#define _CNSTATE_CNSTATE9_MASK                   0x00000200
//#define _CNSTATE_CNSTATE9_LENGTH                 0x00000001

//#define _CNSTATE_w_POSITION                      0x00000000
//#define _CNSTATE_w_MASK                          0xFFFFFFFF
//#define _CNSTATE_w_LENGTH                        0x00000020

//#define _CNNEE_CNNEE0_POSITION                   0x00000000
//#define _CNNEE_CNNEE0_MASK                       0x00000001
//#define _CNNEE_CNNEE0_LENGTH                     0x00000001

//#define _CNNEE_CNNEE1_POSITION                   0x00000001
//#define _CNNEE_CNNEE1_MASK                       0x00000002
//#define _CNNEE_CNNEE1_LENGTH                     0x00000001

//#define _CNNEE_CNNEE2_POSITION                   0x00000002
//#define _CNNEE_CNNEE2_MASK                       0x00000004
//#define _CNNEE_CNNEE2_LENGTH                     0x00000001

//#define _CNNEE_CNNEE3_POSITION                   0x00000003
//#define _CNNEE_CNNEE3_MASK                       0x00000008
//#define _CNNEE_CNNEE3_LENGTH                     0x00000001

//#define _CNNEE_CNNEE4_POSITION                   0x00000004
//#define _CNNEE_CNNEE4_MASK                       0x00000010
//#define _CNNEE_CNNEE4_LENGTH                     0x00000001

//#define _CNNEE_CNNEE5_POSITION                   0x00000005
//#define _CNNEE_CNNEE5_MASK                       0x00000020
//#define _CNNEE_CNNEE5_LENGTH                     0x00000001

//#define _CNNEE_CNNEE6_POSITION                   0x00000006
//#define _CNNEE_CNNEE6_MASK                       0x00000040
//#define _CNNEE_CNNEE6_LENGTH                     0x00000001

//#define _CNNEE_CNNEE7_POSITION                   0x00000007
//#define _CNNEE_CNNEE7_MASK                       0x00000080
//#define _CNNEE_CNNEE7_LENGTH                     0x00000001

//#define _CNNEE_CNNEE8_POSITION                   0x00000008
//#define _CNNEE_CNNEE8_MASK                       0x00000100
//#define _CNNEE_CNNEE8_LENGTH                     0x00000001

//#define _CNNEE_CNNEE9_POSITION                   0x00000009
//#define _CNNEE_CNNEE9_MASK                       0x00000200
//#define _CNNEE_CNNEE9_LENGTH                     0x00000001

//#define _CNFE_CNFE0_POSITION                     0x00000000
//#define _CNFE_CNFE0_MASK                         0x00000001
//#define _CNFE_CNFE0_LENGTH                       0x00000001

//#define _CNFE_CNFE1_POSITION                     0x00000001
//#define _CNFE_CNFE1_MASK                         0x00000002
//#define _CNFE_CNFE1_LENGTH                       0x00000001

//#define _CNFE_CNFE2_POSITION                     0x00000002
//#define _CNFE_CNFE2_MASK                         0x00000004
//#define _CNFE_CNFE2_LENGTH                       0x00000001

//#define _CNFE_CNFE3_POSITION                     0x00000003
//#define _CNFE_CNFE3_MASK                         0x00000008
//#define _CNFE_CNFE3_LENGTH                       0x00000001

