HomuraVehicle/homuraLib_v2/machine/device/p32mz2048efg100_forVC.c
//#define _CNSTATF_w_POSITION                      0x00000000
//#define _CNSTATF_w_MASK                          0xFFFFFFFF
//#define _CNSTATF_w_LENGTH                        0x00000020

//#define _CNNEF_CNNEF0_POSITION                   0x00000000
//#define _CNNEF_CNNEF0_MASK                       0x00000001
//#define _CNNEF_CNNEF0_LENGTH                     0x00000001

//#define _CNNEF_CNNEF1_POSITION                   0x00000001
//#define _CNNEF_CNNEF1_MASK                       0x00000002
//#define _CNNEF_CNNEF1_LENGTH                     0x00000001

//#define _CNNEF_CNNEF2_POSITION                   0x00000002
//#define _CNNEF_CNNEF2_MASK                       0x00000004
//#define _CNNEF_CNNEF2_LENGTH                     0x00000001

//#define _CNNEF_CNNEF3_POSITION                   0x00000003
//#define _CNNEF_CNNEF3_MASK                       0x00000008
//#define _CNNEF_CNNEF3_LENGTH                     0x00000001

//#define _CNNEF_CNNEF4_POSITION                   0x00000004
//#define _CNNEF_CNNEF4_MASK                       0x00000010
//#define _CNNEF_CNNEF4_LENGTH                     0x00000001

//#define _CNNEF_CNNEF5_POSITION                   0x00000005
//#define _CNNEF_CNNEF5_MASK                       0x00000020
//#define _CNNEF_CNNEF5_LENGTH                     0x00000001

//#define _CNNEF_CNNEF8_POSITION                   0x00000008
//#define _CNNEF_CNNEF8_MASK                       0x00000100
//#define _CNNEF_CNNEF8_LENGTH                     0x00000001

//#define _CNNEF_CNNEF12_POSITION                  0x0000000C
//#define _CNNEF_CNNEF12_MASK                      0x00001000
//#define _CNNEF_CNNEF12_LENGTH                    0x00000001

//#define _CNNEF_CNNEF13_POSITION                  0x0000000D
//#define _CNNEF_CNNEF13_MASK                      0x00002000
//#define _CNNEF_CNNEF13_LENGTH                    0x00000001

//#define _CNFF_CNFF0_POSITION                     0x00000000
//#define _CNFF_CNFF0_MASK                         0x00000001
//#define _CNFF_CNFF0_LENGTH                       0x00000001

//#define _CNFF_CNFF1_POSITION                     0x00000001
//#define _CNFF_CNFF1_MASK                         0x00000002
//#define _CNFF_CNFF1_LENGTH                       0x00000001

//#define _CNFF_CNFF2_POSITION                     0x00000002
//#define _CNFF_CNFF2_MASK                         0x00000004
//#define _CNFF_CNFF2_LENGTH                       0x00000001

//#define _CNFF_CNFF3_POSITION                     0x00000003
//#define _CNFF_CNFF3_MASK                         0x00000008
//#define _CNFF_CNFF3_LENGTH                       0x00000001

//#define _CNFF_CNFF4_POSITION                     0x00000004
//#define _CNFF_CNFF4_MASK                         0x00000010
//#define _CNFF_CNFF4_LENGTH                       0x00000001

//#define _CNFF_CNFF5_POSITION                     0x00000005
//#define _CNFF_CNFF5_MASK                         0x00000020
//#define _CNFF_CNFF5_LENGTH                       0x00000001

//#define _CNFF_CNFF8_POSITION                     0x00000008
//#define _CNFF_CNFF8_MASK                         0x00000100
//#define _CNFF_CNFF8_LENGTH                       0x00000001

//#define _CNFF_CNFF12_POSITION                    0x0000000C
//#define _CNFF_CNFF12_MASK                        0x00001000
//#define _CNFF_CNFF12_LENGTH                      0x00000001

//#define _CNFF_CNFF13_POSITION                    0x0000000D
//#define _CNFF_CNFF13_MASK                        0x00002000
//#define _CNFF_CNFF13_LENGTH                      0x00000001

//#define _SRCON0F_SR0F0_POSITION                  0x00000000
//#define _SRCON0F_SR0F0_MASK                      0x00000001
//#define _SRCON0F_SR0F0_LENGTH                    0x00000001

//#define _SRCON0F_SR0F1_POSITION                  0x00000001
//#define _SRCON0F_SR0F1_MASK                      0x00000002
//#define _SRCON0F_SR0F1_LENGTH                    0x00000001

//#define _SRCON1F_SR1F0_POSITION                  0x00000000
//#define _SRCON1F_SR1F0_MASK                      0x00000001
//#define _SRCON1F_SR1F0_LENGTH                    0x00000001

//#define _SRCON1F_SR1F1_POSITION                  0x00000001
//#define _SRCON1F_SR1F1_MASK                      0x00000002
//#define _SRCON1F_SR1F1_LENGTH                    0x00000001

//#define _ANSELG_ANSG6_POSITION                   0x00000006
//#define _ANSELG_ANSG6_MASK                       0x00000040
//#define _ANSELG_ANSG6_LENGTH                     0x00000001

//#define _ANSELG_ANSG7_POSITION                   0x00000007
//#define _ANSELG_ANSG7_MASK                       0x00000080
//#define _ANSELG_ANSG7_LENGTH                     0x00000001

//#define _ANSELG_ANSG8_POSITION                   0x00000008
//#define _ANSELG_ANSG8_MASK                       0x00000100
//#define _ANSELG_ANSG8_LENGTH                     0x00000001

//#define _ANSELG_ANSG9_POSITION                   0x00000009
//#define _ANSELG_ANSG9_MASK                       0x00000200
//#define _ANSELG_ANSG9_LENGTH                     0x00000001

//#define _ANSELG_ANSG15_POSITION                  0x0000000F
//#define _ANSELG_ANSG15_MASK                      0x00008000
//#define _ANSELG_ANSG15_LENGTH                    0x00000001

//#define _ANSELG_w_POSITION                       0x00000000
//#define _ANSELG_w_MASK                           0xFFFFFFFF
//#define _ANSELG_w_LENGTH                         0x00000020

//#define _TRISG_TRISG0_POSITION                   0x00000000
//#define _TRISG_TRISG0_MASK                       0x00000001
//#define _TRISG_TRISG0_LENGTH                     0x00000001

//#define _TRISG_TRISG1_POSITION                   0x00000001
//#define _TRISG_TRISG1_MASK                       0x00000002
//#define _TRISG_TRISG1_LENGTH                     0x00000001

//#define _TRISG_TRISG6_POSITION                   0x00000006
//#define _TRISG_TRISG6_MASK                       0x00000040
//#define _TRISG_TRISG6_LENGTH                     0x00000001

//#define _TRISG_TRISG7_POSITION                   0x00000007
//#define _TRISG_TRISG7_MASK                       0x00000080
//#define _TRISG_TRISG7_LENGTH                     0x00000001

//#define _TRISG_TRISG8_POSITION                   0x00000008
//#define _TRISG_TRISG8_MASK                       0x00000100
//#define _TRISG_TRISG8_LENGTH                     0x00000001

