HomuraVehicle/homuraLib_v2/machine/device/p32mz2048efg100_forVC.c
//#define _TRISG_TRISG9_POSITION                   0x00000009
//#define _TRISG_TRISG9_MASK                       0x00000200
//#define _TRISG_TRISG9_LENGTH                     0x00000001

//#define _TRISG_TRISG12_POSITION                  0x0000000C
//#define _TRISG_TRISG12_MASK                      0x00001000
//#define _TRISG_TRISG12_LENGTH                    0x00000001

//#define _TRISG_TRISG13_POSITION                  0x0000000D
//#define _TRISG_TRISG13_MASK                      0x00002000
//#define _TRISG_TRISG13_LENGTH                    0x00000001

//#define _TRISG_TRISG14_POSITION                  0x0000000E
//#define _TRISG_TRISG14_MASK                      0x00004000
//#define _TRISG_TRISG14_LENGTH                    0x00000001

//#define _TRISG_TRISG15_POSITION                  0x0000000F
//#define _TRISG_TRISG15_MASK                      0x00008000
//#define _TRISG_TRISG15_LENGTH                    0x00000001

//#define _TRISG_w_POSITION                        0x00000000
//#define _TRISG_w_MASK                            0xFFFFFFFF
//#define _TRISG_w_LENGTH                          0x00000020

//#define _PORTG_RG0_POSITION                      0x00000000
//#define _PORTG_RG0_MASK                          0x00000001
//#define _PORTG_RG0_LENGTH                        0x00000001

//#define _PORTG_RG1_POSITION                      0x00000001
//#define _PORTG_RG1_MASK                          0x00000002
//#define _PORTG_RG1_LENGTH                        0x00000001

//#define _PORTG_RG6_POSITION                      0x00000006
//#define _PORTG_RG6_MASK                          0x00000040
//#define _PORTG_RG6_LENGTH                        0x00000001

//#define _PORTG_RG7_POSITION                      0x00000007
//#define _PORTG_RG7_MASK                          0x00000080
//#define _PORTG_RG7_LENGTH                        0x00000001

//#define _PORTG_RG8_POSITION                      0x00000008
//#define _PORTG_RG8_MASK                          0x00000100
//#define _PORTG_RG8_LENGTH                        0x00000001

//#define _PORTG_RG9_POSITION                      0x00000009
//#define _PORTG_RG9_MASK                          0x00000200
//#define _PORTG_RG9_LENGTH                        0x00000001

//#define _PORTG_RG12_POSITION                     0x0000000C
//#define _PORTG_RG12_MASK                         0x00001000
//#define _PORTG_RG12_LENGTH                       0x00000001

//#define _PORTG_RG13_POSITION                     0x0000000D
//#define _PORTG_RG13_MASK                         0x00002000
//#define _PORTG_RG13_LENGTH                       0x00000001

//#define _PORTG_RG14_POSITION                     0x0000000E
//#define _PORTG_RG14_MASK                         0x00004000
//#define _PORTG_RG14_LENGTH                       0x00000001

//#define _PORTG_RG15_POSITION                     0x0000000F
//#define _PORTG_RG15_MASK                         0x00008000
//#define _PORTG_RG15_LENGTH                       0x00000001

//#define _PORTG_w_POSITION                        0x00000000
//#define _PORTG_w_MASK                            0xFFFFFFFF
//#define _PORTG_w_LENGTH                          0x00000020

//#define _LATG_LATG0_POSITION                     0x00000000
//#define _LATG_LATG0_MASK                         0x00000001
//#define _LATG_LATG0_LENGTH                       0x00000001

//#define _LATG_LATG1_POSITION                     0x00000001
//#define _LATG_LATG1_MASK                         0x00000002
//#define _LATG_LATG1_LENGTH                       0x00000001

//#define _LATG_LATG6_POSITION                     0x00000006
//#define _LATG_LATG6_MASK                         0x00000040
//#define _LATG_LATG6_LENGTH                       0x00000001

//#define _LATG_LATG7_POSITION                     0x00000007
//#define _LATG_LATG7_MASK                         0x00000080
//#define _LATG_LATG7_LENGTH                       0x00000001

//#define _LATG_LATG8_POSITION                     0x00000008
//#define _LATG_LATG8_MASK                         0x00000100
//#define _LATG_LATG8_LENGTH                       0x00000001

//#define _LATG_LATG9_POSITION                     0x00000009
//#define _LATG_LATG9_MASK                         0x00000200
//#define _LATG_LATG9_LENGTH                       0x00000001

//#define _LATG_LATG12_POSITION                    0x0000000C
//#define _LATG_LATG12_MASK                        0x00001000
//#define _LATG_LATG12_LENGTH                      0x00000001

//#define _LATG_LATG13_POSITION                    0x0000000D
//#define _LATG_LATG13_MASK                        0x00002000
//#define _LATG_LATG13_LENGTH                      0x00000001

//#define _LATG_LATG14_POSITION                    0x0000000E
//#define _LATG_LATG14_MASK                        0x00004000
//#define _LATG_LATG14_LENGTH                      0x00000001

//#define _LATG_LATG15_POSITION                    0x0000000F
//#define _LATG_LATG15_MASK                        0x00008000
//#define _LATG_LATG15_LENGTH                      0x00000001

//#define _LATG_w_POSITION                         0x00000000
//#define _LATG_w_MASK                             0xFFFFFFFF
//#define _LATG_w_LENGTH                           0x00000020

//#define _ODCG_ODCG0_POSITION                     0x00000000
//#define _ODCG_ODCG0_MASK                         0x00000001
//#define _ODCG_ODCG0_LENGTH                       0x00000001

//#define _ODCG_ODCG1_POSITION                     0x00000001
//#define _ODCG_ODCG1_MASK                         0x00000002
//#define _ODCG_ODCG1_LENGTH                       0x00000001

//#define _ODCG_ODCG6_POSITION                     0x00000006
//#define _ODCG_ODCG6_MASK                         0x00000040
//#define _ODCG_ODCG6_LENGTH                       0x00000001

//#define _ODCG_ODCG7_POSITION                     0x00000007
//#define _ODCG_ODCG7_MASK                         0x00000080
//#define _ODCG_ODCG7_LENGTH                       0x00000001

//#define _ODCG_ODCG8_POSITION                     0x00000008
//#define _ODCG_ODCG8_MASK                         0x00000100
//#define _ODCG_ODCG8_LENGTH                       0x00000001

//#define _ODCG_ODCG9_POSITION                     0x00000009
//#define _ODCG_ODCG9_MASK                         0x00000200
//#define _ODCG_ODCG9_LENGTH                       0x00000001

//#define _ODCG_ODCG12_POSITION                    0x0000000C
//#define _ODCG_ODCG12_MASK                        0x00001000
//#define _ODCG_ODCG12_LENGTH                      0x00000001

//#define _ODCG_ODCG13_POSITION                    0x0000000D
//#define _ODCG_ODCG13_MASK                        0x00002000
//#define _ODCG_ODCG13_LENGTH                      0x00000001

//#define _ODCG_ODCG14_POSITION                    0x0000000E
//#define _ODCG_ODCG14_MASK                        0x00004000
//#define _ODCG_ODCG14_LENGTH                      0x00000001

//#define _ODCG_ODCG15_POSITION                    0x0000000F
//#define _ODCG_ODCG15_MASK                        0x00008000
//#define _ODCG_ODCG15_LENGTH                      0x00000001

