HomuraVehicle/homuraLib_v2/machine/device/p32mz2048efg100_forVC.c
//#define _ODCG_w_POSITION                         0x00000000
//#define _ODCG_w_MASK                             0xFFFFFFFF
//#define _ODCG_w_LENGTH                           0x00000020

//#define _CNPUG_CNPUG0_POSITION                   0x00000000
//#define _CNPUG_CNPUG0_MASK                       0x00000001
//#define _CNPUG_CNPUG0_LENGTH                     0x00000001

//#define _CNPUG_CNPUG1_POSITION                   0x00000001
//#define _CNPUG_CNPUG1_MASK                       0x00000002
//#define _CNPUG_CNPUG1_LENGTH                     0x00000001

//#define _CNPUG_CNPUG6_POSITION                   0x00000006
//#define _CNPUG_CNPUG6_MASK                       0x00000040
//#define _CNPUG_CNPUG6_LENGTH                     0x00000001

//#define _CNPUG_CNPUG7_POSITION                   0x00000007
//#define _CNPUG_CNPUG7_MASK                       0x00000080
//#define _CNPUG_CNPUG7_LENGTH                     0x00000001

//#define _CNPUG_CNPUG8_POSITION                   0x00000008
//#define _CNPUG_CNPUG8_MASK                       0x00000100
//#define _CNPUG_CNPUG8_LENGTH                     0x00000001

//#define _CNPUG_CNPUG9_POSITION                   0x00000009
//#define _CNPUG_CNPUG9_MASK                       0x00000200
//#define _CNPUG_CNPUG9_LENGTH                     0x00000001

//#define _CNPUG_CNPUG12_POSITION                  0x0000000C
//#define _CNPUG_CNPUG12_MASK                      0x00001000
//#define _CNPUG_CNPUG12_LENGTH                    0x00000001

//#define _CNPUG_CNPUG13_POSITION                  0x0000000D
//#define _CNPUG_CNPUG13_MASK                      0x00002000
//#define _CNPUG_CNPUG13_LENGTH                    0x00000001

//#define _CNPUG_CNPUG14_POSITION                  0x0000000E
//#define _CNPUG_CNPUG14_MASK                      0x00004000
//#define _CNPUG_CNPUG14_LENGTH                    0x00000001

//#define _CNPUG_CNPUG15_POSITION                  0x0000000F
//#define _CNPUG_CNPUG15_MASK                      0x00008000
//#define _CNPUG_CNPUG15_LENGTH                    0x00000001

//#define _CNPUG_w_POSITION                        0x00000000
//#define _CNPUG_w_MASK                            0xFFFFFFFF
//#define _CNPUG_w_LENGTH                          0x00000020

//#define _CNPDG_CNPDG0_POSITION                   0x00000000
//#define _CNPDG_CNPDG0_MASK                       0x00000001
//#define _CNPDG_CNPDG0_LENGTH                     0x00000001

//#define _CNPDG_CNPDG1_POSITION                   0x00000001
//#define _CNPDG_CNPDG1_MASK                       0x00000002
//#define _CNPDG_CNPDG1_LENGTH                     0x00000001

//#define _CNPDG_CNPDG6_POSITION                   0x00000006
//#define _CNPDG_CNPDG6_MASK                       0x00000040
//#define _CNPDG_CNPDG6_LENGTH                     0x00000001

//#define _CNPDG_CNPDG7_POSITION                   0x00000007
//#define _CNPDG_CNPDG7_MASK                       0x00000080
//#define _CNPDG_CNPDG7_LENGTH                     0x00000001

//#define _CNPDG_CNPDG8_POSITION                   0x00000008
//#define _CNPDG_CNPDG8_MASK                       0x00000100
//#define _CNPDG_CNPDG8_LENGTH                     0x00000001

//#define _CNPDG_CNPDG9_POSITION                   0x00000009
//#define _CNPDG_CNPDG9_MASK                       0x00000200
//#define _CNPDG_CNPDG9_LENGTH                     0x00000001

//#define _CNPDG_CNPDG12_POSITION                  0x0000000C
//#define _CNPDG_CNPDG12_MASK                      0x00001000
//#define _CNPDG_CNPDG12_LENGTH                    0x00000001

//#define _CNPDG_CNPDG13_POSITION                  0x0000000D
//#define _CNPDG_CNPDG13_MASK                      0x00002000
//#define _CNPDG_CNPDG13_LENGTH                    0x00000001

//#define _CNPDG_CNPDG14_POSITION                  0x0000000E
//#define _CNPDG_CNPDG14_MASK                      0x00004000
//#define _CNPDG_CNPDG14_LENGTH                    0x00000001

//#define _CNPDG_CNPDG15_POSITION                  0x0000000F
//#define _CNPDG_CNPDG15_MASK                      0x00008000
//#define _CNPDG_CNPDG15_LENGTH                    0x00000001

//#define _CNPDG_w_POSITION                        0x00000000
//#define _CNPDG_w_MASK                            0xFFFFFFFF
//#define _CNPDG_w_LENGTH                          0x00000020

//#define _CNCONG_EDGEDETECT_POSITION              0x0000000B
//#define _CNCONG_EDGEDETECT_MASK                  0x00000800
//#define _CNCONG_EDGEDETECT_LENGTH                0x00000001

//#define _CNCONG_SIDL_POSITION                    0x0000000D
//#define _CNCONG_SIDL_MASK                        0x00002000
//#define _CNCONG_SIDL_LENGTH                      0x00000001

//#define _CNCONG_ON_POSITION                      0x0000000F
//#define _CNCONG_ON_MASK                          0x00008000
//#define _CNCONG_ON_LENGTH                        0x00000001

//#define _CNCONG_w_POSITION                       0x00000000
//#define _CNCONG_w_MASK                           0xFFFFFFFF
//#define _CNCONG_w_LENGTH                         0x00000020

//#define _CNENG_CNIEG0_POSITION                   0x00000000
//#define _CNENG_CNIEG0_MASK                       0x00000001
//#define _CNENG_CNIEG0_LENGTH                     0x00000001

//#define _CNENG_CNIEG1_POSITION                   0x00000001
//#define _CNENG_CNIEG1_MASK                       0x00000002
//#define _CNENG_CNIEG1_LENGTH                     0x00000001

//#define _CNENG_CNIEG6_POSITION                   0x00000006
//#define _CNENG_CNIEG6_MASK                       0x00000040
//#define _CNENG_CNIEG6_LENGTH                     0x00000001

//#define _CNENG_CNIEG7_POSITION                   0x00000007
//#define _CNENG_CNIEG7_MASK                       0x00000080
//#define _CNENG_CNIEG7_LENGTH                     0x00000001

//#define _CNENG_CNIEG8_POSITION                   0x00000008
//#define _CNENG_CNIEG8_MASK                       0x00000100
//#define _CNENG_CNIEG8_LENGTH                     0x00000001

//#define _CNENG_CNIEG9_POSITION                   0x00000009
//#define _CNENG_CNIEG9_MASK                       0x00000200
//#define _CNENG_CNIEG9_LENGTH                     0x00000001

