HomuraVehicle/homuraLib_v2/machine/device/p32mz2048efg100_forVC.c
//#define _CNENG_CNIEG12_POSITION                  0x0000000C
//#define _CNENG_CNIEG12_MASK                      0x00001000
//#define _CNENG_CNIEG12_LENGTH                    0x00000001

//#define _CNENG_CNIEG13_POSITION                  0x0000000D
//#define _CNENG_CNIEG13_MASK                      0x00002000
//#define _CNENG_CNIEG13_LENGTH                    0x00000001

//#define _CNENG_CNIEG14_POSITION                  0x0000000E
//#define _CNENG_CNIEG14_MASK                      0x00004000
//#define _CNENG_CNIEG14_LENGTH                    0x00000001

//#define _CNENG_CNIEG15_POSITION                  0x0000000F
//#define _CNENG_CNIEG15_MASK                      0x00008000
//#define _CNENG_CNIEG15_LENGTH                    0x00000001

//#define _CNENG_w_POSITION                        0x00000000
//#define _CNENG_w_MASK                            0xFFFFFFFF
//#define _CNENG_w_LENGTH                          0x00000020

//#define _CNSTATG_CNSTATG0_POSITION               0x00000000
//#define _CNSTATG_CNSTATG0_MASK                   0x00000001
//#define _CNSTATG_CNSTATG0_LENGTH                 0x00000001

//#define _CNSTATG_CNSTATG1_POSITION               0x00000001
//#define _CNSTATG_CNSTATG1_MASK                   0x00000002
//#define _CNSTATG_CNSTATG1_LENGTH                 0x00000001

//#define _CNSTATG_CNSTATG6_POSITION               0x00000006
//#define _CNSTATG_CNSTATG6_MASK                   0x00000040
//#define _CNSTATG_CNSTATG6_LENGTH                 0x00000001

//#define _CNSTATG_CNSTATG7_POSITION               0x00000007
//#define _CNSTATG_CNSTATG7_MASK                   0x00000080
//#define _CNSTATG_CNSTATG7_LENGTH                 0x00000001

//#define _CNSTATG_CNSTATG8_POSITION               0x00000008
//#define _CNSTATG_CNSTATG8_MASK                   0x00000100
//#define _CNSTATG_CNSTATG8_LENGTH                 0x00000001

//#define _CNSTATG_CNSTATG9_POSITION               0x00000009
//#define _CNSTATG_CNSTATG9_MASK                   0x00000200
//#define _CNSTATG_CNSTATG9_LENGTH                 0x00000001

//#define _CNSTATG_CNSTATG12_POSITION              0x0000000C
//#define _CNSTATG_CNSTATG12_MASK                  0x00001000
//#define _CNSTATG_CNSTATG12_LENGTH                0x00000001

//#define _CNSTATG_CNSTATG13_POSITION              0x0000000D
//#define _CNSTATG_CNSTATG13_MASK                  0x00002000
//#define _CNSTATG_CNSTATG13_LENGTH                0x00000001

//#define _CNSTATG_CNSTATG14_POSITION              0x0000000E
//#define _CNSTATG_CNSTATG14_MASK                  0x00004000
//#define _CNSTATG_CNSTATG14_LENGTH                0x00000001

//#define _CNSTATG_CNSTATG15_POSITION              0x0000000F
//#define _CNSTATG_CNSTATG15_MASK                  0x00008000
//#define _CNSTATG_CNSTATG15_LENGTH                0x00000001

//#define _CNSTATG_w_POSITION                      0x00000000
//#define _CNSTATG_w_MASK                          0xFFFFFFFF
//#define _CNSTATG_w_LENGTH                        0x00000020

//#define _CNNEG_CNNEG0_POSITION                   0x00000000
//#define _CNNEG_CNNEG0_MASK                       0x00000001
//#define _CNNEG_CNNEG0_LENGTH                     0x00000001

//#define _CNNEG_CNNEG1_POSITION                   0x00000001
//#define _CNNEG_CNNEG1_MASK                       0x00000002
//#define _CNNEG_CNNEG1_LENGTH                     0x00000001

//#define _CNNEG_CNNEG6_POSITION                   0x00000006
//#define _CNNEG_CNNEG6_MASK                       0x00000040
//#define _CNNEG_CNNEG6_LENGTH                     0x00000001

//#define _CNNEG_CNNEG7_POSITION                   0x00000007
//#define _CNNEG_CNNEG7_MASK                       0x00000080
//#define _CNNEG_CNNEG7_LENGTH                     0x00000001

//#define _CNNEG_CNNEG8_POSITION                   0x00000008
//#define _CNNEG_CNNEG8_MASK                       0x00000100
//#define _CNNEG_CNNEG8_LENGTH                     0x00000001

//#define _CNNEG_CNNEG9_POSITION                   0x00000009
//#define _CNNEG_CNNEG9_MASK                       0x00000200
//#define _CNNEG_CNNEG9_LENGTH                     0x00000001

//#define _CNNEG_CNNEG12_POSITION                  0x0000000C
//#define _CNNEG_CNNEG12_MASK                      0x00001000
//#define _CNNEG_CNNEG12_LENGTH                    0x00000001

//#define _CNNEG_CNNEG13_POSITION                  0x0000000D
//#define _CNNEG_CNNEG13_MASK                      0x00002000
//#define _CNNEG_CNNEG13_LENGTH                    0x00000001

//#define _CNNEG_CNNEG14_POSITION                  0x0000000E
//#define _CNNEG_CNNEG14_MASK                      0x00004000
//#define _CNNEG_CNNEG14_LENGTH                    0x00000001

//#define _CNNEG_CNNEG15_POSITION                  0x0000000F
//#define _CNNEG_CNNEG15_MASK                      0x00008000
//#define _CNNEG_CNNEG15_LENGTH                    0x00000001

//#define _CNFG_CNFG0_POSITION                     0x00000000
//#define _CNFG_CNFG0_MASK                         0x00000001
//#define _CNFG_CNFG0_LENGTH                       0x00000001

//#define _CNFG_CNFG1_POSITION                     0x00000001
//#define _CNFG_CNFG1_MASK                         0x00000002
//#define _CNFG_CNFG1_LENGTH                       0x00000001

//#define _CNFG_CNFG6_POSITION                     0x00000006
//#define _CNFG_CNFG6_MASK                         0x00000040
//#define _CNFG_CNFG6_LENGTH                       0x00000001

//#define _CNFG_CNFG7_POSITION                     0x00000007
//#define _CNFG_CNFG7_MASK                         0x00000080
//#define _CNFG_CNFG7_LENGTH                       0x00000001

//#define _CNFG_CNFG8_POSITION                     0x00000008
//#define _CNFG_CNFG8_MASK                         0x00000100
//#define _CNFG_CNFG8_LENGTH                       0x00000001

//#define _CNFG_CNFG9_POSITION                     0x00000009
//#define _CNFG_CNFG9_MASK                         0x00000200
//#define _CNFG_CNFG9_LENGTH                       0x00000001

//#define _CNFG_CNFG12_POSITION                    0x0000000C
//#define _CNFG_CNFG12_MASK                        0x00001000
//#define _CNFG_CNFG12_LENGTH                      0x00000001

//#define _CNFG_CNFG13_POSITION                    0x0000000D
//#define _CNFG_CNFG13_MASK                        0x00002000
//#define _CNFG_CNFG13_LENGTH                      0x00000001

