HomuraVehicle/homuraLib_v2/machine/device/p32mz2048efg100_forVC.c
//#define _EMAC1CFG1_SIMRESET_POSITION             0x0000000E
//#define _EMAC1CFG1_SIMRESET_MASK                 0x00004000
//#define _EMAC1CFG1_SIMRESET_LENGTH               0x00000001

//#define _EMAC1CFG1_SOFTRESET_POSITION            0x0000000F
//#define _EMAC1CFG1_SOFTRESET_MASK                0x00008000
//#define _EMAC1CFG1_SOFTRESET_LENGTH              0x00000001

//#define _EMAC1CFG1_w_POSITION                    0x00000000
//#define _EMAC1CFG1_w_MASK                        0xFFFFFFFF
//#define _EMAC1CFG1_w_LENGTH                      0x00000020

//#define _EMACxCFG1_RXENABLE_POSITION             0x00000000
//#define _EMACxCFG1_RXENABLE_MASK                 0x00000001
//#define _EMACxCFG1_RXENABLE_LENGTH               0x00000001

//#define _EMACxCFG1_PASSALL_POSITION              0x00000001
//#define _EMACxCFG1_PASSALL_MASK                  0x00000002
//#define _EMACxCFG1_PASSALL_LENGTH                0x00000001

//#define _EMACxCFG1_RXPAUSE_POSITION              0x00000002
//#define _EMACxCFG1_RXPAUSE_MASK                  0x00000004
//#define _EMACxCFG1_RXPAUSE_LENGTH                0x00000001

//#define _EMACxCFG1_TXPAUSE_POSITION              0x00000003
//#define _EMACxCFG1_TXPAUSE_MASK                  0x00000008
//#define _EMACxCFG1_TXPAUSE_LENGTH                0x00000001

//#define _EMACxCFG1_LOOPBACK_POSITION             0x00000004
//#define _EMACxCFG1_LOOPBACK_MASK                 0x00000010
//#define _EMACxCFG1_LOOPBACK_LENGTH               0x00000001

//#define _EMACxCFG1_RESETTFUN_POSITION            0x00000008
//#define _EMACxCFG1_RESETTFUN_MASK                0x00000100
//#define _EMACxCFG1_RESETTFUN_LENGTH              0x00000001

//#define _EMACxCFG1_RESETTMCS_POSITION            0x00000009
//#define _EMACxCFG1_RESETTMCS_MASK                0x00000200
//#define _EMACxCFG1_RESETTMCS_LENGTH              0x00000001

//#define _EMACxCFG1_RESETRFUN_POSITION            0x0000000A
//#define _EMACxCFG1_RESETRFUN_MASK                0x00000400
//#define _EMACxCFG1_RESETRFUN_LENGTH              0x00000001

//#define _EMACxCFG1_RESETRMCS_POSITION            0x0000000B
//#define _EMACxCFG1_RESETRMCS_MASK                0x00000800
//#define _EMACxCFG1_RESETRMCS_LENGTH              0x00000001

//#define _EMACxCFG1_SIMRESET_POSITION             0x0000000E
//#define _EMACxCFG1_SIMRESET_MASK                 0x00004000
//#define _EMACxCFG1_SIMRESET_LENGTH               0x00000001

//#define _EMACxCFG1_SOFTRESET_POSITION            0x0000000F
//#define _EMACxCFG1_SOFTRESET_MASK                0x00008000
//#define _EMACxCFG1_SOFTRESET_LENGTH              0x00000001

//#define _EMACxCFG1_w_POSITION                    0x00000000
//#define _EMACxCFG1_w_MASK                        0xFFFFFFFF
//#define _EMACxCFG1_w_LENGTH                      0x00000020

//#define _EMAC1CFG2_FULLDPLX_POSITION             0x00000000
//#define _EMAC1CFG2_FULLDPLX_MASK                 0x00000001
//#define _EMAC1CFG2_FULLDPLX_LENGTH               0x00000001

//#define _EMAC1CFG2_LENGTHCK_POSITION             0x00000001
//#define _EMAC1CFG2_LENGTHCK_MASK                 0x00000002
//#define _EMAC1CFG2_LENGTHCK_LENGTH               0x00000001

//#define _EMAC1CFG2_HUGEFRM_POSITION              0x00000002
//#define _EMAC1CFG2_HUGEFRM_MASK                  0x00000004
//#define _EMAC1CFG2_HUGEFRM_LENGTH                0x00000001

//#define _EMAC1CFG2_DELAYCRC_POSITION             0x00000003
//#define _EMAC1CFG2_DELAYCRC_MASK                 0x00000008
//#define _EMAC1CFG2_DELAYCRC_LENGTH               0x00000001

//#define _EMAC1CFG2_CRCENABLE_POSITION            0x00000004
//#define _EMAC1CFG2_CRCENABLE_MASK                0x00000010
//#define _EMAC1CFG2_CRCENABLE_LENGTH              0x00000001

//#define _EMAC1CFG2_PADENABLE_POSITION            0x00000005
//#define _EMAC1CFG2_PADENABLE_MASK                0x00000020
//#define _EMAC1CFG2_PADENABLE_LENGTH              0x00000001

//#define _EMAC1CFG2_VLANPAD_POSITION              0x00000006
//#define _EMAC1CFG2_VLANPAD_MASK                  0x00000040
//#define _EMAC1CFG2_VLANPAD_LENGTH                0x00000001

//#define _EMAC1CFG2_AUTOPAD_POSITION              0x00000007
//#define _EMAC1CFG2_AUTOPAD_MASK                  0x00000080
//#define _EMAC1CFG2_AUTOPAD_LENGTH                0x00000001

//#define _EMAC1CFG2_PUREPRE_POSITION              0x00000008
//#define _EMAC1CFG2_PUREPRE_MASK                  0x00000100
//#define _EMAC1CFG2_PUREPRE_LENGTH                0x00000001

//#define _EMAC1CFG2_LONGPRE_POSITION              0x00000009
//#define _EMAC1CFG2_LONGPRE_MASK                  0x00000200
//#define _EMAC1CFG2_LONGPRE_LENGTH                0x00000001

//#define _EMAC1CFG2_NOBKOFF_POSITION              0x0000000C
//#define _EMAC1CFG2_NOBKOFF_MASK                  0x00001000
//#define _EMAC1CFG2_NOBKOFF_LENGTH                0x00000001

//#define _EMAC1CFG2_BPNOBKOFF_POSITION            0x0000000D
//#define _EMAC1CFG2_BPNOBKOFF_MASK                0x00002000
//#define _EMAC1CFG2_BPNOBKOFF_LENGTH              0x00000001

//#define _EMAC1CFG2_EXCESSDFR_POSITION            0x0000000E
//#define _EMAC1CFG2_EXCESSDFR_MASK                0x00004000
//#define _EMAC1CFG2_EXCESSDFR_LENGTH              0x00000001

//#define _EMAC1CFG2_w_POSITION                    0x00000000
//#define _EMAC1CFG2_w_MASK                        0xFFFFFFFF
//#define _EMAC1CFG2_w_LENGTH                      0x00000020

//#define _EMACxCFG2_FULLDPLX_POSITION             0x00000000
//#define _EMACxCFG2_FULLDPLX_MASK                 0x00000001
//#define _EMACxCFG2_FULLDPLX_LENGTH               0x00000001

//#define _EMACxCFG2_LENGTHCK_POSITION             0x00000001
//#define _EMACxCFG2_LENGTHCK_MASK                 0x00000002
//#define _EMACxCFG2_LENGTHCK_LENGTH               0x00000001

//#define _EMACxCFG2_HUGEFRM_POSITION              0x00000002
//#define _EMACxCFG2_HUGEFRM_MASK                  0x00000004
//#define _EMACxCFG2_HUGEFRM_LENGTH                0x00000001

//#define _EMACxCFG2_DELAYCRC_POSITION             0x00000003
//#define _EMACxCFG2_DELAYCRC_MASK                 0x00000008
//#define _EMACxCFG2_DELAYCRC_LENGTH               0x00000001

//#define _EMACxCFG2_CRCENABLE_POSITION            0x00000004
//#define _EMACxCFG2_CRCENABLE_MASK                0x00000010
//#define _EMACxCFG2_CRCENABLE_LENGTH              0x00000001

