HomuraVehicle/homuraLib_v2/machine/device/p32mz2048efg100_forVC.c
//#define _EMACxCFG2_PADENABLE_POSITION            0x00000005
//#define _EMACxCFG2_PADENABLE_MASK                0x00000020
//#define _EMACxCFG2_PADENABLE_LENGTH              0x00000001

//#define _EMACxCFG2_VLANPAD_POSITION              0x00000006
//#define _EMACxCFG2_VLANPAD_MASK                  0x00000040
//#define _EMACxCFG2_VLANPAD_LENGTH                0x00000001

//#define _EMACxCFG2_AUTOPAD_POSITION              0x00000007
//#define _EMACxCFG2_AUTOPAD_MASK                  0x00000080
//#define _EMACxCFG2_AUTOPAD_LENGTH                0x00000001

//#define _EMACxCFG2_PUREPRE_POSITION              0x00000008
//#define _EMACxCFG2_PUREPRE_MASK                  0x00000100
//#define _EMACxCFG2_PUREPRE_LENGTH                0x00000001

//#define _EMACxCFG2_LONGPRE_POSITION              0x00000009
//#define _EMACxCFG2_LONGPRE_MASK                  0x00000200
//#define _EMACxCFG2_LONGPRE_LENGTH                0x00000001

//#define _EMACxCFG2_NOBKOFF_POSITION              0x0000000C
//#define _EMACxCFG2_NOBKOFF_MASK                  0x00001000
//#define _EMACxCFG2_NOBKOFF_LENGTH                0x00000001

//#define _EMACxCFG2_BPNOBKOFF_POSITION            0x0000000D
//#define _EMACxCFG2_BPNOBKOFF_MASK                0x00002000
//#define _EMACxCFG2_BPNOBKOFF_LENGTH              0x00000001

//#define _EMACxCFG2_EXCESSDFR_POSITION            0x0000000E
//#define _EMACxCFG2_EXCESSDFR_MASK                0x00004000
//#define _EMACxCFG2_EXCESSDFR_LENGTH              0x00000001

//#define _EMACxCFG2_w_POSITION                    0x00000000
//#define _EMACxCFG2_w_MASK                        0xFFFFFFFF
//#define _EMACxCFG2_w_LENGTH                      0x00000020

//#define _EMAC1IPGT_B2BIPKTGP_POSITION            0x00000000
//#define _EMAC1IPGT_B2BIPKTGP_MASK                0x0000007F
//#define _EMAC1IPGT_B2BIPKTGP_LENGTH              0x00000007

//#define _EMAC1IPGT_w_POSITION                    0x00000000
//#define _EMAC1IPGT_w_MASK                        0xFFFFFFFF
//#define _EMAC1IPGT_w_LENGTH                      0x00000020

//#define _EMACxIPGT_B2BIPKTGP_POSITION            0x00000000
//#define _EMACxIPGT_B2BIPKTGP_MASK                0x0000007F
//#define _EMACxIPGT_B2BIPKTGP_LENGTH              0x00000007

//#define _EMACxIPGT_w_POSITION                    0x00000000
//#define _EMACxIPGT_w_MASK                        0xFFFFFFFF
//#define _EMACxIPGT_w_LENGTH                      0x00000020

//#define _EMAC1IPGR_NB2BIPKTGP2_POSITION          0x00000000
//#define _EMAC1IPGR_NB2BIPKTGP2_MASK              0x0000007F
//#define _EMAC1IPGR_NB2BIPKTGP2_LENGTH            0x00000007

//#define _EMAC1IPGR_NB2BIPKTGP1_POSITION          0x00000008
//#define _EMAC1IPGR_NB2BIPKTGP1_MASK              0x00007F00
//#define _EMAC1IPGR_NB2BIPKTGP1_LENGTH            0x00000007

//#define _EMAC1IPGR_w_POSITION                    0x00000000
//#define _EMAC1IPGR_w_MASK                        0xFFFFFFFF
//#define _EMAC1IPGR_w_LENGTH                      0x00000020

//#define _EMACxIPGR_NB2BIPKTGP2_POSITION          0x00000000
//#define _EMACxIPGR_NB2BIPKTGP2_MASK              0x0000007F
//#define _EMACxIPGR_NB2BIPKTGP2_LENGTH            0x00000007

//#define _EMACxIPGR_NB2BIPKTGP1_POSITION          0x00000008
//#define _EMACxIPGR_NB2BIPKTGP1_MASK              0x00007F00
//#define _EMACxIPGR_NB2BIPKTGP1_LENGTH            0x00000007

//#define _EMACxIPGR_w_POSITION                    0x00000000
//#define _EMACxIPGR_w_MASK                        0xFFFFFFFF
//#define _EMACxIPGR_w_LENGTH                      0x00000020

//#define _EMAC1CLRT_RETX_POSITION                 0x00000000
//#define _EMAC1CLRT_RETX_MASK                     0x0000000F
//#define _EMAC1CLRT_RETX_LENGTH                   0x00000004

//#define _EMAC1CLRT_CWINDOW_POSITION              0x00000008
//#define _EMAC1CLRT_CWINDOW_MASK                  0x00003F00
//#define _EMAC1CLRT_CWINDOW_LENGTH                0x00000006

//#define _EMAC1CLRT_w_POSITION                    0x00000000
//#define _EMAC1CLRT_w_MASK                        0xFFFFFFFF
//#define _EMAC1CLRT_w_LENGTH                      0x00000020

//#define _EMACxCLRT_RETX_POSITION                 0x00000000
//#define _EMACxCLRT_RETX_MASK                     0x0000000F
//#define _EMACxCLRT_RETX_LENGTH                   0x00000004

//#define _EMACxCLRT_CWINDOW_POSITION              0x00000008
//#define _EMACxCLRT_CWINDOW_MASK                  0x00003F00
//#define _EMACxCLRT_CWINDOW_LENGTH                0x00000006

//#define _EMACxCLRT_w_POSITION                    0x00000000
//#define _EMACxCLRT_w_MASK                        0xFFFFFFFF
//#define _EMACxCLRT_w_LENGTH                      0x00000020

//#define _EMAC1MAXF_MACMAXF_POSITION              0x00000000
//#define _EMAC1MAXF_MACMAXF_MASK                  0x0000FFFF
//#define _EMAC1MAXF_MACMAXF_LENGTH                0x00000010

//#define _EMAC1MAXF_w_POSITION                    0x00000000
//#define _EMAC1MAXF_w_MASK                        0xFFFFFFFF
//#define _EMAC1MAXF_w_LENGTH                      0x00000020

//#define _EMACxMAXF_MACMAXF_POSITION              0x00000000
//#define _EMACxMAXF_MACMAXF_MASK                  0x0000FFFF
//#define _EMACxMAXF_MACMAXF_LENGTH                0x00000010

//#define _EMACxMAXF_w_POSITION                    0x00000000
//#define _EMACxMAXF_w_MASK                        0xFFFFFFFF
//#define _EMACxMAXF_w_LENGTH                      0x00000020

//#define _EMAC1SUPP_SPEEDRMII_POSITION            0x00000008
//#define _EMAC1SUPP_SPEEDRMII_MASK                0x00000100
//#define _EMAC1SUPP_SPEEDRMII_LENGTH              0x00000001

//#define _EMAC1SUPP_RESETRMII_POSITION            0x0000000B
//#define _EMAC1SUPP_RESETRMII_MASK                0x00000800
//#define _EMAC1SUPP_RESETRMII_LENGTH              0x00000001

//#define _EMAC1SUPP_w_POSITION                    0x00000000
//#define _EMAC1SUPP_w_MASK                        0xFFFFFFFF
//#define _EMAC1SUPP_w_LENGTH                      0x00000020

//#define _EMACxSUPP_SPEEDRMII_POSITION            0x00000008
//#define _EMACxSUPP_SPEEDRMII_MASK                0x00000100
//#define _EMACxSUPP_SPEEDRMII_LENGTH              0x00000001

//#define _EMACxSUPP_RESETRMII_POSITION            0x0000000B
//#define _EMACxSUPP_RESETRMII_MASK                0x00000800
//#define _EMACxSUPP_RESETRMII_LENGTH              0x00000001

