HomuraVehicle/homuraLib_v2/machine/device/p32mz2048efg100_forVC.c
//#define _EMACxMWTD_MWTD_POSITION                 0x00000000
//#define _EMACxMWTD_MWTD_MASK                     0x0000FFFF
//#define _EMACxMWTD_MWTD_LENGTH                   0x00000010

//#define _EMACxMWTD_w_POSITION                    0x00000000
//#define _EMACxMWTD_w_MASK                        0xFFFFFFFF
//#define _EMACxMWTD_w_LENGTH                      0x00000020

//#define _EMAC1MRDD_MRDD_POSITION                 0x00000000
//#define _EMAC1MRDD_MRDD_MASK                     0x0000FFFF
//#define _EMAC1MRDD_MRDD_LENGTH                   0x00000010

//#define _EMAC1MRDD_w_POSITION                    0x00000000
//#define _EMAC1MRDD_w_MASK                        0xFFFFFFFF
//#define _EMAC1MRDD_w_LENGTH                      0x00000020

//#define _EMACxMRDD_MRDD_POSITION                 0x00000000
//#define _EMACxMRDD_MRDD_MASK                     0x0000FFFF
//#define _EMACxMRDD_MRDD_LENGTH                   0x00000010

//#define _EMACxMRDD_w_POSITION                    0x00000000
//#define _EMACxMRDD_w_MASK                        0xFFFFFFFF
//#define _EMACxMRDD_w_LENGTH                      0x00000020

//#define _EMAC1MIND_MIIMBUSY_POSITION             0x00000000
//#define _EMAC1MIND_MIIMBUSY_MASK                 0x00000001
//#define _EMAC1MIND_MIIMBUSY_LENGTH               0x00000001

//#define _EMAC1MIND_SCAN_POSITION                 0x00000001
//#define _EMAC1MIND_SCAN_MASK                     0x00000002
//#define _EMAC1MIND_SCAN_LENGTH                   0x00000001

//#define _EMAC1MIND_NOTVALID_POSITION             0x00000002
//#define _EMAC1MIND_NOTVALID_MASK                 0x00000004
//#define _EMAC1MIND_NOTVALID_LENGTH               0x00000001

//#define _EMAC1MIND_LINKFAIL_POSITION             0x00000003
//#define _EMAC1MIND_LINKFAIL_MASK                 0x00000008
//#define _EMAC1MIND_LINKFAIL_LENGTH               0x00000001

//#define _EMAC1MIND_w_POSITION                    0x00000000
//#define _EMAC1MIND_w_MASK                        0xFFFFFFFF
//#define _EMAC1MIND_w_LENGTH                      0x00000020

//#define _EMACxMIND_MIIMBUSY_POSITION             0x00000000
//#define _EMACxMIND_MIIMBUSY_MASK                 0x00000001
//#define _EMACxMIND_MIIMBUSY_LENGTH               0x00000001

//#define _EMACxMIND_SCAN_POSITION                 0x00000001
//#define _EMACxMIND_SCAN_MASK                     0x00000002
//#define _EMACxMIND_SCAN_LENGTH                   0x00000001

//#define _EMACxMIND_NOTVALID_POSITION             0x00000002
//#define _EMACxMIND_NOTVALID_MASK                 0x00000004
//#define _EMACxMIND_NOTVALID_LENGTH               0x00000001

//#define _EMACxMIND_LINKFAIL_POSITION             0x00000003
//#define _EMACxMIND_LINKFAIL_MASK                 0x00000008
//#define _EMACxMIND_LINKFAIL_LENGTH               0x00000001

//#define _EMACxMIND_w_POSITION                    0x00000000
//#define _EMACxMIND_w_MASK                        0xFFFFFFFF
//#define _EMACxMIND_w_LENGTH                      0x00000020

//#define _EMAC1SA0_STNADDR5_POSITION              0x00000000
//#define _EMAC1SA0_STNADDR5_MASK                  0x000000FF
//#define _EMAC1SA0_STNADDR5_LENGTH                0x00000008

//#define _EMAC1SA0_STNADDR6_POSITION              0x00000008
//#define _EMAC1SA0_STNADDR6_MASK                  0x0000FF00
//#define _EMAC1SA0_STNADDR6_LENGTH                0x00000008

//#define _EMAC1SA0_w_POSITION                     0x00000000
//#define _EMAC1SA0_w_MASK                         0xFFFFFFFF
//#define _EMAC1SA0_w_LENGTH                       0x00000020

//#define _EMACxSA0_STNADDR5_POSITION              0x00000000
//#define _EMACxSA0_STNADDR5_MASK                  0x000000FF
//#define _EMACxSA0_STNADDR5_LENGTH                0x00000008

//#define _EMACxSA0_STNADDR6_POSITION              0x00000008
//#define _EMACxSA0_STNADDR6_MASK                  0x0000FF00
//#define _EMACxSA0_STNADDR6_LENGTH                0x00000008

//#define _EMACxSA0_w_POSITION                     0x00000000
//#define _EMACxSA0_w_MASK                         0xFFFFFFFF
//#define _EMACxSA0_w_LENGTH                       0x00000020

//#define _EMAC1SA1_STNADDR3_POSITION              0x00000000
//#define _EMAC1SA1_STNADDR3_MASK                  0x000000FF
//#define _EMAC1SA1_STNADDR3_LENGTH                0x00000008

//#define _EMAC1SA1_STNADDR4_POSITION              0x00000008
//#define _EMAC1SA1_STNADDR4_MASK                  0x0000FF00
//#define _EMAC1SA1_STNADDR4_LENGTH                0x00000008

//#define _EMAC1SA1_w_POSITION                     0x00000000
//#define _EMAC1SA1_w_MASK                         0xFFFFFFFF
//#define _EMAC1SA1_w_LENGTH                       0x00000020

//#define _EMACxSA1_STNADDR3_POSITION              0x00000000
//#define _EMACxSA1_STNADDR3_MASK                  0x000000FF
//#define _EMACxSA1_STNADDR3_LENGTH                0x00000008

//#define _EMACxSA1_STNADDR4_POSITION              0x00000008
//#define _EMACxSA1_STNADDR4_MASK                  0x0000FF00
//#define _EMACxSA1_STNADDR4_LENGTH                0x00000008

//#define _EMACxSA1_w_POSITION                     0x00000000
//#define _EMACxSA1_w_MASK                         0xFFFFFFFF
//#define _EMACxSA1_w_LENGTH                       0x00000020

//#define _EMAC1SA2_STNADDR1_POSITION              0x00000000
//#define _EMAC1SA2_STNADDR1_MASK                  0x000000FF
//#define _EMAC1SA2_STNADDR1_LENGTH                0x00000008

//#define _EMAC1SA2_STNADDR2_POSITION              0x00000008
//#define _EMAC1SA2_STNADDR2_MASK                  0x0000FF00
//#define _EMAC1SA2_STNADDR2_LENGTH                0x00000008

//#define _EMAC1SA2_w_POSITION                     0x00000000
//#define _EMAC1SA2_w_MASK                         0xFFFFFFFF
//#define _EMAC1SA2_w_LENGTH                       0x00000020

//#define _EMACxSA2_STNADDR1_POSITION              0x00000000
//#define _EMACxSA2_STNADDR1_MASK                  0x000000FF
//#define _EMACxSA2_STNADDR1_LENGTH                0x00000008

//#define _EMACxSA2_STNADDR2_POSITION              0x00000008
//#define _EMACxSA2_STNADDR2_MASK                  0x0000FF00
//#define _EMACxSA2_STNADDR2_LENGTH                0x00000008

