HomuraVehicle/homuraLib_v2/machine/device/p32mz2048efg100_forVC.c
//#define _EMACxSA2_w_POSITION                     0x00000000
//#define _EMACxSA2_w_MASK                         0xFFFFFFFF
//#define _EMACxSA2_w_LENGTH                       0x00000020

//#define _USBCRCON_USBWKUPEN_POSITION             0x00000000
//#define _USBCRCON_USBWKUPEN_MASK                 0x00000001
//#define _USBCRCON_USBWKUPEN_LENGTH               0x00000001

//#define _USBCRCON_USBRIE_POSITION                0x00000001
//#define _USBCRCON_USBRIE_MASK                    0x00000002
//#define _USBCRCON_USBRIE_LENGTH                  0x00000001

//#define _USBCRCON_USBIE_POSITION                 0x00000002
//#define _USBCRCON_USBIE_MASK                     0x00000004
//#define _USBCRCON_USBIE_LENGTH                   0x00000001

//#define _USBCRCON_SENDMONEN_POSITION             0x00000003
//#define _USBCRCON_SENDMONEN_MASK                 0x00000008
//#define _USBCRCON_SENDMONEN_LENGTH               0x00000001

//#define _USBCRCON_BSVALMONEN_POSITION            0x00000004
//#define _USBCRCON_BSVALMONEN_MASK                0x00000010
//#define _USBCRCON_BSVALMONEN_LENGTH              0x00000001

//#define _USBCRCON_ASVALMONEN_POSITION            0x00000005
//#define _USBCRCON_ASVALMONEN_MASK                0x00000020
//#define _USBCRCON_ASVALMONEN_LENGTH              0x00000001

//#define _USBCRCON_VBUSMONEN_POSITION             0x00000006
//#define _USBCRCON_VBUSMONEN_MASK                 0x00000040
//#define _USBCRCON_VBUSMONEN_LENGTH               0x00000001

//#define _USBCRCON_PHYIDEN_POSITION               0x00000007
//#define _USBCRCON_PHYIDEN_MASK                   0x00000080
//#define _USBCRCON_PHYIDEN_LENGTH                 0x00000001

//#define _USBCRCON_USBIDVAL_POSITION              0x00000008
//#define _USBCRCON_USBIDVAL_MASK                  0x00000100
//#define _USBCRCON_USBIDVAL_LENGTH                0x00000001

//#define _USBCRCON_USBIDOVEN_POSITION             0x00000009
//#define _USBCRCON_USBIDOVEN_MASK                 0x00000200
//#define _USBCRCON_USBIDOVEN_LENGTH               0x00000001

//#define _USBCRCON_USBWKUP_POSITION               0x00000018
//#define _USBCRCON_USBWKUP_MASK                   0x01000000
//#define _USBCRCON_USBWKUP_LENGTH                 0x00000001

//#define _USBCRCON_USBRF_POSITION                 0x00000019
//#define _USBCRCON_USBRF_MASK                     0x02000000
//#define _USBCRCON_USBRF_LENGTH                   0x00000001

//#define _USBCRCON_USBIF_POSITION                 0x0000001A
//#define _USBCRCON_USBIF_MASK                     0x04000000
//#define _USBCRCON_USBIF_LENGTH                   0x00000001

//#define _PRECON_PFMWS_POSITION                   0x00000000
//#define _PRECON_PFMWS_MASK                       0x00000007
//#define _PRECON_PFMWS_LENGTH                     0x00000003

//#define _PRECON_PREFEN_POSITION                  0x00000004
//#define _PRECON_PREFEN_MASK                      0x00000030
//#define _PRECON_PREFEN_LENGTH                    0x00000002

//#define _PRECON_PFMSECEN_POSITION                0x0000001A
//#define _PRECON_PFMSECEN_MASK                    0x04000000
//#define _PRECON_PFMSECEN_LENGTH                  0x00000001

//#define _PRESTAT_PFMSECCNT_POSITION              0x00000000
//#define _PRESTAT_PFMSECCNT_MASK                  0x000000FF
//#define _PRESTAT_PFMSECCNT_LENGTH                0x00000008

//#define _PRESTAT_PFMSEC_POSITION                 0x0000001A
//#define _PRESTAT_PFMSEC_MASK                     0x04000000
//#define _PRESTAT_PFMSEC_LENGTH                   0x00000001

//#define _PRESTAT_PFMDED_POSITION                 0x0000001B
//#define _PRESTAT_PFMDED_MASK                     0x08000000
//#define _PRESTAT_PFMDED_LENGTH                   0x00000001

//#define _EBICS0_CSADDR_POSITION                  0x00000010
//#define _EBICS0_CSADDR_MASK                      0xFFFF0000
//#define _EBICS0_CSADDR_LENGTH                    0x00000010

//#define _EBICS1_CSADDR_POSITION                  0x00000010
//#define _EBICS1_CSADDR_MASK                      0xFFFF0000
//#define _EBICS1_CSADDR_LENGTH                    0x00000010

//#define _EBICS2_CSADDR_POSITION                  0x00000010
//#define _EBICS2_CSADDR_MASK                      0xFFFF0000
//#define _EBICS2_CSADDR_LENGTH                    0x00000010

//#define _EBICS3_CSADDR_POSITION                  0x00000010
//#define _EBICS3_CSADDR_MASK                      0xFFFF0000
//#define _EBICS3_CSADDR_LENGTH                    0x00000010

//#define _EBIMSK0_MEMSIZE_POSITION                0x00000000
//#define _EBIMSK0_MEMSIZE_MASK                    0x0000001F
//#define _EBIMSK0_MEMSIZE_LENGTH                  0x00000005

//#define _EBIMSK0_MEMTYPE_POSITION                0x00000005
//#define _EBIMSK0_MEMTYPE_MASK                    0x000000E0
//#define _EBIMSK0_MEMTYPE_LENGTH                  0x00000003

//#define _EBIMSK0_REGSEL_POSITION                 0x00000008
//#define _EBIMSK0_REGSEL_MASK                     0x00000700
//#define _EBIMSK0_REGSEL_LENGTH                   0x00000003

//#define _EBIMSK1_MEMSIZE_POSITION                0x00000000
//#define _EBIMSK1_MEMSIZE_MASK                    0x0000001F
//#define _EBIMSK1_MEMSIZE_LENGTH                  0x00000005

//#define _EBIMSK1_MEMTYPE_POSITION                0x00000005
//#define _EBIMSK1_MEMTYPE_MASK                    0x000000E0
//#define _EBIMSK1_MEMTYPE_LENGTH                  0x00000003

//#define _EBIMSK1_REGSEL_POSITION                 0x00000008
//#define _EBIMSK1_REGSEL_MASK                     0x00000700
//#define _EBIMSK1_REGSEL_LENGTH                   0x00000003

//#define _EBIMSK2_MEMSIZE_POSITION                0x00000000
//#define _EBIMSK2_MEMSIZE_MASK                    0x0000001F
//#define _EBIMSK2_MEMSIZE_LENGTH                  0x00000005

//#define _EBIMSK2_MEMTYPE_POSITION                0x00000005
//#define _EBIMSK2_MEMTYPE_MASK                    0x000000E0
//#define _EBIMSK2_MEMTYPE_LENGTH                  0x00000003

//#define _EBIMSK2_REGSEL_POSITION                 0x00000008
//#define _EBIMSK2_REGSEL_MASK                     0x00000700
//#define _EBIMSK2_REGSEL_LENGTH                   0x00000003

