HomuraVehicle/homuraLib_v2/machine/device/p32mz2048efg100_forVC.c
//#define _USBE7CSR0_DATATGGL_POSITION             0x00000018
//#define _USBE7CSR0_DATATGGL_MASK                 0x01000000
//#define _USBE7CSR0_DATATGGL_LENGTH               0x00000001

//#define _USBE7CSR0_DTWREN_POSITION               0x00000019
//#define _USBE7CSR0_DTWREN_MASK                   0x02000000
//#define _USBE7CSR0_DTWREN_LENGTH                 0x00000001

//#define _USBE7CSR0_DMAREQMD_POSITION             0x0000001A
//#define _USBE7CSR0_DMAREQMD_MASK                 0x04000000
//#define _USBE7CSR0_DMAREQMD_LENGTH               0x00000001

//#define _USBE7CSR0_FRCDATTG_POSITION             0x0000001B
//#define _USBE7CSR0_FRCDATTG_MASK                 0x08000000
//#define _USBE7CSR0_FRCDATTG_LENGTH               0x00000001

//#define _USBE7CSR0_DMAREQEN_POSITION             0x0000001C
//#define _USBE7CSR0_DMAREQEN_MASK                 0x10000000
//#define _USBE7CSR0_DMAREQEN_LENGTH               0x00000001

//#define _USBE7CSR0_MODE_POSITION                 0x0000001D
//#define _USBE7CSR0_MODE_MASK                     0x20000000
//#define _USBE7CSR0_MODE_LENGTH                   0x00000001

//#define _USBE7CSR0_AUTOSET_POSITION              0x0000001F
//#define _USBE7CSR0_AUTOSET_MASK                  0x80000000
//#define _USBE7CSR0_AUTOSET_LENGTH                0x00000001

//#define _USBE7CSR0_UNDERRUN_POSITION             0x00000012
//#define _USBE7CSR0_UNDERRUN_MASK                 0x00040000
//#define _USBE7CSR0_UNDERRUN_LENGTH               0x00000001

//#define _USBE7CSR0_SENDSTALL_POSITION            0x00000014
//#define _USBE7CSR0_SENDSTALL_MASK                0x00100000
//#define _USBE7CSR0_SENDSTALL_LENGTH              0x00000001

//#define _USBE7CSR0_SENTSTALL_POSITION            0x00000015
//#define _USBE7CSR0_SENTSTALL_MASK                0x00200000
//#define _USBE7CSR0_SENTSTALL_LENGTH              0x00000001

//#define _USBE7CSR0_INCOMPTX_POSITION             0x00000017
//#define _USBE7CSR0_INCOMPTX_MASK                 0x00800000
//#define _USBE7CSR0_INCOMPTX_LENGTH               0x00000001

//#define _USBE7CSR0_ISO_POSITION                  0x0000001E
//#define _USBE7CSR0_ISO_MASK                      0x40000000
//#define _USBE7CSR0_ISO_LENGTH                    0x00000001

//#define _USBE7CSR1_RXMAXP_POSITION               0x00000000
//#define _USBE7CSR1_RXMAXP_MASK                   0x000007FF
//#define _USBE7CSR1_RXMAXP_LENGTH                 0x0000000B

//#define _USBE7CSR1_MULT_POSITION                 0x0000000B
//#define _USBE7CSR1_MULT_MASK                     0x0000F800
//#define _USBE7CSR1_MULT_LENGTH                   0x00000005

//#define _USBE7CSR1_RXPKTRDY_POSITION             0x00000010
//#define _USBE7CSR1_RXPKTRDY_MASK                 0x00010000
//#define _USBE7CSR1_RXPKTRDY_LENGTH               0x00000001

//#define _USBE7CSR1_FIFOFULL_POSITION             0x00000011
//#define _USBE7CSR1_FIFOFULL_MASK                 0x00020000
//#define _USBE7CSR1_FIFOFULL_LENGTH               0x00000001

//#define _USBE7CSR1_ERROR_POSITION                0x00000012
//#define _USBE7CSR1_ERROR_MASK                    0x00040000
//#define _USBE7CSR1_ERROR_LENGTH                  0x00000001

//#define _USBE7CSR1_DERRNAKT_POSITION             0x00000013
//#define _USBE7CSR1_DERRNAKT_MASK                 0x00080000
//#define _USBE7CSR1_DERRNAKT_LENGTH               0x00000001

//#define _USBE7CSR1_FLUSH_POSITION                0x00000014
//#define _USBE7CSR1_FLUSH_MASK                    0x00100000
//#define _USBE7CSR1_FLUSH_LENGTH                  0x00000001

//#define _USBE7CSR1_REQPKT_POSITION               0x00000015
//#define _USBE7CSR1_REQPKT_MASK                   0x00200000
//#define _USBE7CSR1_REQPKT_LENGTH                 0x00000001

//#define _USBE7CSR1_RXSTALL_POSITION              0x00000016
//#define _USBE7CSR1_RXSTALL_MASK                  0x00400000
//#define _USBE7CSR1_RXSTALL_LENGTH                0x00000001

//#define _USBE7CSR1_CLRDT_POSITION                0x00000017
//#define _USBE7CSR1_CLRDT_MASK                    0x00800000
//#define _USBE7CSR1_CLRDT_LENGTH                  0x00000001

//#define _USBE7CSR1_INCOMPRX_POSITION             0x00000018
//#define _USBE7CSR1_INCOMPRX_MASK                 0x01000000
//#define _USBE7CSR1_INCOMPRX_LENGTH               0x00000001

//#define _USBE7CSR1_DATATGGL_POSITION             0x00000019
//#define _USBE7CSR1_DATATGGL_MASK                 0x02000000
//#define _USBE7CSR1_DATATGGL_LENGTH               0x00000001

//#define _USBE7CSR1_DATATWEN_POSITION             0x0000001A
//#define _USBE7CSR1_DATATWEN_MASK                 0x04000000
//#define _USBE7CSR1_DATATWEN_LENGTH               0x00000001

//#define _USBE7CSR1_DMAREQMD_POSITION             0x0000001B
//#define _USBE7CSR1_DMAREQMD_MASK                 0x08000000
//#define _USBE7CSR1_DMAREQMD_LENGTH               0x00000001

//#define _USBE7CSR1_PIDERR_POSITION               0x0000001C
//#define _USBE7CSR1_PIDERR_MASK                   0x10000000
//#define _USBE7CSR1_PIDERR_LENGTH                 0x00000001

//#define _USBE7CSR1_DMAREQEN_POSITION             0x0000001D
//#define _USBE7CSR1_DMAREQEN_MASK                 0x20000000
//#define _USBE7CSR1_DMAREQEN_LENGTH               0x00000001

//#define _USBE7CSR1_AUTORQ_POSITION               0x0000001E
//#define _USBE7CSR1_AUTORQ_MASK                   0x40000000
//#define _USBE7CSR1_AUTORQ_LENGTH                 0x00000001

//#define _USBE7CSR1_AUTOCLR_POSITION              0x0000001F
//#define _USBE7CSR1_AUTOCLR_MASK                  0x80000000
//#define _USBE7CSR1_AUTOCLR_LENGTH                0x00000001

//#define _USBE7CSR1_UNDERRUN_POSITION             0x00000012
//#define _USBE7CSR1_UNDERRUN_MASK                 0x00040000
//#define _USBE7CSR1_UNDERRUN_LENGTH               0x00000001

//#define _USBE7CSR1_SENDSTALL_POSITION            0x00000014
//#define _USBE7CSR1_SENDSTALL_MASK                0x00100000
//#define _USBE7CSR1_SENDSTALL_LENGTH              0x00000001

//#define _USBE7CSR1_SENTSTALL_POSITION            0x00000015
//#define _USBE7CSR1_SENTSTALL_MASK                0x00200000
//#define _USBE7CSR1_SENTSTALL_LENGTH              0x00000001

//#define _USBE7CSR1_INCOMPTX_POSITION             0x00000017
//#define _USBE7CSR1_INCOMPTX_MASK                 0x00800000
//#define _USBE7CSR1_INCOMPTX_LENGTH               0x00000001

//#define _USBE7CSR1_ISO_POSITION                  0x0000001E
//#define _USBE7CSR1_ISO_MASK                      0x40000000
//#define _USBE7CSR1_ISO_LENGTH                    0x00000001

