HomuraVehicle/homuraLib_v2/machine/device/p32mz2048efg100_forVC.c
//#define _USBDMA6N_DMACOUNT_POSITION              0x00000000
//#define _USBDMA6N_DMACOUNT_MASK                  0xFFFFFFFF
//#define _USBDMA6N_DMACOUNT_LENGTH                0x00000020

//#define _USBDMA7C_DMAEN_POSITION                 0x00000000
//#define _USBDMA7C_DMAEN_MASK                     0x00000001
//#define _USBDMA7C_DMAEN_LENGTH                   0x00000001

//#define _USBDMA7C_DMADIR_POSITION                0x00000001
//#define _USBDMA7C_DMADIR_MASK                    0x00000002
//#define _USBDMA7C_DMADIR_LENGTH                  0x00000001

//#define _USBDMA7C_DMAMODE_POSITION               0x00000002
//#define _USBDMA7C_DMAMODE_MASK                   0x00000004
//#define _USBDMA7C_DMAMODE_LENGTH                 0x00000001

//#define _USBDMA7C_DMAIE_POSITION                 0x00000003
//#define _USBDMA7C_DMAIE_MASK                     0x00000008
//#define _USBDMA7C_DMAIE_LENGTH                   0x00000001

//#define _USBDMA7C_DMAEP_POSITION                 0x00000004
//#define _USBDMA7C_DMAEP_MASK                     0x000000F0
//#define _USBDMA7C_DMAEP_LENGTH                   0x00000004

//#define _USBDMA7C_DMAERR_POSITION                0x00000008
//#define _USBDMA7C_DMAERR_MASK                    0x00000100
//#define _USBDMA7C_DMAERR_LENGTH                  0x00000001

//#define _USBDMA7C_DMABRSTM_POSITION              0x00000009
//#define _USBDMA7C_DMABRSTM_MASK                  0x00000600
//#define _USBDMA7C_DMABRSTM_LENGTH                0x00000002

//#define _USBDMA7A_DMAADDR_POSITION               0x00000000
//#define _USBDMA7A_DMAADDR_MASK                   0xFFFFFFFF
//#define _USBDMA7A_DMAADDR_LENGTH                 0x00000020

//#define _USBDMA7N_DMACOUNT_POSITION              0x00000000
//#define _USBDMA7N_DMACOUNT_MASK                  0xFFFFFFFF
//#define _USBDMA7N_DMACOUNT_LENGTH                0x00000020

//#define _USBDMA8C_DMAEN_POSITION                 0x00000000
//#define _USBDMA8C_DMAEN_MASK                     0x00000001
//#define _USBDMA8C_DMAEN_LENGTH                   0x00000001

//#define _USBDMA8C_DMADIR_POSITION                0x00000001
//#define _USBDMA8C_DMADIR_MASK                    0x00000002
//#define _USBDMA8C_DMADIR_LENGTH                  0x00000001

//#define _USBDMA8C_DMAMODE_POSITION               0x00000002
//#define _USBDMA8C_DMAMODE_MASK                   0x00000004
//#define _USBDMA8C_DMAMODE_LENGTH                 0x00000001

//#define _USBDMA8C_DMAIE_POSITION                 0x00000003
//#define _USBDMA8C_DMAIE_MASK                     0x00000008
//#define _USBDMA8C_DMAIE_LENGTH                   0x00000001

//#define _USBDMA8C_DMAEP_POSITION                 0x00000004
//#define _USBDMA8C_DMAEP_MASK                     0x000000F0
//#define _USBDMA8C_DMAEP_LENGTH                   0x00000004

//#define _USBDMA8C_DMAERR_POSITION                0x00000008
//#define _USBDMA8C_DMAERR_MASK                    0x00000100
//#define _USBDMA8C_DMAERR_LENGTH                  0x00000001

//#define _USBDMA8C_DMABRSTM_POSITION              0x00000009
//#define _USBDMA8C_DMABRSTM_MASK                  0x00000600
//#define _USBDMA8C_DMABRSTM_LENGTH                0x00000002

//#define _USBDMA8A_DMAADDR_POSITION               0x00000000
//#define _USBDMA8A_DMAADDR_MASK                   0xFFFFFFFF
//#define _USBDMA8A_DMAADDR_LENGTH                 0x00000020

//#define _USBDMA8N_DMACOUNT_POSITION              0x00000000
//#define _USBDMA8N_DMACOUNT_MASK                  0xFFFFFFFF
//#define _USBDMA8N_DMACOUNT_LENGTH                0x00000020

//#define _USBE1RPC_RQPKTCNT_POSITION              0x00000000
//#define _USBE1RPC_RQPKTCNT_MASK                  0x0000FFFF
//#define _USBE1RPC_RQPKTCNT_LENGTH                0x00000010

//#define _USBE2RPC_RQPKTCNT_POSITION              0x00000000
//#define _USBE2RPC_RQPKTCNT_MASK                  0x0000FFFF
//#define _USBE2RPC_RQPKTCNT_LENGTH                0x00000010

//#define _USBE3RPC_RQPKTCNT_POSITION              0x00000000
//#define _USBE3RPC_RQPKTCNT_MASK                  0x0000FFFF
//#define _USBE3RPC_RQPKTCNT_LENGTH                0x00000010

//#define _USBE4RPC_RQPKTCNT_POSITION              0x00000000
//#define _USBE4RPC_RQPKTCNT_MASK                  0x0000FFFF
//#define _USBE4RPC_RQPKTCNT_LENGTH                0x00000010

//#define _USBE5RPC_RQPKTCNT_POSITION              0x00000000
//#define _USBE5RPC_RQPKTCNT_MASK                  0x0000FFFF
//#define _USBE5RPC_RQPKTCNT_LENGTH                0x00000010

//#define _USBE6RPC_RQPKTCNT_POSITION              0x00000000
//#define _USBE6RPC_RQPKTCNT_MASK                  0x0000FFFF
//#define _USBE6RPC_RQPKTCNT_LENGTH                0x00000010

//#define _USBE7RPC_RQPKTCNT_POSITION              0x00000000
//#define _USBE7RPC_RQPKTCNT_MASK                  0x0000FFFF
//#define _USBE7RPC_RQPKTCNT_LENGTH                0x00000010

//#define _USBDPBFD_EP1RXD_POSITION                0x00000001
//#define _USBDPBFD_EP1RXD_MASK                    0x00000002
//#define _USBDPBFD_EP1RXD_LENGTH                  0x00000001

//#define _USBDPBFD_EP2RXD_POSITION                0x00000002
//#define _USBDPBFD_EP2RXD_MASK                    0x00000004
//#define _USBDPBFD_EP2RXD_LENGTH                  0x00000001

//#define _USBDPBFD_EP3RXD_POSITION                0x00000003
//#define _USBDPBFD_EP3RXD_MASK                    0x00000008
//#define _USBDPBFD_EP3RXD_LENGTH                  0x00000001

//#define _USBDPBFD_EP4RXD_POSITION                0x00000004
//#define _USBDPBFD_EP4RXD_MASK                    0x00000010
//#define _USBDPBFD_EP4RXD_LENGTH                  0x00000001

//#define _USBDPBFD_EP5RXD_POSITION                0x00000005
//#define _USBDPBFD_EP5RXD_MASK                    0x00000020
//#define _USBDPBFD_EP5RXD_LENGTH                  0x00000001

//#define _USBDPBFD_EP6RXD_POSITION                0x00000006
//#define _USBDPBFD_EP6RXD_MASK                    0x00000040
//#define _USBDPBFD_EP6RXD_LENGTH                  0x00000001

//#define _USBDPBFD_EP7RXD_POSITION                0x00000007
//#define _USBDPBFD_EP7RXD_MASK                    0x00000080
//#define _USBDPBFD_EP7RXD_LENGTH                  0x00000001

