HomuraVehicle/homuraLib_v2/machine/device/p32mz2048efg100_forVC.c
//#define _USBDPBFD_EP1TXD_POSITION                0x00000011
//#define _USBDPBFD_EP1TXD_MASK                    0x00020000
//#define _USBDPBFD_EP1TXD_LENGTH                  0x00000001

//#define _USBDPBFD_EP2TXD_POSITION                0x00000012
//#define _USBDPBFD_EP2TXD_MASK                    0x00040000
//#define _USBDPBFD_EP2TXD_LENGTH                  0x00000001

//#define _USBDPBFD_EP3TXD_POSITION                0x00000013
//#define _USBDPBFD_EP3TXD_MASK                    0x00080000
//#define _USBDPBFD_EP3TXD_LENGTH                  0x00000001

//#define _USBDPBFD_EP4TXD_POSITION                0x00000014
//#define _USBDPBFD_EP4TXD_MASK                    0x00100000
//#define _USBDPBFD_EP4TXD_LENGTH                  0x00000001

//#define _USBDPBFD_EP5TXD_POSITION                0x00000015
//#define _USBDPBFD_EP5TXD_MASK                    0x00200000
//#define _USBDPBFD_EP5TXD_LENGTH                  0x00000001

//#define _USBDPBFD_EP6TXD_POSITION                0x00000016
//#define _USBDPBFD_EP6TXD_MASK                    0x00400000
//#define _USBDPBFD_EP6TXD_LENGTH                  0x00000001

//#define _USBDPBFD_EP7TXD_POSITION                0x00000017
//#define _USBDPBFD_EP7TXD_MASK                    0x00800000
//#define _USBDPBFD_EP7TXD_LENGTH                  0x00000001

//#define _USBTMCON1_TUCH_POSITION                 0x00000000
//#define _USBTMCON1_TUCH_MASK                     0x0000FFFF
//#define _USBTMCON1_TUCH_LENGTH                   0x00000010

//#define _USBTMCON1_THHSRTN_POSITION              0x00000010
//#define _USBTMCON1_THHSRTN_MASK                  0xFFFF0000
//#define _USBTMCON1_THHSRTN_LENGTH                0x00000010

//#define _USBTMCON2_THSBT_POSITION                0x00000000
//#define _USBTMCON2_THSBT_MASK                    0x0000000F
//#define _USBTMCON2_THSBT_LENGTH                  0x00000004

//#define _USBLPMR1_LNKSTATE_POSITION              0x00000000
//#define _USBLPMR1_LNKSTATE_MASK                  0x0000000F
//#define _USBLPMR1_LNKSTATE_LENGTH                0x00000004

//#define _USBLPMR1_HIRD_POSITION                  0x00000004
//#define _USBLPMR1_HIRD_MASK                      0x000000F0
//#define _USBLPMR1_HIRD_LENGTH                    0x00000004

//#define _USBLPMR1_RMTWAK_POSITION                0x00000008
//#define _USBLPMR1_RMTWAK_MASK                    0x00000100
//#define _USBLPMR1_RMTWAK_LENGTH                  0x00000001

//#define _USBLPMR1_ENDPOINT_POSITION              0x0000000C
//#define _USBLPMR1_ENDPOINT_MASK                  0x0000F000
//#define _USBLPMR1_ENDPOINT_LENGTH                0x00000004

//#define _USBLPMR1_LPMXMT_POSITION                0x00000010
//#define _USBLPMR1_LPMXMT_MASK                    0x00010000
//#define _USBLPMR1_LPMXMT_LENGTH                  0x00000001

//#define _USBLPMR1_LPMRES_POSITION                0x00000011
//#define _USBLPMR1_LPMRES_MASK                    0x00020000
//#define _USBLPMR1_LPMRES_LENGTH                  0x00000001

//#define _USBLPMR1_LPMEN_POSITION                 0x00000012
//#define _USBLPMR1_LPMEN_MASK                     0x000C0000
//#define _USBLPMR1_LPMEN_LENGTH                   0x00000002

//#define _USBLPMR1_LPMNAK_POSITION                0x00000014
//#define _USBLPMR1_LPMNAK_MASK                    0x00100000
//#define _USBLPMR1_LPMNAK_LENGTH                  0x00000001

//#define _USBLPMR1_LPMTOIE_POSITION               0x00000018
//#define _USBLPMR1_LPMTOIE_MASK                   0x01000000
//#define _USBLPMR1_LPMTOIE_LENGTH                 0x00000001

//#define _USBLPMR1_LPMSTIE_POSITION               0x00000019
//#define _USBLPMR1_LPMSTIE_MASK                   0x02000000
//#define _USBLPMR1_LPMSTIE_LENGTH                 0x00000001

//#define _USBLPMR1_LPMNYIE_POSITION               0x0000001A
//#define _USBLPMR1_LPMNYIE_MASK                   0x04000000
//#define _USBLPMR1_LPMNYIE_LENGTH                 0x00000001

//#define _USBLPMR1_LPMACKIE_POSITION              0x0000001B
//#define _USBLPMR1_LPMACKIE_MASK                  0x08000000
//#define _USBLPMR1_LPMACKIE_LENGTH                0x00000001

//#define _USBLPMR1_LPMRESIE_POSITION              0x0000001C
//#define _USBLPMR1_LPMRESIE_MASK                  0x10000000
//#define _USBLPMR1_LPMRESIE_LENGTH                0x00000001

//#define _USBLPMR1_LPMERRIE_POSITION              0x0000001D
//#define _USBLPMR1_LPMERRIE_MASK                  0x20000000
//#define _USBLPMR1_LPMERRIE_LENGTH                0x00000001

//#define _USBLMPR2_LPMST_POSITION                 0x00000000
//#define _USBLMPR2_LPMST_MASK                     0x00000001
//#define _USBLMPR2_LPMST_LENGTH                   0x00000001

//#define _USBLMPR2_LPMNY_POSITION                 0x00000001
//#define _USBLMPR2_LPMNY_MASK                     0x00000002
//#define _USBLMPR2_LPMNY_LENGTH                   0x00000001

//#define _USBLMPR2_LPMACK_POSITION                0x00000002
//#define _USBLMPR2_LPMACK_MASK                    0x00000004
//#define _USBLMPR2_LPMACK_LENGTH                  0x00000001

//#define _USBLMPR2_LPMNC_POSITION                 0x00000003
//#define _USBLMPR2_LPMNC_MASK                     0x00000008
//#define _USBLMPR2_LPMNC_LENGTH                   0x00000001

//#define _USBLMPR2_LPMRES_POSITION                0x00000004
//#define _USBLMPR2_LPMRES_MASK                    0x00000010
//#define _USBLMPR2_LPMRES_LENGTH                  0x00000001

//#define _USBLMPR2_LPMERR_POSITION                0x00000005
//#define _USBLMPR2_LPMERR_MASK                    0x00000020
//#define _USBLMPR2_LPMERR_LENGTH                  0x00000001

//#define _USBLMPR2_LPMFADDR_POSITION              0x00000008
//#define _USBLMPR2_LPMFADDR_MASK                  0x00007F00
//#define _USBLMPR2_LPMFADDR_LENGTH                0x00000007

//#define _USBLPMP2_LPMST_POSITION                 0x00000000
//#define _USBLPMP2_LPMST_MASK                     0x00000001
//#define _USBLPMP2_LPMST_LENGTH                   0x00000001

//#define _USBLPMP2_LPMNY_POSITION                 0x00000001
//#define _USBLPMP2_LPMNY_MASK                     0x00000002
//#define _USBLPMP2_LPMNY_LENGTH                   0x00000001

//#define _USBLPMP2_LPMACK_POSITION                0x00000002
//#define _USBLPMP2_LPMACK_MASK                    0x00000004
//#define _USBLPMP2_LPMACK_LENGTH                  0x00000001

//#define _USBLPMP2_LPMNC_POSITION                 0x00000003
//#define _USBLPMP2_LPMNC_MASK                     0x00000008
//#define _USBLPMP2_LPMNC_LENGTH                   0x00000001

