HomuraVehicle/homuraLib_v2/machine/device/p32mz2048efg100_forVC.c
//#define _SBT0ELOG1_CMD_POSITION                  0x00000000
//#define _SBT0ELOG1_CMD_MASK                      0x00000007
//#define _SBT0ELOG1_CMD_LENGTH                    0x00000003

//#define _SBT0ELOG1_REGION_POSITION               0x00000004
//#define _SBT0ELOG1_REGION_MASK                   0x000000F0
//#define _SBT0ELOG1_REGION_LENGTH                 0x00000004

//#define _SBT0ELOG1_INITID_POSITION               0x00000008
//#define _SBT0ELOG1_INITID_MASK                   0x0000FF00
//#define _SBT0ELOG1_INITID_LENGTH                 0x00000008

//#define _SBT0ELOG1_CODE_POSITION                 0x00000018
//#define _SBT0ELOG1_CODE_MASK                     0x0F000000
//#define _SBT0ELOG1_CODE_LENGTH                   0x00000004

//#define _SBT0ELOG1_MULTI_POSITION                0x0000001F
//#define _SBT0ELOG1_MULTI_MASK                    0x80000000
//#define _SBT0ELOG1_MULTI_LENGTH                  0x00000001

//#define _SBT0ELOG2_GROUP_POSITION                0x00000000
//#define _SBT0ELOG2_GROUP_MASK                    0x00000003
//#define _SBT0ELOG2_GROUP_LENGTH                  0x00000002

//#define _SBT0ECON_ERRP_POSITION                  0x00000018
//#define _SBT0ECON_ERRP_MASK                      0x01000000
//#define _SBT0ECON_ERRP_LENGTH                    0x00000001

//#define _SBT0ECLRS_CLEAR_POSITION                0x00000000
//#define _SBT0ECLRS_CLEAR_MASK                    0x00000001
//#define _SBT0ECLRS_CLEAR_LENGTH                  0x00000001

//#define _SBT0ECLRM_CLEAR_POSITION                0x00000000
//#define _SBT0ECLRM_CLEAR_MASK                    0x00000001
//#define _SBT0ECLRM_CLEAR_LENGTH                  0x00000001

//#define _SBT0REG0_SIZE_POSITION                  0x00000003
//#define _SBT0REG0_SIZE_MASK                      0x000000F8
//#define _SBT0REG0_SIZE_LENGTH                    0x00000005

//#define _SBT0REG0_PRI_POSITION                   0x00000009
//#define _SBT0REG0_PRI_MASK                       0x00000200
//#define _SBT0REG0_PRI_LENGTH                     0x00000001

//#define _SBT0REG0_BASE_POSITION                  0x0000000A
//#define _SBT0REG0_BASE_MASK                      0xFFFFFC00
//#define _SBT0REG0_BASE_LENGTH                    0x00000016

//#define _SBT0RD0_GROUP0_POSITION                 0x00000000
//#define _SBT0RD0_GROUP0_MASK                     0x00000001
//#define _SBT0RD0_GROUP0_LENGTH                   0x00000001

//#define _SBT0RD0_GROUP1_POSITION                 0x00000001
//#define _SBT0RD0_GROUP1_MASK                     0x00000002
//#define _SBT0RD0_GROUP1_LENGTH                   0x00000001

//#define _SBT0RD0_GROUP2_POSITION                 0x00000002
//#define _SBT0RD0_GROUP2_MASK                     0x00000004
//#define _SBT0RD0_GROUP2_LENGTH                   0x00000001

//#define _SBT0RD0_GROUP3_POSITION                 0x00000003
//#define _SBT0RD0_GROUP3_MASK                     0x00000008
//#define _SBT0RD0_GROUP3_LENGTH                   0x00000001

//#define _SBT0WR0_GROUP0_POSITION                 0x00000000
//#define _SBT0WR0_GROUP0_MASK                     0x00000001
//#define _SBT0WR0_GROUP0_LENGTH                   0x00000001

//#define _SBT0WR0_GROUP1_POSITION                 0x00000001
//#define _SBT0WR0_GROUP1_MASK                     0x00000002
//#define _SBT0WR0_GROUP1_LENGTH                   0x00000001

//#define _SBT0WR0_GROUP2_POSITION                 0x00000002
//#define _SBT0WR0_GROUP2_MASK                     0x00000004
//#define _SBT0WR0_GROUP2_LENGTH                   0x00000001

//#define _SBT0WR0_GROUP3_POSITION                 0x00000003
//#define _SBT0WR0_GROUP3_MASK                     0x00000008
//#define _SBT0WR0_GROUP3_LENGTH                   0x00000001

//#define _SBT0REG1_SIZE_POSITION                  0x00000003
//#define _SBT0REG1_SIZE_MASK                      0x000000F8
//#define _SBT0REG1_SIZE_LENGTH                    0x00000005

//#define _SBT0REG1_PRI_POSITION                   0x00000009
//#define _SBT0REG1_PRI_MASK                       0x00000200
//#define _SBT0REG1_PRI_LENGTH                     0x00000001

//#define _SBT0REG1_BASE_POSITION                  0x0000000A
//#define _SBT0REG1_BASE_MASK                      0xFFFFFC00
//#define _SBT0REG1_BASE_LENGTH                    0x00000016

//#define _SBT0RD1_GROUP0_POSITION                 0x00000000
//#define _SBT0RD1_GROUP0_MASK                     0x00000001
//#define _SBT0RD1_GROUP0_LENGTH                   0x00000001

//#define _SBT0RD1_GROUP1_POSITION                 0x00000001
//#define _SBT0RD1_GROUP1_MASK                     0x00000002
//#define _SBT0RD1_GROUP1_LENGTH                   0x00000001

//#define _SBT0RD1_GROUP2_POSITION                 0x00000002
//#define _SBT0RD1_GROUP2_MASK                     0x00000004
//#define _SBT0RD1_GROUP2_LENGTH                   0x00000001

//#define _SBT0RD1_GROUP3_POSITION                 0x00000003
//#define _SBT0RD1_GROUP3_MASK                     0x00000008
//#define _SBT0RD1_GROUP3_LENGTH                   0x00000001

//#define _SBT0WR1_GROUP0_POSITION                 0x00000000
//#define _SBT0WR1_GROUP0_MASK                     0x00000001
//#define _SBT0WR1_GROUP0_LENGTH                   0x00000001

//#define _SBT0WR1_GROUP1_POSITION                 0x00000001
//#define _SBT0WR1_GROUP1_MASK                     0x00000002
//#define _SBT0WR1_GROUP1_LENGTH                   0x00000001

//#define _SBT0WR1_GROUP2_POSITION                 0x00000002
//#define _SBT0WR1_GROUP2_MASK                     0x00000004
//#define _SBT0WR1_GROUP2_LENGTH                   0x00000001

//#define _SBT0WR1_GROUP3_POSITION                 0x00000003
//#define _SBT0WR1_GROUP3_MASK                     0x00000008
//#define _SBT0WR1_GROUP3_LENGTH                   0x00000001

//#define _SBT1ELOG1_CMD_POSITION                  0x00000000
//#define _SBT1ELOG1_CMD_MASK                      0x00000007
//#define _SBT1ELOG1_CMD_LENGTH                    0x00000003

//#define _SBT1ELOG1_REGION_POSITION               0x00000004
//#define _SBT1ELOG1_REGION_MASK                   0x000000F0
//#define _SBT1ELOG1_REGION_LENGTH                 0x00000004

//#define _SBT1ELOG1_INITID_POSITION               0x00000008
//#define _SBT1ELOG1_INITID_MASK                   0x0000FF00
//#define _SBT1ELOG1_INITID_LENGTH                 0x00000008

//#define _SBT1ELOG1_CODE_POSITION                 0x00000018
//#define _SBT1ELOG1_CODE_MASK                     0x0F000000
//#define _SBT1ELOG1_CODE_LENGTH                   0x00000004

//#define _SBT1ELOG1_MULTI_POSITION                0x0000001F
//#define _SBT1ELOG1_MULTI_MASK                    0x80000000
//#define _SBT1ELOG1_MULTI_LENGTH                  0x00000001

//#define _SBT1ELOG2_GROUP_POSITION                0x00000000
//#define _SBT1ELOG2_GROUP_MASK                    0x00000003
//#define _SBT1ELOG2_GROUP_LENGTH                  0x00000002

//#define _SBT1ECON_ERRP_POSITION                  0x00000018
//#define _SBT1ECON_ERRP_MASK                      0x01000000
//#define _SBT1ECON_ERRP_LENGTH                    0x00000001

//#define _SBT1ECLRS_CLEAR_POSITION                0x00000000
//#define _SBT1ECLRS_CLEAR_MASK                    0x00000001
//#define _SBT1ECLRS_CLEAR_LENGTH                  0x00000001

//#define _SBT1ECLRM_CLEAR_POSITION                0x00000000
//#define _SBT1ECLRM_CLEAR_MASK                    0x00000001
//#define _SBT1ECLRM_CLEAR_LENGTH                  0x00000001

