HomuraVehicle/homuraLib_v2/machine/device/p32mz2048efg100_forVC.c
//#define _SBT1RD4_GROUP2_POSITION                 0x00000002
//#define _SBT1RD4_GROUP2_MASK                     0x00000004
//#define _SBT1RD4_GROUP2_LENGTH                   0x00000001

//#define _SBT1RD4_GROUP3_POSITION                 0x00000003
//#define _SBT1RD4_GROUP3_MASK                     0x00000008
//#define _SBT1RD4_GROUP3_LENGTH                   0x00000001

//#define _SBT1WR4_GROUP0_POSITION                 0x00000000
//#define _SBT1WR4_GROUP0_MASK                     0x00000001
//#define _SBT1WR4_GROUP0_LENGTH                   0x00000001

//#define _SBT1WR4_GROUP1_POSITION                 0x00000001
//#define _SBT1WR4_GROUP1_MASK                     0x00000002
//#define _SBT1WR4_GROUP1_LENGTH                   0x00000001

//#define _SBT1WR4_GROUP2_POSITION                 0x00000002
//#define _SBT1WR4_GROUP2_MASK                     0x00000004
//#define _SBT1WR4_GROUP2_LENGTH                   0x00000001

//#define _SBT1WR4_GROUP3_POSITION                 0x00000003
//#define _SBT1WR4_GROUP3_MASK                     0x00000008
//#define _SBT1WR4_GROUP3_LENGTH                   0x00000001

//#define _SBT1REG5_SIZE_POSITION                  0x00000003
//#define _SBT1REG5_SIZE_MASK                      0x000000F8
//#define _SBT1REG5_SIZE_LENGTH                    0x00000005

//#define _SBT1REG5_PRI_POSITION                   0x00000009
//#define _SBT1REG5_PRI_MASK                       0x00000200
//#define _SBT1REG5_PRI_LENGTH                     0x00000001

//#define _SBT1REG5_BASE_POSITION                  0x0000000A
//#define _SBT1REG5_BASE_MASK                      0xFFFFFC00
//#define _SBT1REG5_BASE_LENGTH                    0x00000016

//#define _SBT1RD5_GROUP0_POSITION                 0x00000000
//#define _SBT1RD5_GROUP0_MASK                     0x00000001
//#define _SBT1RD5_GROUP0_LENGTH                   0x00000001

//#define _SBT1RD5_GROUP1_POSITION                 0x00000001
//#define _SBT1RD5_GROUP1_MASK                     0x00000002
//#define _SBT1RD5_GROUP1_LENGTH                   0x00000001

//#define _SBT1RD5_GROUP2_POSITION                 0x00000002
//#define _SBT1RD5_GROUP2_MASK                     0x00000004
//#define _SBT1RD5_GROUP2_LENGTH                   0x00000001

//#define _SBT1RD5_GROUP3_POSITION                 0x00000003
//#define _SBT1RD5_GROUP3_MASK                     0x00000008
//#define _SBT1RD5_GROUP3_LENGTH                   0x00000001

//#define _SBT1WR5_GROUP0_POSITION                 0x00000000
//#define _SBT1WR5_GROUP0_MASK                     0x00000001
//#define _SBT1WR5_GROUP0_LENGTH                   0x00000001

//#define _SBT1WR5_GROUP1_POSITION                 0x00000001
//#define _SBT1WR5_GROUP1_MASK                     0x00000002
//#define _SBT1WR5_GROUP1_LENGTH                   0x00000001

//#define _SBT1WR5_GROUP2_POSITION                 0x00000002
//#define _SBT1WR5_GROUP2_MASK                     0x00000004
//#define _SBT1WR5_GROUP2_LENGTH                   0x00000001

//#define _SBT1WR5_GROUP3_POSITION                 0x00000003
//#define _SBT1WR5_GROUP3_MASK                     0x00000008
//#define _SBT1WR5_GROUP3_LENGTH                   0x00000001

//#define _SBT1REG6_SIZE_POSITION                  0x00000003
//#define _SBT1REG6_SIZE_MASK                      0x000000F8
//#define _SBT1REG6_SIZE_LENGTH                    0x00000005

//#define _SBT1REG6_PRI_POSITION                   0x00000009
//#define _SBT1REG6_PRI_MASK                       0x00000200
//#define _SBT1REG6_PRI_LENGTH                     0x00000001

//#define _SBT1REG6_BASE_POSITION                  0x0000000A
//#define _SBT1REG6_BASE_MASK                      0xFFFFFC00
//#define _SBT1REG6_BASE_LENGTH                    0x00000016

//#define _SBT1RD6_GROUP0_POSITION                 0x00000000
//#define _SBT1RD6_GROUP0_MASK                     0x00000001
//#define _SBT1RD6_GROUP0_LENGTH                   0x00000001

//#define _SBT1RD6_GROUP1_POSITION                 0x00000001
//#define _SBT1RD6_GROUP1_MASK                     0x00000002
//#define _SBT1RD6_GROUP1_LENGTH                   0x00000001

//#define _SBT1RD6_GROUP2_POSITION                 0x00000002
//#define _SBT1RD6_GROUP2_MASK                     0x00000004
//#define _SBT1RD6_GROUP2_LENGTH                   0x00000001

//#define _SBT1RD6_GROUP3_POSITION                 0x00000003
//#define _SBT1RD6_GROUP3_MASK                     0x00000008
//#define _SBT1RD6_GROUP3_LENGTH                   0x00000001

//#define _SBT1WR6_GROUP0_POSITION                 0x00000000
//#define _SBT1WR6_GROUP0_MASK                     0x00000001
//#define _SBT1WR6_GROUP0_LENGTH                   0x00000001

//#define _SBT1WR6_GROUP1_POSITION                 0x00000001
//#define _SBT1WR6_GROUP1_MASK                     0x00000002
//#define _SBT1WR6_GROUP1_LENGTH                   0x00000001

//#define _SBT1WR6_GROUP2_POSITION                 0x00000002
//#define _SBT1WR6_GROUP2_MASK                     0x00000004
//#define _SBT1WR6_GROUP2_LENGTH                   0x00000001

//#define _SBT1WR6_GROUP3_POSITION                 0x00000003
//#define _SBT1WR6_GROUP3_MASK                     0x00000008
//#define _SBT1WR6_GROUP3_LENGTH                   0x00000001

//#define _SBT1REG7_SIZE_POSITION                  0x00000003
//#define _SBT1REG7_SIZE_MASK                      0x000000F8
//#define _SBT1REG7_SIZE_LENGTH                    0x00000005

//#define _SBT1REG7_PRI_POSITION                   0x00000009
//#define _SBT1REG7_PRI_MASK                       0x00000200
//#define _SBT1REG7_PRI_LENGTH                     0x00000001

//#define _SBT1REG7_BASE_POSITION                  0x0000000A
//#define _SBT1REG7_BASE_MASK                      0xFFFFFC00
//#define _SBT1REG7_BASE_LENGTH                    0x00000016

//#define _SBT1RD7_GROUP0_POSITION                 0x00000000
//#define _SBT1RD7_GROUP0_MASK                     0x00000001
//#define _SBT1RD7_GROUP0_LENGTH                   0x00000001

//#define _SBT1RD7_GROUP1_POSITION                 0x00000001
//#define _SBT1RD7_GROUP1_MASK                     0x00000002
//#define _SBT1RD7_GROUP1_LENGTH                   0x00000001

//#define _SBT1RD7_GROUP2_POSITION                 0x00000002
//#define _SBT1RD7_GROUP2_MASK                     0x00000004
//#define _SBT1RD7_GROUP2_LENGTH                   0x00000001

//#define _SBT1RD7_GROUP3_POSITION                 0x00000003
//#define _SBT1RD7_GROUP3_MASK                     0x00000008
//#define _SBT1RD7_GROUP3_LENGTH                   0x00000001

//#define _SBT1WR7_GROUP0_POSITION                 0x00000000
//#define _SBT1WR7_GROUP0_MASK                     0x00000001
//#define _SBT1WR7_GROUP0_LENGTH                   0x00000001

//#define _SBT1WR7_GROUP1_POSITION                 0x00000001
//#define _SBT1WR7_GROUP1_MASK                     0x00000002
//#define _SBT1WR7_GROUP1_LENGTH                   0x00000001

