HomuraVehicle/homuraLib_v2/machine/device/p32mz2048efg100_forVC.c
//#define _SBT13ELOG1_CMD_POSITION                 0x00000000
//#define _SBT13ELOG1_CMD_MASK                     0x00000007
//#define _SBT13ELOG1_CMD_LENGTH                   0x00000003

//#define _SBT13ELOG1_REGION_POSITION              0x00000004
//#define _SBT13ELOG1_REGION_MASK                  0x000000F0
//#define _SBT13ELOG1_REGION_LENGTH                0x00000004

//#define _SBT13ELOG1_INITID_POSITION              0x00000008
//#define _SBT13ELOG1_INITID_MASK                  0x0000FF00
//#define _SBT13ELOG1_INITID_LENGTH                0x00000008

//#define _SBT13ELOG1_CODE_POSITION                0x00000018
//#define _SBT13ELOG1_CODE_MASK                    0x0F000000
//#define _SBT13ELOG1_CODE_LENGTH                  0x00000004

//#define _SBT13ELOG1_MULTI_POSITION               0x0000001F
//#define _SBT13ELOG1_MULTI_MASK                   0x80000000
//#define _SBT13ELOG1_MULTI_LENGTH                 0x00000001

//#define _SBT13ELOG2_GROUP_POSITION               0x00000000
//#define _SBT13ELOG2_GROUP_MASK                   0x00000003
//#define _SBT13ELOG2_GROUP_LENGTH                 0x00000002

//#define _SBT13ECON_ERRP_POSITION                 0x00000018
//#define _SBT13ECON_ERRP_MASK                     0x01000000
//#define _SBT13ECON_ERRP_LENGTH                   0x00000001

//#define _SBT13ECLRS_CLEAR_POSITION               0x00000000
//#define _SBT13ECLRS_CLEAR_MASK                   0x00000001
//#define _SBT13ECLRS_CLEAR_LENGTH                 0x00000001

//#define _SBT13ECLRM_CLEAR_POSITION               0x00000000
//#define _SBT13ECLRM_CLEAR_MASK                   0x00000001
//#define _SBT13ECLRM_CLEAR_LENGTH                 0x00000001

//#define _SBT13REG0_SIZE_POSITION                 0x00000003
//#define _SBT13REG0_SIZE_MASK                     0x000000F8
//#define _SBT13REG0_SIZE_LENGTH                   0x00000005

//#define _SBT13REG0_PRI_POSITION                  0x00000009
//#define _SBT13REG0_PRI_MASK                      0x00000200
//#define _SBT13REG0_PRI_LENGTH                    0x00000001

//#define _SBT13REG0_BASE_POSITION                 0x0000000A
//#define _SBT13REG0_BASE_MASK                     0xFFFFFC00
//#define _SBT13REG0_BASE_LENGTH                   0x00000016

//#define _SBT13RD0_GROUP0_POSITION                0x00000000
//#define _SBT13RD0_GROUP0_MASK                    0x00000001
//#define _SBT13RD0_GROUP0_LENGTH                  0x00000001

//#define _SBT13RD0_GROUP1_POSITION                0x00000001
//#define _SBT13RD0_GROUP1_MASK                    0x00000002
//#define _SBT13RD0_GROUP1_LENGTH                  0x00000001

//#define _SBT13RD0_GROUP2_POSITION                0x00000002
//#define _SBT13RD0_GROUP2_MASK                    0x00000004
//#define _SBT13RD0_GROUP2_LENGTH                  0x00000001

//#define _SBT13RD0_GROUP3_POSITION                0x00000003
//#define _SBT13RD0_GROUP3_MASK                    0x00000008
//#define _SBT13RD0_GROUP3_LENGTH                  0x00000001

//#define _SBT13WR0_GROUP0_POSITION                0x00000000
//#define _SBT13WR0_GROUP0_MASK                    0x00000001
//#define _SBT13WR0_GROUP0_LENGTH                  0x00000001

//#define _SBT13WR0_GROUP1_POSITION                0x00000001
//#define _SBT13WR0_GROUP1_MASK                    0x00000002
//#define _SBT13WR0_GROUP1_LENGTH                  0x00000001

//#define _SBT13WR0_GROUP2_POSITION                0x00000002
//#define _SBT13WR0_GROUP2_MASK                    0x00000004
//#define _SBT13WR0_GROUP2_LENGTH                  0x00000001

//#define _SBT13WR0_GROUP3_POSITION                0x00000003
//#define _SBT13WR0_GROUP3_MASK                    0x00000008
//#define _SBT13WR0_GROUP3_LENGTH                  0x00000001

//#define _DEVCFG3_USERID_POSITION                 0x00000000
//#define _DEVCFG3_USERID_MASK                     0x0000FFFF
//#define _DEVCFG3_USERID_LENGTH                   0x00000010

//#define _DEVCFG3_FMIIEN_POSITION                 0x00000018
//#define _DEVCFG3_FMIIEN_MASK                     0x01000000
//#define _DEVCFG3_FMIIEN_LENGTH                   0x00000001

//#define _DEVCFG3_FETHIO_POSITION                 0x00000019
//#define _DEVCFG3_FETHIO_MASK                     0x02000000
//#define _DEVCFG3_FETHIO_LENGTH                   0x00000001

//#define _DEVCFG3_PGL1WAY_POSITION                0x0000001B
//#define _DEVCFG3_PGL1WAY_MASK                    0x08000000
//#define _DEVCFG3_PGL1WAY_LENGTH                  0x00000001

//#define _DEVCFG3_PMDL1WAY_POSITION               0x0000001C
//#define _DEVCFG3_PMDL1WAY_MASK                   0x10000000
//#define _DEVCFG3_PMDL1WAY_LENGTH                 0x00000001

//#define _DEVCFG3_IOL1WAY_POSITION                0x0000001D
//#define _DEVCFG3_IOL1WAY_MASK                    0x20000000
//#define _DEVCFG3_IOL1WAY_LENGTH                  0x00000001

//#define _DEVCFG3_FUSBIDIO_POSITION               0x0000001E
//#define _DEVCFG3_FUSBIDIO_MASK                   0x40000000
//#define _DEVCFG3_FUSBIDIO_LENGTH                 0x00000001

//#define _DEVCFG3_w_POSITION                      0x00000000
//#define _DEVCFG3_w_MASK                          0xFFFFFFFF
//#define _DEVCFG3_w_LENGTH                        0x00000020

//#define _DEVCFG2_FPLLIDIV_POSITION               0x00000000
//#define _DEVCFG2_FPLLIDIV_MASK                   0x00000007
//#define _DEVCFG2_FPLLIDIV_LENGTH                 0x00000003

//#define _DEVCFG2_FPLLRNG_POSITION                0x00000004
//#define _DEVCFG2_FPLLRNG_MASK                    0x00000070
//#define _DEVCFG2_FPLLRNG_LENGTH                  0x00000003

//#define _DEVCFG2_FPLLICLK_POSITION               0x00000007
//#define _DEVCFG2_FPLLICLK_MASK                   0x00000080
//#define _DEVCFG2_FPLLICLK_LENGTH                 0x00000001

//#define _DEVCFG2_FPLLMULT_POSITION               0x00000008
//#define _DEVCFG2_FPLLMULT_MASK                   0x00007F00
//#define _DEVCFG2_FPLLMULT_LENGTH                 0x00000007

//#define _DEVCFG2_FPLLODIV_POSITION               0x00000010
//#define _DEVCFG2_FPLLODIV_MASK                   0x00070000
//#define _DEVCFG2_FPLLODIV_LENGTH                 0x00000003

