HomuraVehicle/homuraLib_v2/machine/device/p32mz2048efg100_forVC.c
//#define _ADEVCFG0_DEBUG_POSITION                 0x00000000
//#define _ADEVCFG0_DEBUG_MASK                     0x00000003
//#define _ADEVCFG0_DEBUG_LENGTH                   0x00000002

//#define _ADEVCFG0_JTAGEN_POSITION                0x00000002
//#define _ADEVCFG0_JTAGEN_MASK                    0x00000004
//#define _ADEVCFG0_JTAGEN_LENGTH                  0x00000001

//#define _ADEVCFG0_ICESEL_POSITION                0x00000003
//#define _ADEVCFG0_ICESEL_MASK                    0x00000018
//#define _ADEVCFG0_ICESEL_LENGTH                  0x00000002

//#define _ADEVCFG0_TRCEN_POSITION                 0x00000005
//#define _ADEVCFG0_TRCEN_MASK                     0x00000020
//#define _ADEVCFG0_TRCEN_LENGTH                   0x00000001

//#define _ADEVCFG0_BOOTISA_POSITION               0x00000006
//#define _ADEVCFG0_BOOTISA_MASK                   0x00000040
//#define _ADEVCFG0_BOOTISA_LENGTH                 0x00000001

//#define _ADEVCFG0_FECCCON_POSITION               0x00000008
//#define _ADEVCFG0_FECCCON_MASK                   0x00000300
//#define _ADEVCFG0_FECCCON_LENGTH                 0x00000002

//#define _ADEVCFG0_FSLEEP_POSITION                0x0000000A
//#define _ADEVCFG0_FSLEEP_MASK                    0x00000400
//#define _ADEVCFG0_FSLEEP_LENGTH                  0x00000001

//#define _ADEVCFG0_DBGPER_POSITION                0x0000000C
//#define _ADEVCFG0_DBGPER_MASK                    0x00007000
//#define _ADEVCFG0_DBGPER_LENGTH                  0x00000003

//#define _ADEVCFG0_SMCLR_POSITION                 0x0000000F
//#define _ADEVCFG0_SMCLR_MASK                     0x00008000
//#define _ADEVCFG0_SMCLR_LENGTH                   0x00000001

//#define _ADEVCFG0_SOSCGAIN_POSITION              0x00000010
//#define _ADEVCFG0_SOSCGAIN_MASK                  0x00030000
//#define _ADEVCFG0_SOSCGAIN_LENGTH                0x00000002

//#define _ADEVCFG0_SOSCBOOST_POSITION             0x00000012
//#define _ADEVCFG0_SOSCBOOST_MASK                 0x00040000
//#define _ADEVCFG0_SOSCBOOST_LENGTH               0x00000001

//#define _ADEVCFG0_POSCGAIN_POSITION              0x00000013
//#define _ADEVCFG0_POSCGAIN_MASK                  0x00180000
//#define _ADEVCFG0_POSCGAIN_LENGTH                0x00000002

//#define _ADEVCFG0_POSCBOOST_POSITION             0x00000015
//#define _ADEVCFG0_POSCBOOST_MASK                 0x00200000
//#define _ADEVCFG0_POSCBOOST_LENGTH               0x00000001

//#define _ADEVCFG0_EJTAGBEN_POSITION              0x0000001E
//#define _ADEVCFG0_EJTAGBEN_MASK                  0x40000000
//#define _ADEVCFG0_EJTAGBEN_LENGTH                0x00000001

//#define _ADEVCFG0_FDEBUG_POSITION                0x00000000
//#define _ADEVCFG0_FDEBUG_MASK                    0x00000003
//#define _ADEVCFG0_FDEBUG_LENGTH                  0x00000002

//#define _ADEVCFG0_w_POSITION                     0x00000000
//#define _ADEVCFG0_w_MASK                         0xFFFFFFFF
//#define _ADEVCFG0_w_LENGTH                       0x00000020

//#define _ADEVCP0_CP_POSITION                     0x0000001C
//#define _ADEVCP0_CP_MASK                         0x10000000
//#define _ADEVCP0_CP_LENGTH                       0x00000001

//#define _ADEVCP0_w_POSITION                      0x00000000
//#define _ADEVCP0_w_MASK                          0xFFFFFFFF
//#define _ADEVCP0_w_LENGTH                        0x00000020

//#define _ASEQ0_TSEQ_POSITION                     0x00000000
//#define _ASEQ0_TSEQ_MASK                         0x0000FFFF
//#define _ASEQ0_TSEQ_LENGTH                       0x00000010

//#define _ASEQ0_CSEQ_POSITION                     0x00000010
//#define _ASEQ0_CSEQ_MASK                         0xFFFF0000
//#define _ASEQ0_CSEQ_LENGTH                       0x00000010

//#define _ASEQ0_w_POSITION                        0x00000000
//#define _ASEQ0_w_MASK                            0xFFFFFFFF
//#define _ASEQ0_w_LENGTH                          0x00000020

//#define _AUBADEVCFG3_USERID_POSITION             0x00000000
//#define _AUBADEVCFG3_USERID_MASK                 0x0000FFFF
//#define _AUBADEVCFG3_USERID_LENGTH               0x00000010

//#define _AUBADEVCFG3_FMIIEN_POSITION             0x00000018
//#define _AUBADEVCFG3_FMIIEN_MASK                 0x01000000
//#define _AUBADEVCFG3_FMIIEN_LENGTH               0x00000001

//#define _AUBADEVCFG3_FETHIO_POSITION             0x00000019
//#define _AUBADEVCFG3_FETHIO_MASK                 0x02000000
//#define _AUBADEVCFG3_FETHIO_LENGTH               0x00000001

//#define _AUBADEVCFG3_PGL1WAY_POSITION            0x0000001B
//#define _AUBADEVCFG3_PGL1WAY_MASK                0x08000000
//#define _AUBADEVCFG3_PGL1WAY_LENGTH              0x00000001

//#define _AUBADEVCFG3_PMDL1WAY_POSITION           0x0000001C
//#define _AUBADEVCFG3_PMDL1WAY_MASK               0x10000000
//#define _AUBADEVCFG3_PMDL1WAY_LENGTH             0x00000001

//#define _AUBADEVCFG3_IOL1WAY_POSITION            0x0000001D
//#define _AUBADEVCFG3_IOL1WAY_MASK                0x20000000
//#define _AUBADEVCFG3_IOL1WAY_LENGTH              0x00000001

//#define _AUBADEVCFG3_FUSBIDIO_POSITION           0x0000001E
//#define _AUBADEVCFG3_FUSBIDIO_MASK               0x40000000
//#define _AUBADEVCFG3_FUSBIDIO_LENGTH             0x00000001

//#define _AUBADEVCFG3_w_POSITION                  0x00000000
//#define _AUBADEVCFG3_w_MASK                      0xFFFFFFFF
//#define _AUBADEVCFG3_w_LENGTH                    0x00000020

//#define _AUBADEVCFG2_FPLLIDIV_POSITION           0x00000000
//#define _AUBADEVCFG2_FPLLIDIV_MASK               0x00000007
//#define _AUBADEVCFG2_FPLLIDIV_LENGTH             0x00000003

//#define _AUBADEVCFG2_FPLLRNG_POSITION            0x00000004
//#define _AUBADEVCFG2_FPLLRNG_MASK                0x00000070
//#define _AUBADEVCFG2_FPLLRNG_LENGTH              0x00000003

//#define _AUBADEVCFG2_FPLLICLK_POSITION           0x00000007
//#define _AUBADEVCFG2_FPLLICLK_MASK               0x00000080
//#define _AUBADEVCFG2_FPLLICLK_LENGTH             0x00000001

//#define _AUBADEVCFG2_FPLLMULT_POSITION           0x00000008
//#define _AUBADEVCFG2_FPLLMULT_MASK               0x00007F00
//#define _AUBADEVCFG2_FPLLMULT_LENGTH             0x00000007

//#define _AUBADEVCFG2_FPLLODIV_POSITION           0x00000010
//#define _AUBADEVCFG2_FPLLODIV_MASK               0x00070000
//#define _AUBADEVCFG2_FPLLODIV_LENGTH             0x00000003

//#define _AUBADEVCFG2_UPLLFSEL_POSITION           0x0000001E
//#define _AUBADEVCFG2_UPLLFSEL_MASK               0x40000000
//#define _AUBADEVCFG2_UPLLFSEL_LENGTH             0x00000001

