HomuraVehicle/homuraLib_v2/machine/device/p32mz2048efg100_forVC.c
//#define _AUBADEVCFG2_w_POSITION                  0x00000000
//#define _AUBADEVCFG2_w_MASK                      0xFFFFFFFF
//#define _AUBADEVCFG2_w_LENGTH                    0x00000020

//#define _AUBADEVCFG1_FNOSC_POSITION              0x00000000
//#define _AUBADEVCFG1_FNOSC_MASK                  0x00000007
//#define _AUBADEVCFG1_FNOSC_LENGTH                0x00000003

//#define _AUBADEVCFG1_DMTINTV_POSITION            0x00000003
//#define _AUBADEVCFG1_DMTINTV_MASK                0x00000038
//#define _AUBADEVCFG1_DMTINTV_LENGTH              0x00000003

//#define _AUBADEVCFG1_FSOSCEN_POSITION            0x00000006
//#define _AUBADEVCFG1_FSOSCEN_MASK                0x00000040
//#define _AUBADEVCFG1_FSOSCEN_LENGTH              0x00000001

//#define _AUBADEVCFG1_IESO_POSITION               0x00000007
//#define _AUBADEVCFG1_IESO_MASK                   0x00000080
//#define _AUBADEVCFG1_IESO_LENGTH                 0x00000001

//#define _AUBADEVCFG1_POSCMOD_POSITION            0x00000008
//#define _AUBADEVCFG1_POSCMOD_MASK                0x00000300
//#define _AUBADEVCFG1_POSCMOD_LENGTH              0x00000002

//#define _AUBADEVCFG1_OSCIOFNC_POSITION           0x0000000A
//#define _AUBADEVCFG1_OSCIOFNC_MASK               0x00000400
//#define _AUBADEVCFG1_OSCIOFNC_LENGTH             0x00000001

//#define _AUBADEVCFG1_FCKSM_POSITION              0x0000000E
//#define _AUBADEVCFG1_FCKSM_MASK                  0x0000C000
//#define _AUBADEVCFG1_FCKSM_LENGTH                0x00000002

//#define _AUBADEVCFG1_WDTPS_POSITION              0x00000010
//#define _AUBADEVCFG1_WDTPS_MASK                  0x001F0000
//#define _AUBADEVCFG1_WDTPS_LENGTH                0x00000005

//#define _AUBADEVCFG1_WDTSPGM_POSITION            0x00000015
//#define _AUBADEVCFG1_WDTSPGM_MASK                0x00200000
//#define _AUBADEVCFG1_WDTSPGM_LENGTH              0x00000001

//#define _AUBADEVCFG1_WINDIS_POSITION             0x00000016
//#define _AUBADEVCFG1_WINDIS_MASK                 0x00400000
//#define _AUBADEVCFG1_WINDIS_LENGTH               0x00000001

//#define _AUBADEVCFG1_FWDTEN_POSITION             0x00000017
//#define _AUBADEVCFG1_FWDTEN_MASK                 0x00800000
//#define _AUBADEVCFG1_FWDTEN_LENGTH               0x00000001

//#define _AUBADEVCFG1_FWDTWINSZ_POSITION          0x00000018
//#define _AUBADEVCFG1_FWDTWINSZ_MASK              0x03000000
//#define _AUBADEVCFG1_FWDTWINSZ_LENGTH            0x00000002

//#define _AUBADEVCFG1_DMTCNT_POSITION             0x0000001A
//#define _AUBADEVCFG1_DMTCNT_MASK                 0x7C000000
//#define _AUBADEVCFG1_DMTCNT_LENGTH               0x00000005

//#define _AUBADEVCFG1_FDMTEN_POSITION             0x0000001F
//#define _AUBADEVCFG1_FDMTEN_MASK                 0x80000000
//#define _AUBADEVCFG1_FDMTEN_LENGTH               0x00000001

//#define _AUBADEVCFG1_w_POSITION                  0x00000000
//#define _AUBADEVCFG1_w_MASK                      0xFFFFFFFF
//#define _AUBADEVCFG1_w_LENGTH                    0x00000020

//#define _AUBADEVCFG0_DEBUG_POSITION              0x00000000
//#define _AUBADEVCFG0_DEBUG_MASK                  0x00000003
//#define _AUBADEVCFG0_DEBUG_LENGTH                0x00000002

//#define _AUBADEVCFG0_JTAGEN_POSITION             0x00000002
//#define _AUBADEVCFG0_JTAGEN_MASK                 0x00000004
//#define _AUBADEVCFG0_JTAGEN_LENGTH               0x00000001

//#define _AUBADEVCFG0_ICESEL_POSITION             0x00000003
//#define _AUBADEVCFG0_ICESEL_MASK                 0x00000018
//#define _AUBADEVCFG0_ICESEL_LENGTH               0x00000002

//#define _AUBADEVCFG0_TRCEN_POSITION              0x00000005
//#define _AUBADEVCFG0_TRCEN_MASK                  0x00000020
//#define _AUBADEVCFG0_TRCEN_LENGTH                0x00000001

//#define _AUBADEVCFG0_BOOTISA_POSITION            0x00000006
//#define _AUBADEVCFG0_BOOTISA_MASK                0x00000040
//#define _AUBADEVCFG0_BOOTISA_LENGTH              0x00000001

//#define _AUBADEVCFG0_FECCCON_POSITION            0x00000008
//#define _AUBADEVCFG0_FECCCON_MASK                0x00000300
//#define _AUBADEVCFG0_FECCCON_LENGTH              0x00000002

//#define _AUBADEVCFG0_FSLEEP_POSITION             0x0000000A
//#define _AUBADEVCFG0_FSLEEP_MASK                 0x00000400
//#define _AUBADEVCFG0_FSLEEP_LENGTH               0x00000001

//#define _AUBADEVCFG0_DBGPER_POSITION             0x0000000C
//#define _AUBADEVCFG0_DBGPER_MASK                 0x00007000
//#define _AUBADEVCFG0_DBGPER_LENGTH               0x00000003

//#define _AUBADEVCFG0_SMCLR_POSITION              0x0000000F
//#define _AUBADEVCFG0_SMCLR_MASK                  0x00008000
//#define _AUBADEVCFG0_SMCLR_LENGTH                0x00000001

//#define _AUBADEVCFG0_SOSCGAIN_POSITION           0x00000010
//#define _AUBADEVCFG0_SOSCGAIN_MASK               0x00030000
//#define _AUBADEVCFG0_SOSCGAIN_LENGTH             0x00000002

//#define _AUBADEVCFG0_SOSCBOOST_POSITION          0x00000012
//#define _AUBADEVCFG0_SOSCBOOST_MASK              0x00040000
//#define _AUBADEVCFG0_SOSCBOOST_LENGTH            0x00000001

//#define _AUBADEVCFG0_POSCGAIN_POSITION           0x00000013
//#define _AUBADEVCFG0_POSCGAIN_MASK               0x00180000
//#define _AUBADEVCFG0_POSCGAIN_LENGTH             0x00000002

//#define _AUBADEVCFG0_POSCBOOST_POSITION          0x00000015
//#define _AUBADEVCFG0_POSCBOOST_MASK              0x00200000
//#define _AUBADEVCFG0_POSCBOOST_LENGTH            0x00000001

//#define _AUBADEVCFG0_EJTAGBEN_POSITION           0x0000001E
//#define _AUBADEVCFG0_EJTAGBEN_MASK               0x40000000
//#define _AUBADEVCFG0_EJTAGBEN_LENGTH             0x00000001

//#define _AUBADEVCFG0_FDEBUG_POSITION             0x00000000
//#define _AUBADEVCFG0_FDEBUG_MASK                 0x00000003
//#define _AUBADEVCFG0_FDEBUG_LENGTH               0x00000002

//#define _AUBADEVCFG0_w_POSITION                  0x00000000
//#define _AUBADEVCFG0_w_MASK                      0xFFFFFFFF
//#define _AUBADEVCFG0_w_LENGTH                    0x00000020

//#define _AUBADEVCP0_CP_POSITION                  0x0000001C
//#define _AUBADEVCP0_CP_MASK                      0x10000000
//#define _AUBADEVCP0_CP_LENGTH                    0x00000001

//#define _AUBADEVCP0_w_POSITION                   0x00000000
//#define _AUBADEVCP0_w_MASK                       0xFFFFFFFF
//#define _AUBADEVCP0_w_LENGTH                     0x00000020

